{"content":"<body>\n<h2>데브시스터즈의 준실시간 지표 서비스 도입 과정</h2>\n\n<p>데브시스터즈 데이터플랫폼그룹의 박기범, 서혜인입니다. 사업 지표를 신속하고 정확하게 확인하고 싶어하는 요구에 부응하기 위해, 데브시스터즈는 준실시간 지표 서비스 도입 과정에서 겪었던 기술적 도전 과제와 해결 과정을 공유합니다.</p>\n\n<h3>기존 지표 환경과 한계</h3>\n<p>2015년부터 Spark와 Elastic Stack 기반 빅데이터 플랫폼을 운영하고, 2021년 Databricks를 도입하여 Lakehouse Architecture 환경을 구축했습니다. 기존 지표 서비스는 세 가지 방식으로 구성되었습니다:</p>\n<ul>\n<li>게임 서버 세션 수 기반 동시 접속자 지표 집계</li>\n<li>운영계 DB 및 로그 ETL 후 Data Warehouse/Data Mart 적재 (시간별/일별 배치)</li>\n<li>Elasticsearch 기반 Kibana 준실시간 대시보드 활용</li>\n</ul>\n<p>하지만 기존 환경에는 다음과 같은 한계가 있었습니다:</p>\n<ul>\n<li><strong>동접 지표 상세화 부족</strong>: 국가별, 스토어별 세부 동접 지표 확인 불가</li>\n<li><strong>DB 기반 지표 집계 지연</strong>: 시간별 지표 집계에 1시간 소요로 신속한 의사결정 어려움</li>\n<li><strong>Kibana 대시보드 운영 문제</strong>: 대규모 트래픽 시 Elastic Stack 운영 비용 과다 및 성능 저하, 지표 집계 정확성 문제 (메타 정보 반영 어려움)</li>\n</ul>\n\n<h3>새로운 준실시간 지표 파이프라인 구축 요구사항</h3>\n<p>이러한 한계를 극복하기 위해 새로운 준실시간 지표 파이프라인 구축의 요구사항은 다음과 같습니다:</p>\n<ul>\n<li><strong>지표 범위</strong>: 국가, OS, 스토어 등 다양한 기준의 핵심 지표 (회원가입, 동접, 매출) 즉시 확인</li>\n<li><strong>클라이언트 로그 적극 활용</strong>: 확장된 클라이언트 로그 SDK를 통한 '하트비트 로그' 추가 및 활용</li>\n<li><strong>10분 이내 지연 시간</strong>: SLO 10분 설정, 고부하 상황에서도 만족</li>\n<li><strong>적절한 데이터 인프라 비용</strong>: 파이프라인 운영 비용 최적화</li>\n<li><strong>SQL 기반 ETL</strong>: 복잡한 비즈니스 로직(환율, 환불 등) 반영을 위한 SQL 활용</li>\n</ul>\n\n<h3>플랫폼 선택 및 구현</h3>\n<p>다양한 프레임워크를 검토한 결과, 다음과 같은 플랫폼을 선택하고 구현했습니다:</p>\n<ul>\n<li><strong>스트리밍 파이프라인</strong>:</li>\n<ul>\n<li><strong>KSQL</strong>: 파티션 편향으로 인한 데이터 처리 성능 및 정확성 문제 발생, 제외</li>\n<li><strong>Databricks DLT</strong>: 파이프라인 분리 시 클러스터 비용 초과 문제 발생, 대안 모색</li>\n<li><strong>Spark Streaming</strong>: 단일 클러스터 공유를 통한 비용 효율성 및 유연성 확보, 최종 선택</li>\n</ul>\n<li><strong>대시보드</strong>: Kibana 채택. Auto Refresh 기능 및 시계열 그래프 표현 용이성 활용.</li>\n</ul>\n<p><strong>최종 데이터 파이프라인 구조</strong>:</p>\n<ul>\n<li><strong>Spark Streaming (전처리)</strong>: Kafka topic에서 원본 로그를 읽어와 기본적인 전처리 및 stream-stream JOIN 연산을 수행하여 Delta Table 형태로 Silver Layer에 저장.</li>\n<li><strong>Spark/Databricks SQL (집계)</strong>: Silver Layer의 Delta Table 데이터를 기반으로 복잡한 비즈니스 로직을 반영한 집계 작업을 SQL로 수행. Airflow를 통해 2분 간격 Micro batch로 실행.</li>\n<li><strong>Spark (Elasticsearch 전송)</strong>: 집계된 Gold Layer 지표 데이터를 Elasticsearch로 전송하여 Kibana에서 조회 가능하도록 함.</li>\n</ul>\n\n<h3>준실시간 지표 서비스 도입 후 변화</h3>\n<p>2024년 6월 '쿠키런: 모험의 탑' 출시일에 첫 공개된 준실시간 지표 서비스는 높은 사내 관심을 받았습니다. 런칭 당일 접속률 30%를 기록하며, 게임팀의 마케팅 캠페인 전략 수립, 앱 푸시 송출 등 신속한 의사결정에 크게 기여했습니다. '쿠키런: 모험의 탑'의 성공적인 성과 달성에 간접적으로 기여하며 데이터 임팩트를 창출했습니다.</p>\n<p>데브시스터즈 데이터플랫폼그룹은 데이터 기반의 비즈니스 성과 창출에 함께할 인재를 찾고 있습니다.</p>\n</body>","createdAt":"2025-08-12T16:25:12.482Z","language":"ko"}