{"content":"<body>\n\t<ul>\n\t\t<li>The author, Soyeon Ji, a frontend developer at Toss, improved the accessibility of the Toss customer center chatbot.</li>\n\t\t<li>Previously, screen reader users could not perceive screen changes when new messages or buttons appeared in the chatbot, causing them to miss the conversational flow.</li>\n\t\t<li>To address this, the author focused on creating a natural flow for screen reader users by reflecting the visual UI flow in focus movement.</li>\n\t\t<li>This involved ensuring the focus moved to new content when the screen changed, guiding the user through the conversation.</li>\n\t\t<li>A key challenge was the timing of focus movement. Simply using `target.focus()` caused abrupt scrolling, disrupting the smooth auto-scroll feature.</li>\n\t\t<li>The solution involved a two-step process: first smoothly scrolling to the message box using `scrollIntoView({ behavior: 'smooth' })`, and then, after a short delay (around 1 second), moving the focus using `target.focus({ preventScroll: true })` to prevent the focus change from overriding the scroll.</li>\n\t\t<li>Additionally, an auditory cue, \"Please select a menu button below,\" was added for screen reader users to inform them of available buttons after a text message.</li>\n\t\t<li>Visual cues like typing animations were translated into auditory feedback using `aria-live=\"polite\"` for messages like \"The agent is typing\" and sound effects for message sending/receiving, providing a more comprehensive user experience.</li>\n\t\t<li>The author realized that accessibility is not just for users with disabilities but enhances clarity and friendliness for all users.</li>\n\t\t<li>The goal is to establish these accessibility improvements as a common pattern within the team, potentially by creating reusable utilities for focus management and timing.</li>\n\t\t<li>The ultimate aim is to create services that users can confidently use even with their eyes closed.</li>\n\t</ul>\n</body>","createdAt":"2025-08-13T09:44:51.420Z","language":"en"}