{"title":"기술 뉴스 #279 : 25-10-01","content":"<body>\n<h1>최신 기술 트렌드 및 뉴스 요약</h1>\n\n<h2>웹 개발</h2>\n<ul>\n<li>Apple의 비공개 CSS 속성 `-apple-visual-effect`를 통한 Liquid Glass 효과 구현 가능성이 언급되었습니다. (출처: WebKit 저장소 PR)</li>\n<li>디자인 시스템은 유연성이 필요하며, 상황에 맞는 패턴 개발과 핵심 원칙 유지를 위한 '디자인 방언'의 중요성이 강조되었습니다. (출처: Design Dialects: Breaking the Rules, Not the System)</li>\n</ul>\n\n<h2>기타 개발</h2>\n<ul>\n<li>LLM을 활용한 코딩 방식으로, GitHub 이슈 맥락 제공 및 Claude Code를 이용한 설계-구현 분리가 소개되었습니다. (출처: 내가 LLM과 함께 코딩하는 방식)</li>\n<li>Ghostty 터미널 프로젝트의 첫 라이브러리인 `libghostty-vt` 개발이 시작되었으며, 터미널 에뮬레이터 기능의 크로스 플랫폼 제공을 목표로 합니다. (출처: Libghostty Is Coming)</li>\n<li>`@ctrl/tinycolor` 패키지에 대한 공급망 공격 사례가 공유되었으며, npm 토큰 탈취로 인해 다수의 패키지가 악성 버전으로 게시되었습니다. (출처: @ctrl/tinycolor Supply Chain Attack Post-mortem)</li>\n<li>Chrome DevTools MCP가 공개되어 AI 코딩 에이전트의 브라우저 디버깅 및 문제 파악을 지원합니다. (출처: Chrome DevTools (MCP) for your AI agent)</li>\n<li>GitHub Copilot Spaces, GitHub Copilot CLI, Copilot coding agent의 일반 출시 및 프리뷰 공개 소식이 전해졌습니다. (출처: Copilot Spaces is now generally available, GitHub Copilot CLI is now in public preview, Copilot coding agent is now generally available)</li>\n</ul>\n\n<h2>인프라</h2>\n<ul>\n<li>DORA 2025 보고서에서 AI 채택의 보편화와 사용자 중심 접근, 플랫폼 엔지니어링의 중요성이 강조되었습니다. (출처: Announcing the 2025 DORA Report: State of AI-Assisted Software Development)</li>\n<li>카카오페이증권은 고객 중심의 서비스 상태 가시화 프로젝트 '핑크와드'를 소개하며, 장애 발생 시 신속한 정보 공유를 통한 문제 해결을 지원합니다. (출처: 서비스에 와드 박기: 서비스 상태 가시화 프로젝트, 핑크와드를 소개합니다.)</li>\n</ul>\n\n<h2>AI</h2>\n<ul>\n<li>Antrophic에서 Claude Sonnet 4.5를 공개했으며, SWE-bench Verfied 평가에서 최고의 정확도를 기록하고 이전 버전 대비 성능 향상을 보였습니다. Claude Code의 체크포인트 기능 및 VS Code 익스텐션 지원 강화 소식도 함께 전해졌습니다. (출처: Introducing Claude Sonnet 4.5)</li>\n<li>Claude Agent SDK 변경 및 에이전트 구축 용이성 증대 소식이 있습니다. (출처: Building agents with the Claude Agent SDK)</li>\n<li>OpenAI는 새로운 비디오 생성 모델 Sora 2를 발표하고 Sora iOS 앱을 출시했습니다. (출처: Sora 2 is here)</li>\n<li>xAI는 Grok 4와 유사한 성능을 더 적은 토큰으로 달성하는 비용 효율적인 추론 모델 Grok 4 Fast를 발표했습니다. (출처: Grok 4 Fast)</li>\n<li>Stripe와 OpenAI는 ChatGPT를 통한 결제를 지원하는 인스턴트 체크아웃과 개방형 표준 ACP(Agentic Commerce Protocol)를 발표했습니다. (출처: Developing an open standard for agentic commerce)</li>\n<li>Auth0 for AI Agents가 발표되었으며, AI 에이전트의 권한 제어 및 보안 강화를 목표로 합니다. (출처: Announcing Auth0 for AI Agents: Powering the Future of AI, Securely)</li>\n</ul>\n\n<h2>볼만한 링크</h2>\n<ul>\n<li>Ruby Central의 RubyGems 인수 과정에서 발생한 논란과 커뮤니티 내 갈등에 대한 내용이 상세히 다루어졌습니다. (출처: Ruby Central’s Attack on RubyGems, Shopify, pulling strings at Ruby Central, forces Bundler and RubyGems takeover)</li>\n<li>AI 코딩의 함정이라는 주제로, AI 활용으로 인한 결과적인 속도 저하 가능성과 팀 건강 저해 문제, 그리고 이를 해결하기 위한 모범 사례들이 제시되었습니다. (출처: The AI coding trap)</li>\n<li>소셜 앱 시장에서 Bluesky의 AT Protocol의 가능성과 오픈 소셜의 이점이 강조되었습니다. (출처: Open Social)</li>\n<li>Zed Industries의 오픈소스 기반 채용 경험이 공유되었습니다. (출처: Hired Through GitHub: Part 1)</li>\n<li>Oracle의 JavaScript 상표권 소송에 대한 펀딩 소식이 전해졌습니다. (출처: Help Us Raise $200k to Free JavaScript from Oracle)</li>\n</ul>\n\n<h2>IT 업계 뉴스</h2>\n<ul>\n<li>Spotify 창업자 Daniel Ek가 CEO직에서 물러나고 공동 CEO 체제로 전환했습니다. (출처: Spotify’s founder and CEO Daniel Ek is stepping down)</li>\n<li>국가정보자원관리원에서 무정전전원장치 배터리 이전 중 발생한 화재로 인해 주요 정부 서비스에 장애가 발생했습니다. (출처: 국가정보자원관리원 화재)</li>\n<li>호주에서 16세 미만 아동의 소셜 미디어 규제를 검토하며 GitHub을 해로운 소셜 네트워크로 분류할지 논의 중입니다. (출처: Australia thinks GitHub is as risky for kids as TikTok)</li>\n<li>카카오톡이 피드형 친구 탭 업데이트를 사용자 피드백을 반영하여 기존 친구 목록으로 되돌립니다. (출처: 카카오톡, 피드형 친구탭…친구목록으로 되돌린다)</li>\n<li>NVIDIA와 Intel이 AI 인프라 및 개인 컴퓨팅 제품 개발을 위해 협력하며, NVIDIA는 Intel 주식에 투자합니다. (출처: NVIDIA and Intel to Develop AI Infrastructure and Personal Computing Products)</li>\n</ul>\n\n<h2>프로젝트</h2>\n<ul>\n<li>`zoxide`: 더 똑똑한 `cd` 명령어</li>\n</ul>\n\n<h2>버전 업데이트</h2>\n<ul>\n<li>JDK 25</li>\n<li>JUnit v6.0.0</li>\n<li>PostgreSQL 18</li>\n<li>WebAssembly Specification 3.0</li>\n<li>GitLab v18.4</li>\n<li>Optique v0.5.0</li>\n<li>Ghostty v1.2.0</li>\n<li>DuckDB v1.4.0</li>\n<li>Swift v6.2</li>\n<li>DuckLake v0.3</li>\n<li>FastAPI v0.118.0</li>\n<li>Grafana v12.2</li>\n<li>Node.js v22.20.0 (LTS)</li>\n<li>Node.js v24.9.0 (Current)</li>\n<li>astro v5.14</li>\n</ul>\n</body>","createdAt":"2025-09-30T18:34:00.000+00:00","link":"https://blog.outsider.ne.kr/1773","language":"ko"}