{"title":"기술 뉴스 #272 : 25-06-16","content":"<body>\n<ul>\n<li><p>웹 개발 관련</p>\n<ul>\n<li>Shopify에서 Module 사용 시 발생했던 import maps 로딩 문제를 해결하며 import maps의 이점과 단점을 설명하고, 전역 import maps와 머지 알고리즘을 통해 문제를 해결한 과정을 소개합니다.</li>\n<li>카카오페이에서 Next.js 웹 뷰 배포 시 CORS 오류와 Version Skew 문제를 겪으며, crossOrigin 설정을 통해 해결했지만 특정 브라우저에서 발생한 CORS 오류를 dynamic import로 해결하고, 이후 파일 해시 문제로 인한 404 오류를 Sticky Session으로 완화한 경험을 공유합니다.</li>\n<li>RSC에서 모듈 임포트 방식을 설명하고, 클라이언트와 서버가 코드를 재사용하면서 발생하는 문제를 server-only와 client-only 모듈, use client 및 use server 지시어를 통해 해결하는 방법을 설명합니다.</li>\n<li>Mutation XSS 취약점 해결을 위해 HTML 속성의 `<`, `>` 문자를 이스케이프 처리하도록 HTML 스펙이 변경되고 Chrome에 도입된 내용을 소개합니다.</li>\n<li>Nuxt 4 릴리스 계획이 수정되어 6월 2일 알파 버전으로 릴리스되고, Nitro v3 준비 후 Nuxt 5를 릴리스할 예정임을 공개합니다.</li>\n<li>국내 FE 개발자 249명을 대상으로 한 설문 조사 결과를 공유하며, TypeScript 사용률, React 사용률, Zustand의 상태 관리 라이브러리 1위, Vite의 빌드 도구 1위 선정 결과를 알립니다.</li>\n</ul>\n</li>\n<li><p>그 밖의 개발 관련</p>\n<ul>\n<li>Armin Ronarcher가 Claude Code를 활용한 에이전트 코딩 방식을 공유하며, 단순한 도구 사용, Go 언어 활용, 의존성 관리 시 주의점 등을 강조하고 AI 발전 속도를 언급합니다.</li>\n<li>Cloudflare가 Claude Code로 작성한 OAuth 2.1 라이브러리 커밋을 분석하며, 프롬프트 기록 공개 방식과 AI 회의론자였던 엔지니어의 결과물, 프롬프트의 중요성과 사람의 개입 필요성을 설명합니다.</li>\n<li>Claude Code로 작성된 Cloudflare OAuth 라이브러리를 평가하며, 코드의 인상적인 부분과 이해하기 어려운 CORS 설정, 표준 보안 헤더 부족, OAuth 명세 미숙으로 인한 인증 오류 등을 지적합니다.</li>\n<li>jemalloc 개발자인 Jason Evans가 20년간의 개발 회고를 통해 메모리 할당기 개발 과정, FreeBSD 통합, Facebook에서의 힙 프로파일링 구현, 오픈소스 기여 유치 실패 등을 공유하며 가장 보람찬 프로젝트였다고 회상합니다.</li>\n</ul>\n</li>\n<li><p>인프라 관련</p>\n<ul>\n<li>6월 12일 발생한 Cloudflare 서비스 장애의 원인이 Workers KV 인프라의 일부가 타사 클라우드에 의존하고 있었기 때문임을 설명하고, 단일 장애점 부재에 대한 Cloudflare의 미흡한 부분을 지적합니다.</li>\n<li>Google Cloud에서 발생한 대규모 장애의 원인이 Service Control 바이너리의 널포인트 오류와 정책 변경 시 의도치 않은 빈 필드 포함 때문이었음을 설명합니다.</li>\n<li>Datadog 기술 콘퍼런스 Dash에서 공개된 AI 워크로드 모니터링, Flex Logs, Datadog Sheets, 개선된 IDP, Bits AI SRE 등 신규 기능들을 소개합니다.</li>\n<li>Kubernetes의 CNI, Ingress/Egress, 정책 등 네트워킹 컴포넌트 학습을 위한 가이드 사이트를 소개합니다.</li>\n<li>LLM 추론 작업의 특성을 고려하여 Kubernetes Gateway API에 추론 전용 라우팅 기능을 추가하는 Inference 확장을 소개하고, Gateway 라우팅과 Inference Model API, InferencePool 사용법을 설명합니다.</li>\n<li>Supabase에서 Vitess 공동 창시자가 합류하여 Postgres용 Vitess인 Multigres를 개발하게 되었음을 알리고, Multigres가 Postgres 샤딩을 위한 프록시 역할을 함을 설명합니다.</li>\n<li>Canonical이 보안 개선을 위해 sudo를 Rust 기반의 sudo-rs로 대체하기로 발표한 내용을 소개합니다.</li>\n</ul>\n</li>\n<li><p>AI 관련</p>\n<ul>\n<li>Simon Willison이 AI Engineer World's Fair에서 키노트를 통해 지난 6개월간 LLM 모델의 변화를 자전거 타는 펠리컨 SVG 이미지 생성 과정을 예시로 들어 설명합니다.</li>\n<li>Hugging Face에서 출시한 GUI 에이전트 성능 벤치마크 도구인 ScreenSuite를 소개하고, Ubuntu 및 Android 가상머신 테스트 지원 내용을 설명합니다.</li>\n<li>Microsoft에서 RAG 성능 벤치마크 도구인 BenchmarkQED를 공개하며, AutoQ, AutoE, AutoD 구성 요소와 각 기능에 대해 설명합니다.</li>\n<li>OpenAI가 o3 모델 가격을 80% 인하했다는 소식을 전합니다.</li>\n</ul>\n</li>\n<li><p>IT 업계 뉴스</p>\n<ul>\n<li>Yes24가 5월 9일 랜섬웨어 해킹으로 인한 서비스 중단 후 13일 복구를 완료했으며, 일부 서비스는 순차적으로 복구 중임을 알립니다.</li>\n<li>Apple의 Macintosh 초기 개발자이자 QuickDraw, MacPaint 등을 만든 Bill Atkinson이 74세로 별세했다는 소식을 전합니다.</li>\n<li>Node.js 생태계에 크게 기여한 Mikeal Rogers가 암 투병 끝에 사망했다는 소식을 전합니다.</li>\n<li>유럽 연합 사이버 보안 기관 ENISA에서 CVE의 대안으로 유럽 취약점 데이터베이스 EUVD 베타 버전을 출시했음을 알립니다.</li>\n<li>GitHub에 10억 번째 저장소가 생성되었다는 소식을 전합니다.</li>\n</ul>\n</li>\n<li><p>프로젝트</p>\n<ul>\n<li>AXe: Apple 접근성 API를 사용해 iOS 시뮬레이터를 조작하는 CLI 도구</li>\n<li>Onlook: 디자이너를 위한 Cursor를 표방하며 비주얼 에디터를 우선시하는 오픈소스 코드 에디터</li>\n<li>SimplePDF: 웹에서 사용할 수 있는 PDF 에디터</li>\n<li>Talos Linux: Kubernetes용으로 제작된 Linux 배포판</li>\n<li>container-use: 코딩 에이전트를 위한 개발 환경</li>\n<li>Containerization: macOS에서 Linux 컨테이너를 실행할 수 있는 Apple 공개 Swift 패키지</li>\n<li>container: macOS에서 경량 가상 머신으로 Linux 컨테이너를 실행하는 Apple 공개 도구</li>\n<li>Rstest: Rspack 기반 테스팅 프레임워크</li>\n</ul>\n</li>\n<li><p>버전 업데이트</p>\n<ul>\n<li>Android v16</li>\n<li>Cursor v1.0</li>\n<li>Jest 30</li>\n<li>Oxlint v1.0.0</li>\n<li>Amaro v1.0.0</li>\n<li>LogTape v0.12.0</li>\n<li>Vitest v3.2.0</li>\n<li>Kubernetes Gateway API v1.3.0</li>\n<li>Zed v0.190.6</li>\n<li>Kargo v1.5.0</li>\n<li>Module Federation v0.15.0</li>\n<li>astro v5.9</li>\n<li>Prisma v6.9.0</li>\n<li>Ionic v8.6</li>\n<li>TinyBase v6.2</li>\n<li>ClickHouse v25.5</li>\n<li>Grafana Tempo v2.8.0</li>\n<li>Nx v21.2.0</li>\n<li>Visual Studio Code v1.101</li>\n<li>Spring Tools v4.31.0</li>\n<li>Docker Desktop v4.42</li>\n<li>Podman Desktop v1.19</li>\n<li>Node.js v24.2.0 (Current)</li>\n<li>pgAdmin 4 v9.4</li>\n<li>pnpm v10.12.1</li>\n<li>Karpenter 1.5.0</li>\n</ul>\n</li>\n</ul>\n</body>","createdAt":"2025-06-15T18:20:35.000+00:00","link":"https://blog.outsider.ne.kr/1765","language":"ko"}