{"content":"<body>\n<ul>\n<li><strong>Rolldown-Vite 공개:</strong> Rust 기반 차세대 번들러 Rolldown을 Vite에 통합한 rolldown-vite 패키지가 프리뷰로 공개되었습니다. 프로덕션 빌드 시 빌드 시간을 3~16배 단축하고 메모리 사용량을 최대 100배 줄였습니다.</li>\n<li><strong>TypeScript Native Previews 출시:</strong> Go로 작성된 TypeScript 컴파일러 및 도구가 10배의 속도 향상을 달성했으며, @typescript/native-preview를 통해 tsgo를 사용해 볼 수 있습니다.</li>\n<li><strong>Remix v3의 새로운 방향:</strong> Remix v2가 React Router v7에 통합되면서 Remix는 v3에서 웹 프레임워크를 새롭게 해석하여 더 가볍고 빠른 개발 환경을 제공할 예정입니다.</li>\n<li><strong>React Router RSC Preview 출시:</strong> React Router에 React Server Component(RSC) 프리뷰가 릴리스되어 로더에서 RSC를 사용하고, \"use server\"를 지원합니다.</li>\n<li><strong>Error.isError, Stage 4 진입:</strong> Error 객체인지 확인하는 공식 메서드 isError가 TC39에서 Stage 4가 되었습니다.</li>\n<li><strong>v0, Cursor 등과 통합:</strong> Vercel의 AI UI 생성 서비스 v0이 Cursor, Codex, Cline과 통합됩니다.</li>\n<li><strong>o3, Linux 커널 SMB 취약점 발견:</strong> OpenAI의 o3 모델이 Linux 커널의 SMB 구현에서 CVE-2025-37899 취약점을 발견했습니다.</li>\n<li><strong>Pyrefly 공개:</strong> Meta에서 Rust로 작성된 Python 타입 체커 및 IDE 확장 Pyrefly를 오픈소스로 공개했습니다.</li>\n<li><strong>Litestream 리뉴얼:</strong> SQLite 앱 실행을 위한 Litestream이 빠른 복구, Compare-and-Swap, 읽기 복제 등의 기능을 추가하여 리뉴얼되었습니다.</li>\n<li><strong>GitHub SAML 보안 강화:</strong> GitHub이 자체 SAML 구현을 오픈소스 ruby-saml로 전환하고 XML 서명 유효성 검사 등을 강화했습니다.</li>\n<li><strong>GitHub Copilot 코딩 에이전트 프리뷰:</strong> GitHub Copilot의 코딩 에이전트 기능이 공개 프리뷰로 제공됩니다.</li>\n<li><strong>Copilot Spaces 출시:</strong> GitHub이 프로젝트 문맥을 이해하는 Copilot Spaces를 발표했습니다.</li>\n<li><strong>GitHub MCP 취약점:</strong> GitHub MCP Server 사용 시 공격자가 공개 저장소에 이슈를 올려 비공개 저장소를 읽을 수 있는 취약점이 발견되었습니다.</li>\n<li><strong>DuckLake 공개:</strong> DuckDB에서 SQL을 레이크하우스 포맷으로 사용하는 DuckLake를 공개했습니다.</li>\n<li><strong>Kubernetes 배포 추적:</strong> Grafana에서 kube-state-metrics를 활용하여 Kubernetes 배포를 자동으로 추적하는 방법을 설명합니다.</li>\n<li><strong>Docker Hardened Images 출시:</strong> Docker에서 컨테이너 보안을 강화한 Docker Hardened Images를 출시했습니다.</li>\n<li><strong>Let's Encrypt TLS 클라이언트 인증서 지원 중단:</strong> Let's Encrypt가 2026년부터 TLS 클라이언트 인증서 지원을 중단합니다.</li>\n<li><strong>Amazon EKS Dashboard 출시:</strong> EKS 클러스터 모니터링을 위한 EKS Dashboard 기능이 출시되었습니다.</li>\n<li><strong>Codex 공개:</strong> OpenAI에서 소프트웨어 엔지니어링 에이전트 Codex의 리서치 프리뷰를 공개했습니다.</li>\n<li><strong>Claude 4 출시:</strong> Anthropic에서 코딩, 추론, AI 에이전트 모델인 Claude Opus 4와 Claude Sonnet 4를 공개했습니다.</li>\n<li><strong>Gemini Diffusion 발표:</strong> Google DeepMind가 Diffusion을 사용하는 첫 LLM인 Gemini Diffusion을 발표했습니다.</li>\n<li><strong>Veo 3 및 Flow 발표:</strong> Google에서 동영상 생성 모델 Veo 3와 영상 제작 도구 Flow를 발표했습니다.</li>\n<li><strong>AI in Search:</strong> Google I/O에서 검색에 AI 모드를 추가하여 심층 검색, 쇼핑 지원, 라이브 대화 기능을 제공한다고 발표했습니다.</li>\n<li><strong>NotebookLM 앱 출시:</strong> Google I/O에서 정보를 오디오로 변환하는 NotebookLM의 Android 및 iOS 앱을 발표했습니다.</li>\n<li><strong>Mary Meeker AI 리포트:</strong> Mary Meeker가 AI 투자 증가, 개발자 증가, 토큰당 추론 비용 감소 등 AI 산업의 현상을 분석한 리포트를 공개했습니다.</li>\n<li><strong>VS Code, Copilot Chat 오픈소스 공개:</strong> Microsoft가 GitHub Copilot Chat 확장을 오픈소스로 공개하고 VS Code에 통합합니다.</li>\n<li><strong>edit 오픈소스 공개:</strong> Microsoft가 Windows CLI 텍스트 편집기 edit를 Rust로 새로 만들어 오픈소스로 공개했습니다.</li>\n<li><strong>SKT 침해사고 2차 조사 결과:</strong> SKT 침해사고 조사 결과, 감염 서버 증가 및 악성코드 추가 발견, USIM 정보 등 유출이 확인되었습니다.</li>\n<li><strong>Mozilla, Pocket 종료:</strong> Mozilla가 북마크 서비스 Pocket을 7월 8일부터 중단합니다.</li>\n<li><strong>OpenAI, Jony Ive AI 하드웨어 회사 인수:</strong> OpenAI가 Jony Ive의 AI 하드웨어 회사 io를 약 65억 달러에 인수합니다.</li>\n<li><strong>OpenAI 한국 법인 설립:</strong> OpenAI가 한국에 법인을 설립하고 채용을 시작합니다.</li>\n<li><strong>프로젝트:</strong> Kubernetes History Inspector, Knip, MCP for Beginners, jules</li>\n<li><strong>버전 업데이트:</strong> Firefox 139.0, Angular v20.0.0, Storybook v9.0.0, Zod v4.0.0, Google Gen AI SDK v1.0.0, Lynx v3.2, etcd v3.6.0, Rust 1.87.0, TinyBase v6.1, Spring Data 2025.0.0, Spring Vault 3.2.0, Node.js v22.16.0 (LTS), Node.js v24.1.0 (Current), DuckDB v1.3.0, Qwik v1.14.0, Cue v0.13.0, Dart v3.8.0, Zed v0.188.3, Spring Authorization Server v1.5.0, Spring AI v1.0.0, Spring Modulith v1.4, Spring Integration v6.5, Spring for GraphQL 1.4.0, Spring Cloud v2025.0.0, Falco 0.41.0, astro v5.8, ESLint v9.27.0, Docusaurus v3.8, Flux v2.6.0, Linux Kernel v6.15, KServe v0.15, JUnit 5 v5.13.0, three.js r177</li>\n</ul>\n</body>","createdAt":"2025-08-12T18:47:18.151Z","language":"ko"}