{"content":"<body>\n<ul>\n<li>How we made JSON.stringify more than twice as fast: V8 엔진에서 JSON.stringify 성능을 2배 이상 개선한 방법. 사이드 이펙트가 없는 경우 더 빠른 경로를 사용하고, 1바이트/2바이트 문자열 최적화, SIMD 직렬화, 객체 속성 검사 최적화 등을 적용했습니다. Chrome 138부터 적용됩니다.</li>\n<li>v0.dev -> v0.app: Vercel의 AI UI 생성 서비스 v0.dev가 에이전트 인텔리전스를 통해 UI 생성을 더 쉽게 할 수 있도록 개선되어 v0.app으로 변경되었습니다.</li>\n<li>AI로 개발을 어떻게 가속화하는가: 개발에서 AI 활용법, Cursor 및 Claude Code 사용법을 담은 강연 자료입니다.</li>\n<li>Security Update for Amazon Q Developer Extension for Visual Studio Code (Version #1.84): VS Code의 Amazon Q Developer 확장(1.84.0)에 악의적인 프롬프트가 삽입되어 AWS 계정 리소스 제거 시도가 있었으나 즉시 패치되었습니다. AWS CodeBuild 취약점을 이용한 것으로 추정됩니다.</li>\n<li>Modern Node.js Patterns for 2025: ESM, fetch, AbortController 등 최신 Node.js 기능과 패턴을 소개합니다. 내장 모니터링/분석 기능, Stream, Worker Threads 활용법도 포함됩니다.</li>\n<li>Linear sent me down a local-first rabbit hole: 이슈 트래커 Linear의 빠른 반응 속도를 분석하며 local-first 아키텍처와 IndexedDB 동기화 엔진을 다룹니다. Jazz, Eletric SQL, Zero의 접근 방식을 비교합니다.</li>\n<li>pyx: a Python-native package registry, now in Beta: uv 개발사인 astral에서 Python 네이티브 패키지 레지스트리 pyx를 베타 출시했습니다. uv 최적화 및 클라이언트 단독 해결 어려운 문제 해결을 목표로 합니다.</li>\n<li>Meet your new AI coding teammate: Gemini CLI GitHub Actions: Google에서 Gemini CLI에 이어 Gemini CLI GitHub Actions를 베타 출시했습니다.</li>\n<li>Cursor Agent CLI: Cursor에서 다양한 환경에서 사용 가능한 CLI를 발표했습니다.</li>\n<li>Introducing Cerebras Code: Cerebras에서 Alibaba의 Qwen3-Coder 기반 유료 코딩 서비스 Cerebras Code Pro/Max를 출시했습니다.</li>\n<li>FAPI 2.0: The Future of API Security for High-Stakes Customer Interactions: OpenID 재단의 FAPI 2.0이 API 보안 표준을 제공하며, 상호 운용성 향상, 풍부한 권한 요청, 강력한 보안 메커니즘을 통해 오픈 뱅킹 규정을 준수합니다.</li>\n<li>Can LLMs replace on call SREs today?: LLM이 SRE를 대체할 수 있는지 Claude 4 Sonnet, GPT-4o, Gemini Pro, GPT-5 등을 사용해 장애 시나리오를 분석합니다. ClickStack 홍보 성격이 있습니다.</li>\n<li>MadeYouReset: An HTTP/2 vulnerability thwarted by Rapid Reset mitigations: HTTP/2의 stream reset을 악용하는 MadeYouReset 취약점이 공개되었습니다. 잘못된 형식의 프레임으로 강제 리셋을 유발합니다.</li>\n<li>일 평균 30억 건을 처리하는 결제 시스템의 DB를 Vitess로 교체하기 - 1. 솔루션 선정기, 2. 개발 및 운영기: Line 결제 시스템이 Nbase-T에서 Vitess로 마이그레이션한 과정과 선정 이유(안정성, 성능, 비용)를 상세히 설명합니다. Vitess 운영 경험도 공유합니다.</li>\n<li>NGINX Introduces Native Support for ACME Protocol: NGINX가 ACME 프로토콜을 기본 지원하여 SSL/TLS 인증서 관리가 용이해졌습니다.</li>\n<li>KYAML: Kubernetes’ Answer to YAML’s Configuration Chaos: YAML의 공백 및 암묵적 형변환 문제를 해결하기 위해 제안된 KYAML은 문자열 따옴표 사용, 괄호 구분, 일관된 구조 유지로 디버깅 편의성을 높입니다.</li>\n<li>Introducing Headlamp AI Assistant: Kubernetes 관리 도구 Headlamp에 AI 기반 클러스터 관리 및 문제 해결 플러그인이 추가되었습니다.</li>\n<li>OpenConnect: LinkedIn’s next-generation AI pipeline ecosystem: LinkedIn에서 피드 데이터 처리를 위한 AI 파이프라인 OpenConnect를 구축하여 출시 시간 및 오류 감지 시간을 단축했습니다. 기존 ProML의 단점을 개선했습니다.</li>\n<li>Nginx 설정 통합과 Loki 연동으로 설계한 유연한 멀티사이트 아키텍처: Line에서 Nginx 설정 중앙 관리 및 Ansible 배포 자동화, Promtail/Loki 연동으로 로그 분석 및 운영 효율성을 높였습니다.</li>\n<li>Introducing GPT-5: OpenAI가 전문가 수준의 빠른 답변과 향상된 코딩 능력을 갖춘 GPT-5를 발표했습니다. 기존 ChatGPT 서비스도 GPT-5로 통합되었습니다.</li>\n<li>gpt-oss를 소개합니다: OpenAI에서 o3 기반으로 훈련된 gpt-oss-120b, gpt-oss-20b 모델을 Apache 2.0 라이센스로 공개했습니다.</li>\n<li>Claude Opus 4.1: Anthropic에서 Claude Opus 4.1을 출시하여 SWE-bench verified 코딩 성능을 74.5%로 향상시켰습니다. 특히 다중 코드 리팩터링에서 성능이 개선되었습니다.</li>\n<li>Genie 3: A new frontier for world models: Google에서 초당 24프레임, 720p 해상도의 시뮬레이션 세계를 생성하는 범용 월드 모델 Genie 3를 발표했습니다.</li>\n<li>Qwen-Image: Crafting with Native Text Rendering: Alibaba에서 20B MMDiT 이미지 기반 모델 Qwen-Image를 공개했습니다. 우수한 텍스트 렌더링과 이미지 편집 일관성을 특징으로 합니다.</li>\n<li>Claude Sonnet 4 now supports 1M tokens of context: Claude Sonnet 4가 Anthropic API를 통해 최대 100만 개의 컨텍스트 토큰을 지원합니다.</li>\n<li>Developers, Reinvented: GitHub CEO가 개발자의 AI 수용 단계를 분석하며, AI가 코드의 90% 이상 작성하는 시대가 5년 내 도래할 것으로 전망합니다. AI 활용 능력과 협업이 중요해질 것입니다.</li>\n<li>상태없는 AI-인간 인터랙션: AI와의 상호작용에서 상태 관리를 통한 자체 완결성 있는 요청의 중요성을 강조하며, 프롬프트 관리가 핵심임을 설명합니다.</li>\n<li>Windsurf가 마진콜을 당했다: Windsurf의 인수 무산 및 Google/Cognition으로의 인수 과정을 분석하며, 수익성 문제와 모델 학습법의 중요성을 강조합니다.</li>\n<li>비하이브(Beehiiv), 차세대 뉴스레터 유니콘이 될까? (번역): Substack의 경쟁사인 Beehiiv의 성공 요인을 분석합니다. 커스터마이징 기능, 합리적인 비즈니스 모델을 통해 ARR 2,000만 달러를 돌파했습니다.</li>\n<li>Stackoverflow 2025 Developer Survey: 2025 개발자 설문조사 결과, Cargo가 가장 인정받는 클라우드 도구이며, 84%가 AI 도구를 사용하나 AI 에이전트 사용은 51%입니다. GitHub가 Jira보다 선호되며, AI 신뢰도는 낮습니다. uv가 가장 인정받는 기술입니다.</li>\n<li>Auf Wiedersehen, GitHub: GitHub CEO Thomas Dohmke가 창업을 위해 GitHub을 떠난다는 소식입니다.</li>\n<li>한국 내 구글 지도 서비스 관련 주요 질의에 대한 안내: Google의 한국 지도 데이터 반출 요청에 대한 답변으로, 요청 데이터는 국가기본도이며 보안 심사를 마쳤다고 설명합니다.</li>\n<li>'국내 최대 커뮤니티' 디시인사이드, M&A 매물로: 국내 최대 커뮤니티 디시인사이드가 경영권 매각을 추진하며, 높은 영업이익률과 기업 가치를 기록했습니다.</li>\n<li>'토종 OTT' 왓챠, 기업회생 절차 개시…\"서비스는 정상운영\": OTT 서비스 왓챠가 기업회생 절차에 들어갔으나 서비스는 정상 운영됩니다.</li>\n<li>“한국 HR 테크 산업 최대 규모 거래” 리멤버, 스웨덴 투자사에 5,000억 원에 매각: 명함 공유 서비스 리멤버가 스웨덴 투자사 EQT에 5,000억 원에 매각되었습니다.</li>\n<li>Groq Code CLI: Groq에서 제공하는 코딩 CLI 도구입니다.</li>\n<li>Opal: Google의 실험 프로젝트로, 자연어로 미니 AI 앱을 만들 수 있습니다. (미국에서만 사용 가능)</li>\n<li>Google Sans Code: Google에서 공개한 코딩용 오픈소스 폰트입니다.</li>\n<li>Engineering Blog Posts from Top Tech Companies: 해외 주요 기술 기업들의 엔지니어링 블로그를 모아놓은 사이트입니다.</li>\n<li>Ruby on Rails KR: 한국 루비 온 레일즈 개발자 커뮤니티입니다.</li>\n<li>Gradle v9.0.0: Java 빌드 도구 Gradle의 v9.0.0 릴리스 공지입니다.</li>\n<li>Debian 13(trixie): Linux 커널 Debian 13(trixie) 릴리스 공지입니다.</li>\n<li>Crossplane v2.0.0: 외부 인프라 관리를 위한 Kubernetes 애드온 Crossplane v2.0.0 릴리스 공지입니다. 인프라뿐 아니라 애플리케이션 지원, Composition으로 Kubernetes 리소스 관리도 가능합니다.</li>\n<li>k0rdent v1.0.0: 플랫폼 엔지니어링팀을 위한 분산 컨테이너 관리 환경 k0rdent v1.0.0 릴리스 공지입니다.</li>\n<li>Automerge v3.0: CRDT 라이브러리 Automerge v3.0 릴리스 공지입니다.</li>\n<li>Argo CD v3.1.0: Kubernetes 배포 도구 Argo CD v3.1.0 릴리스 공지입니다.</li>\n<li>panda v1.0.0: CSS-in-JS 라이브러리 panda v1.0.0 릴리스 공지입니다.</li>\n<li>Vite v7.1.0: 프론트엔드 빌드 도구 Vite v7.1.0 변경 사항입니다.</li>\n<li>Hono v4.9.0: 엣지용 웹 프레임워크 Hono v4.9.0 릴리스 공지입니다.</li>\n<li>PyTorch v2.8.0: Python 딥러닝 프레임워크 PyTorch v2.8.0 릴리스 공지입니다.</li>\n<li>Zed v0.193.3: 코드 에디터 Zed v0.193.3 릴리스 공지입니다.</li>\n<li>Cursor v1.4: AI 코드 에디터 Cursor v1.4 릴리스 공지입니다.</li>\n<li>Module Federation v0.18.0: JavaScript 애플리케이션 아키텍처 패턴 Module Federation v0.18.0 릴리스 공지입니다.</li>\n<li>React Native Skia v2.2.0: React Native용 Skia v2.2.0 릴리스 공지입니다.</li>\n<li>pnpm v10.14.0: Node.js 패키지 매니저 pnpm v10.14.0 릴리스 공지입니다.</li>\n<li>Node.js v22.18.0 (LTS): JavaScript 런타임 Node.js v22.18.0 (LTS) 릴리스 공지입니다.</li>\n<li>Node.js v24.6.0 (Current): JavaScript 런타임 Node.js v24.6.0 (Current) 릴리스 공지입니다.</li>\n<li>Cue v0.14.0: 구성 언어 Cue v0.14.0 릴리스 공지입니다.</li>\n<li>Prisma v6.13.0: TypeScript/Node.js 데이터베이스 툴킷 Prisma v6.13.0 릴리스 공지입니다.</li>\n<li>TypeScript v5.9: Microsoft가 만든 JavaScript transpiler TypeScript v5.9 릴리스 공지입니다.</li>\n<li>Ionic v8.7: 하이브리드 모바일 앱 프레임워크 Ionic v8.7 릴리스 공지입니다.</li>\n<li>ESLint v9.33.0: JavaScript 코드 분석 도구 ESLint v9.33.0 릴리스 공지입니다.</li>\n<li>A2A protocol v0.3.0: AI 에이전트 간 통신 프로토콜 A2A protocol v0.3.0 릴리스 공지입니다.</li>\n<li>Docker Desktop v4.44: 데스크톱용 Docker 애플리케이션 Docker Desktop v4.44 릴리스 공지입니다.</li>\n<li>ClickHouse v25.7: 컬럼형 데이터베이스 ClickHouse v25.7 릴리스 공지입니다.</li>\n<li>Spring gRPC v0.10.0: Spring의 gRPC 라이브러리 Spring gRPC v0.10.0 릴리스 공지입니다.</li>\n<li>Phoenix LiveView v1.1.0: Phoenix 서버의 서버 렌더링으로 웹 페이지를 만드는 기능 Phoenix LiveView v1.1.0 릴리스 공지입니다.</li>\n<li>OpenKruise v1.4.0: Kubernetes용 애플리케이션 관리 OpenKruise v1.4.0 릴리스 공지입니다.</li>\n<li>Istio v1.27.0: 서비스 매쉬 Istio v1.27.0 릴리스 공지입니다.</li>\n<li>Flutter v3.35: iOS, Android 네이티브 앱을 만드는 프레임워크 Flutter v3.35 릴리스 공지입니다.</li>\n<li>astro v5.13: JavaScript 웹 프레임워크 astro v5.13 릴리스 공지입니다.</li>\n<li>Omarchy v1.13.0: DHH가 만든 Arch Linux의 Hyprland 설정 Omarchy v1.13.0 릴리스 공지입니다.</li>\n<li>Go v1.25: 프로그래밍 언어 Go v1.25 릴리스 공지입니다.</li>\n<li>React Native v0.81.0: React를 이용한 모바일 앱 개발 프레임워크 React Native v0.81.0 릴리스 공지입니다.</li>\n</ul>\n</body>","createdAt":"2025-08-16T03:11:18.273Z","language":"ko"}