{"title":"기술 뉴스 #285 : 26-01-01","content":"<body>\n<h1>웹 개발 관련 최신 소식</h1>\n\n<h2>RSC Explorer 소개</h2>\n<p>최근 RSC 취약점이 공개되면서 RSC에 대한 관심이 높아지고 있습니다. Dan Abramov가 RSC의 작동 방식을 이해하기 쉽게 돕기 위해 RSC Explorer를 공개했습니다. 이 도구를 사용하면 서버와 클라이언트 코드를 입력하고 실행하여 생성되는 RSC 스트림과 렌더링되는 HTML을 단계별로 비교하며 확인할 수 있습니다. (영어)</p>\n\n<h2>Web Vitals: LCP 및 INP 지원 확대</h2>\n<p>Web Vitals의 LCP(Largest Contentful Paint)와 INP(Interaction to Next Paint)가 크로미움 계열 브라우저 외에 WebKit 기반에서도 지원됩니다. Safari 26.2부터 LCP API와 Event Timing API를 지원하게 되면서 Interop 2025 프로젝트의 일환으로 진행된 작업입니다. (CLS는 아직 지원되지 않습니다.) (영어)</p>\n\n<h2>CSS Grid Lanes: Masonry 레이아웃 구현</h2>\n<p>CSS Grid Lanes를 사용하면 CSS만으로 Masonry 레이아웃을 구현할 수 있습니다. Pinterest UI로 유명한 Masonry 레이아웃을 쉽게 만들 수 있으며, grid-template-* 속성을 사용하여 각 레인의 크기를 조절하고 레인 간의 교차 또는 아이템 배열 방향을 지정할 수 있습니다. (영어)</p>\n\n<h2>Chrome 개발자 도구, 개별 네트워크 요청 스로틀링 기능 추가</h2>\n<p>Chrome 144부터 Chrome 개발자 도구에서 개별 네트워크 요청에 대한 스로틀링 제어 기능이 추가됩니다. 기존에는 네트워크 전체에 대해 스로틀링이 가능했지만, 이제는 특정 도메인이나 URL별로 속도를 조절하거나 차단할 수 있습니다. (영어)</p>\n\n<h2>v0 프롬프트 작성 가이드</h2>\n<p>Vercel의 AI 기반 UI 생성 서비스 v0의 사용자 패턴 분석 결과, 효과적인 프롬프트에는 제품 표면, 사용 맥락, 제약 조건 및 취향이 포함될 때 생성 속도가 빨라지고 더 나은 UX와 코드를 얻을 수 있다고 합니다. 해당 글에서는 좋은 프롬프트 예시와 사용 방법을 설명합니다. (영어)</p>\n\n<h2>HTMX 활용 권장</h2>\n<p>이 글은 HTMX를 사용해볼 것을 권장하는 내용입니다. HTML을 직접 사용하거나 React를 사용하는 대안 외에 HTMX라는 세 번째 선택지가 있으며, HTMX가 더 적합한 상황에서는 좋은 대안이 될 수 있다고 설명합니다. (영어)</p>\n\n<h2>새로운 린터 FLint 소개</h2>\n<p>ESLint가 업계를 선도하는 가운데, Biome과 Oxlint가 네이티브 속도로 도전하고 있습니다. 이러한 상황에서 FLint라는 실험적인 새로운 린터가 공개되었습니다. TypeScript로 제작되었으며, 언어별 플러그인을 활용한 하이브리드 접근 방식과 간소화된 JavaScript 구성 시스템을 지원합니다. 또한, 플러그인을 통해 상세한 규칙을 제공하고 다른 도구들과의 통합을 지원할 계획입니다. (영어)</p>\n\n<h2>jax-js: 웹을 위한 ML 라이브러리</h2>\n<p>Google DeepMind의 JAX 프레임워크를 JavaScript로 재구현한 jax-js를 소개합니다. 이 라이브러리는 WebGPU와 Wasm을 통해 브라우저에서 실행될 수 있습니다. (영어)</p>\n\n<h1>그 밖의 개발 관련 최신 소식</h1>\n\n<h2>GPT-5.2-Codex 소개</h2>\n<p>OpenAI에서 GPT-5.2 기반의 에이전트형 코딩 모델인 GPT‑5.2-Codex를 공개했습니다. 이 모델은 기존 모델보다 강력한 사이버 보안 역량과 개선된 장기 작업 능력을 갖추고 있습니다. (한국어)</p>\n\n<h2>X, Vercel, Cursor, Discord 등 수백 개 기업 대상 공급망 공격</h2>\n<p>16세 해커 Daniel이 AI 문서 플랫폼 Mintlify의 치명적인 취약점을 발견한 과정을 담은 글입니다. Discord가 개발자 문서 플랫폼으로 Mintlify를 사용하고 있었고, Daniel은 SVG 파일을 통해 XSS 취약점을 발견했습니다. 이 취약점은 Discord뿐 아니라 X, Vercel, Cursor 등 다수의 기업에 영향을 끼쳤습니다.</p>\n\n<h2>LLM을 활용한 서비스 취약점 분석 자동화</h2>\n<p>Toss에서 LLM을 활용하여 취약점 분석을 자동화한 과정을 설명합니다. MCP를 이용한 효율적인 코드 인덱싱과 Semgrep을 통한 경로 수집 및 분석을 통해 높은 정확도를 달성했습니다. 비용 문제 해결을 위해 멀티 에이전트 및 Open Model을 활용하여 95% 이상의 취약점 분석 자동화를 구현했습니다. (한국어)</p>\n\n<h2>ty: 초고속 Python 타입 체커 및 LSP</h2>\n<p>uv, Ruff를 개발한 Astral에서 Rust로 작성된 Python 타입 체커이자 랭귀지 서버인 ty의 베타 버전을 공개했습니다. ty는 Pyrefly, Pyright, mypy에 비해 훨씬 빠른 속도를 제공하며, 변경된 부분만 선택적으로 재실행하고 명확한 오류 메시지를 제공합니다. (영어)</p>\n\n<h2>Android Runtime(ART) 컴파일 시간 18% 단축</h2>\n<p>Android Runtime(ART) 팀은 컴파일 코드나 최대 메모리 사용량에 영향을 주지 않으면서 컴파일 시간을 18% 단축했습니다. 성능 지표 측정을 통해 시간이 오래 걸리는 Global Value Numbering(GVN) 단계를 최적화하고 불필요한 HashSet을 줄이는 등 다양한 최적화를 수행했습니다. (영어)</p>\n\n<h2>n8n에서 CVSS 9.9의 심각한 취약점 발견</h2>\n<p>n8n 워크플로 자동화 프로젝트에서 CVSS 점수 9.9에 해당하는 CVE-2025-68613 취약점이 발견되었습니다. 이 취약점을 통해 공격자는 임의의 코드를 실행할 수 있습니다. (영어)</p>\n\n<h1>인프라 관련 최신 소식</h1>\n\n<h2>Docker, 무료 Docker Hardened Images 공개</h2>\n<p>Docker에서 출시한 Docker Hardened Images(DHI)가 Apache 2.0 라이센스로 공개되었습니다. DHI는 distroless 런타임을 사용하여 공격 표면을 줄이고 SBOM을 제공합니다. Alpine, Debian과 호환되며, 상업용 서비스인 DHI 엔터프라이즈는 핵심 CVE 패치를 7일 이내에 제공합니다.</p>\n\n<h2>로깅의 문제점 지적</h2>\n<p>현재 로깅 방식의 문제점을 지적하는 웹사이트입니다. 로깅이 작성에 최적화되어 있어 문제 발생 시 맥락 파악이 어렵다는 점을 지적하며, 하나의 와이드(wide) 이벤트로 모든 정보를 포함해야 쉽게 쿼리할 수 있다고 설명합니다. 테일 샘플링을 통해 비용 문제도 해결할 수 있다고 합니다. (영어)</p>\n\n<h2>Zero Trust Network Access (ZTNA) 소개</h2>\n<p>경계 보호 VPN 대신 Cloudflare의 Zero Trust Network를 사용하면 요청별, 앱별 접근 제어를 통해 폭발 반경을 줄이고 제어력을 높일 수 있습니다. 이 글에서는 ZTNA의 개념을 간단한 설명과 시각화 자료로 설명합니다. (영어)</p>\n\n<h2>GitHub Actions 가격 정책 변경</h2>\n<p>GitHub은 2026년 1월 1일부터 GitHub-hosted 러너 비용을 최대 39% 인하하고, 3월 1일부터 self-hosted 러너에 분당 $0.002의 플랫폼 요금을 도입한다고 발표했습니다. 하지만 사용자들의 반발로 self-hosted 플랫폼 요금 부과는 연기되었습니다. (영어)</p>\n\n<h2>MongoDB에서 인증되지 않은 메모리 읽기 취약점 발견</h2>\n<p>MongoDB에서 인증되지 않은 사용자가 힙 메모리를 읽을 수 있는 높은 심각도의 취약점 CVE-2025-14847(CVSS 점수: 8.7)이 발견되었습니다. (영어)</p>\n\n<h1>AI 관련 최신 소식</h1>\n\n<h2>State of AI: 100조 개 토큰 연구 결과</h2>\n<p>LLM 통합 API 플랫폼 OpenRouter에서 지난 1년간 100조 개 이상의 토큰을 분석한 연구 결과를 발표했습니다. LLM의 사용자 행태 및 지난 1년간의 변화를 보여줍니다.</p>\n<ul>\n    <li>개방형 모델과 독점 모델이 존재하지만, 중국산 오픈 모델이 꾸준히 일정 부분 사용량을 유지하며 상호보완적으로 30%의 사용량을 차지합니다.</li>\n    <li>DeepSeek가 가장 많이 사용되는 오픈 모델이지만, 새로운 모델 등장으로 점유율이 줄어들고 약 6개의 모델이 점유율을 유지하고 있습니다.</li>\n    <li>새로운 오픈 모델은 등장 후 몇 주 내에 상당한 사용량을 확보합니다.</li>\n    <li>작년에는 작고 빠른 모델과 대규모 모델로 나뉘었던 오픈 모델 시장이 올해는 중형 모델이 자리 잡기 시작했습니다.</li>\n    <li>오픈 모델 사용 목적은 롤플레이(스토리텔링, 캐릭터 롤플레이, 게임 시나리오 등)가 52%로 가장 높고, 프로그래밍이 그다음입니다.</li>\n    <li>올해 추론 모델 사용 비중이 급격히 증가하여 50%를 넘어섰습니다.</li>\n    <li>평균 프롬프트 길이는 약 4배, 완료 토큰 수는 3배 가까이 증가했습니다.</li>\n    <li>시퀀스 길이(작업 복잡도 및 상호작용 깊이)는 3배 이상 증가했습니다.</li>\n    <li>프로그래밍 분야는 꾸준히 성장하여 최근 50%를 넘어섰으며, Anthropic이 60% 이상을 차지하며 지배적인 위치를 유지하고 있습니다.</li>\n    <li>모델별 사용 목적은 Anthropic (프로그래밍 60% 이상), Google (롤플레이 30%, 프로그래밍 20%), xAI (프로그래밍 70% 이상), OpenAI (과학 20%, 프로그래밍 30%) 등으로 나타났습니다.</li>\n    <li>사용자 리텐션 분석 결과, 새로운 모델이 출시되면 기존 모델에서 해결되지 못한 고부가가치 작업을 해결하고 강력한 락인 효과를 보여주는 \"신데렐라 유리 구두 효과\"가 나타납니다.</li>\n    <li>사용량과 비용 분석 결과, 기술 및 과학 분야는 고사용률/고비용, 프로그래밍/롤플레이/과학은 고사용률/중간 비용, 금융/학계/건강/마케팅은 저사용/고비용, 번역/법률 등은 저사용/저비용으로 구분됩니다.</li>\n</ul>\n\n<h2>Gemini 3 Flash 출시</h2>\n<p>Google에서 저렴한 비용과 빠른 속도로 최첨단 AI를 제공하는 Gemini 3 Flash를 공개했습니다. Gemini 3 Flash는 2.5 Pro보다 성능이 뛰어나면서도 비용이 훨씬 저렴합니다. (영어)</p>\n\n<h2>ChatGPT Images 새 버전 출시</h2>\n<p>OpenAI에서 이미지 생성 모델 ChatGPT Images의 새 버전을 출시했습니다. (한국어)</p>\n\n<h2>Mistral OCR 3 출시</h2>\n<p>다양한 문서에서 텍스트와 이미지를 추출하고 마크다운 출력을 개선한 Mistral OCR 3가 출시되었습니다. 1,000 페이지당 2달러로 저렴하며, 필기체, 양식 등 복잡한 문서도 잘 처리합니다. (영어)</p>\n\n<h2>Qwen-Image-Layered: 이미지 편집 용이성 향상</h2>\n<p>Alibaba에서 이미지를 여러 RGBA 레이어로 분리하여 개별 편집 후 다시 합칠 수 있는 Qwen-Image-Layered 모델을 공개했습니다. 이를 통해 더욱 다채로운 이미지 편집이 가능합니다. (영어)</p>\n\n<h2>GitHub Copilot, Agent Skills 지원</h2>\n<p>GitHub Copilot이 특정 작업을 수행하는 방법을 알려주는 Agent Skills를 지원합니다. (영어)</p>\n\n<h2>OpenAI Codex, Agent Skills 공식 지원</h2>\n<p>OpenAI Codex가 Agent Skills 표준을 따르는 Skills를 공식 지원합니다. (영어)</p>\n\n<h2>Gemma Scope 2: LLM 행동 평가 도구</h2>\n<p>LLM의 내부 작동 원리를 이해하기 위한 Gemma Scope의 새로운 버전인 Gemma Scope 2가 출시되었습니다. 270M부터 27B의 Gemma 3 모델을 해석하고 잠재적 위험을 추적할 수 있는 툴킷입니다. (영어)</p>\n\n<h2>Bloom: 자동화된 행동 평가 오픈소스 도구</h2>\n<p>Anthropic에서 AI 모델의 행동 평가를 자동으로 수행하는 에이전트 프레임워크 Bloom을 오픈소스로 공개했습니다. 지정된 행동에 대해 시나리오를 생성하고 발생 빈도 및 심각도를 평가합니다. (영어)</p>\n\n<h1>볼만한 링크</h1>\n\n<h2>프로그래머로서의 뒤처짐</h2>\n<p>OpenAI 창립 멤버이자 Tesla AI 디렉터를 역임한 Andrej Karpathy가 프로그래머로서 뒤처짐을 느낀다는 트윗을 올렸습니다. AI 시대에 프로그래머의 역할이 재구성되고 있으며, 지난 1년간 얻은 것을 잘 활용하면 10배 강력해질 수 있지만 이를 제대로 활용하지 못하는 것이 실력 문제라고 언급했습니다. (영어)</p>\n\n<h2>A Year Of Vibes</h2>\n<p>Armin Ronacher가 바이브 코딩을 하며 보낸 한 해를 회고하는 글입니다. 코딩 Agent와 TUI가 강력해졌지만, 이들과의 관계 정의에 대한 고민이 많다고 합니다. AI 발전으로 기존 코드 공유 도구의 한계를 느끼며, AI와의 협업 문제를 제대로 해결하지 못하고 있다고 지적합니다. (영어)</p>\n\n<h2>Making Google Sans Flex</h2>\n<p>Google에서 다양한 기기와 크기에 최적화된 폰트인 Google Sans Flex를 개발했으며, 이를 오픈소스로 공개하기로 했습니다. Google Sans Flex는 가변 폰트 기술을 도입하여 유연성을 높였습니다. (영어)</p>\n\n<h2>Spotify 백업 공개</h2>\n<p>Anna's Archive에서 Spotify의 메타데이터와 약 300TB 분량의 음악 파일 아카이브를 공개했습니다. 이 아카이브는 8,600만 개의 음악 파일을 포함하고 있으며, Spotify를 대규모로 스크래핑하여 제작되었습니다. (영어)</p>\n\n<h1>IT 업계 뉴스</h1>\n\n<h2>Graphite, Cursor에 인수</h2>\n<p>Stacked PR 기반 코드 리뷰 플랫폼 Graphite가 AI 코드 에디터 Cursor에 인수되었습니다. (영어)</p>\n\n<h2>Coursera, Udemy와 합병</h2>\n<p>온라인 강의 플랫폼 Coursera가 Udemy와 주식 거래를 통해 약 25억 달러 규모로 합병한다고 발표했습니다. (영어)</p>\n\n<h2>PayPal, 은행 설립 신청</h2>\n<p>PayPal이 소규모 사업체에 대출 및 예금 계좌를 제공할 수 있는 은행 설립을 신청했습니다. (영어)</p>\n\n<h2>Mozilla, 새 CEO 임명</h2>\n<p>Mozilla Corporation이 Anthony Enzor-DeMeo를 새 CEO로 임명했습니다. 그는 AI 시대에 신뢰받는 AI 브라우저를 만들고 검색 외 수익을 다각화하겠다고 밝혔습니다. (영어)</p>\n\n<h2>Meta, AI 에이전트 Manus 인수</h2>\n<p>Meta가 AI 에이전트 개발사 Manus를 인수하기로 했습니다. (영어)</p>\n\n<h1>프로젝트</h1>\n\n<ul>\n    <li>Claude Code in Action: Anthropic 제공 Clade Code 온라인 강의</li>\n    <li>google/mcp: Google 공식 MCP 저장소</li>\n    <li>A2UI: Agent-to-User Interface - AI 에이전트 UI 생성 오픈소스 프로젝트</li>\n    <li>Vertana: TypeScript용 LLM 기반 에이전트 번역 라이브러리</li>\n    <li>CodexBar: macOS 메뉴바 - Codex, Claude Code, Cursor, Gemini, Copiot 사용량 및 리밋 표시</li>\n    <li>RepoBar: macOS 메뉴바 - GitHub 저장소 상태 표시</li>\n    <li>witr (why-is-this-running): 프로세스, 서비스, 포트 실행 이유 표시 CLI</li>\n    <li>Just Fucking Use Effect: TypeScript effect 홍보 사이트</li>\n</ul>\n\n<h1>버전 업데이트</h1>\n\n<ul>\n    <li>Ruby v4.0.0: Ruby Box 실험 기능 지원, ZJIT 지원</li>\n    <li>Kubernetes v1.35 Timbernetes: Pod 리소스 In-place 업데이트 안정화, Pod certificates 베타</li>\n    <li>Next.js 16.1</li>\n    <li>Nx v22.3.0: Angular 21 지원, esbuild 기본 번들러, Vitest 기본 테스트 러너</li>\n    <li>Spring Shell 4.0.0</li>\n    <li>AXe v1.2.0</li>\n    <li>Prisma v7.2.0</li>\n    <li>Kotlin v2.3.0</li>\n    <li>fish shell v4.3.0</li>\n    <li>Color.js v0.6.0</li>\n    <li>Lua 5.5.0</li>\n    <li>OpenSearch 3.4</li>\n    <li>Rspack v1.7.0</li>\n    <li>Qwen Code v0.6.0</li>\n    <li>Turborepo v2.7.0</li>\n</ul>\n</body>","createdAt":"2026-01-01T13:59:11.000+00:00","link":"https://blog.outsider.ne.kr/1783","language":"ko"}