{"title":"기술 뉴스 #277 : 25-09-16","content":"<body>\n<ul>\n<li>Migrating to React Native's New Architecture: Shopify는 React Native의 새 아키텍처로 마이그레이션하면서 개발 속도를 유지하고 기능 개발을 중단하지 않았습니다. 최소한의 코드 변경으로 마이그레이션을 신속하게 진행했으며, 이전 및 새 아키텍처를 동시에 지원하여 성능과 안정성을 유지했습니다.</li>\n<li>Trusted publishing for npm packages: OIDC 인증을 통해 CI/CD에서 수명이 짧은 토큰으로 npm 패키지를 게시할 수 있게 되었습니다.</li>\n<li>An Interactive Guide to TanStack DB: TanStack DB 클라이언트 스토어를 이해하기 위한 인터랙티브 가이드로, ToDo 앱 예시를 통해 TanStack Query에서 TanStack DB로 개선하는 과정을 보여줍니다.</li>\n<li>Reshaped is now open-source: 디자인 시스템을 위한 React 및 Figma 컴포넌트인 Reshaped가 오픈소스로 공개되었습니다.</li>\n<li>Lexxy: A new rich text editor for Rails: 37signals에서 Meta의 Lexical 프레임워크 기반으로 Rails를 위한 새로운 웹 텍스트 편집기 Lexxy의 베타 버전을 공개했습니다.</li>\n<li>Spec-driven development with AI: 코딩 에이전트 활용을 위한 Spec Kit 오픈소스 툴킷이 GitHub에 공개되어, 명세서 주도 개발을 지원합니다.</li>\n<li>CLI 검증 코드 작성을 그만두세요. 처음부터 올바르게 파싱하세요.: CLI 인자 및 플래그 검증을 위한 Optique 라이브러리가 소개되었습니다.</li>\n<li>초보를 위한 Claude Code 안내서: AI 코딩을 활용하며 아키텍처와 코드 리뷰에 집중하기 위한 Claude Code 설정 및 사용 방법을 안내합니다.</li>\n<li>Jujutsu for everyone: Git과 호환되면서도 배우기 쉬운 버전 제어 시스템 Jujutsu의 튜토리얼로, Git 경험이 없어도 학습 가능합니다.</li>\n<li>Introducing Next-Generation Flamegraph Visualization for Node.js: Platformatic에서 Node.js CPU 프로파일링 및 프레임 그래프 시각화를 위한 새 툴킷 @platformatic/flame를 공개했습니다.</li>\n<li>S1ngularity - What Happened, How We Responded, What We Learned: Nx 패키지에 악성 코드가 포함된 사건의 포스트모템으로, GitHub Actions 취약점 이용 사례를 다룹니다.</li>\n<li>npm debug and chalk packages compromised: debug, chalk 등 다수의 인기 npm 패키지가 악성 코드로 감염되어 게시된 사건을 다룹니다.</li>\n<li>Supercharge your Git workflows: GitLab에서 Git 클론 속도를 최적화하는 Git Much Faster 스크립트를 공개했습니다.</li>\n<li>언어 모델이 환각을 일으키는 이유: OpenAI에서 언어 모델의 환각 현상 발생 원인과 평가 시스템 개선 방안을 논문으로 발표했습니다.</li>\n<li>AI Mode is now available in five new languages around the world.: Google의 AI 검색 환경인 AI 모드가 한국어 등 5개 언어로 확대되었습니다.</li>\n<li>Experimenting with local LLMs on macOS: macOS에서 Llama.cpp 또는 LM Studio를 사용하여 로컬 LLM을 실행하는 방법을 설명합니다.</li>\n<li>Qwen3-Next: Towards Ultimate Training & Inference Efficiency: Alibaba Cloud에서 긴 콘텍스트 및 대규모 매개변수 처리를 위한 Qwen3-Next 모델 아키텍처를 설계했습니다.</li>\n<li>Should we revisit Extreme Programming in the age of AI?: AI 시대에 Extreme Programming(XP)의 가치를 재조명하며, 인간 협업의 중요성을 강조합니다.</li>\n<li>스타트업 마무리 가이드북: 사업 정리 과정에서 발생할 수 있는 실수와 비용을 줄이기 위한 안내서입니다.</li>\n<li>996: Armin Ronacher가 중국의 996 근무 시간제를 비판하며, 개인의 선택과 강요된 노동에 대한 차이를 지적합니다.</li>\n<li>State of the software engineering job market in 2025: 2025년 소프트웨어 엔지니어 취업 시장 분석으로, 채용 증가와 AI 엔지니어 수요 증가를 전망합니다.</li>\n<li>Python: The Documentary | An origin story: Python 다큐멘터리가 공개되었습니다.</li>\n<li>In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties: Google의 독점금지 판결에서 Chrome 매각은 면했지만, 기본 검색 엔진 독점 거래는 금지되었습니다.</li>\n<li>Welcoming The Browser Company to Atlassian: Atlassian이 Arc 및 Dia 브라우저 제작사 The Browser Company of New York을 인수했습니다.</li>\n<li>OpenAI acquires product testing startup Statsig and shakes up its leadership team: OpenAI가 제품 테스팅 스타트업 Statsig를 인수하고 Vijaye Raji를 애플리케이션 CTO로 영입했습니다.</li>\n<li>법원, 위메프 회생절차 폐지…파산 절차: 위메프의 회생절차 폐지 및 파산 절차 개시 결정이 내려졌습니다.</li>\n<li>Anthropic raises $13B Series F at $183B post-money valuation: Claude 개발사 Anthropic이 130억 달러 규모의 투자를 유치하며 기업 가치 1,830억 달러를 달성했습니다.</li>\n<li>KT, 해킹 파장 커질까...개인정보 유출 가능성 '촉각': KT 해킹 및 무단 소액결제 사태로 개인 정보 유출 가능성에 대한 우려가 커지고 있습니다.</li>\n<li>Opsmate: LLM 기반 SRE 코파일럿으로 프로덕션 문제 해결을 지원합니다.</li>\n<li>OPA Control Plane: OPA(Open Policy Agent) 배포의 정책 관리를 간소화하는 컨트롤 플레인입니다.</li>\n<li>werf: Kubernetes CI/CD 구현을 위한 CNCF 샌드박스 CLI 도구입니다.</li>\n<li>Alchemy: Infrastructure as TypeScript를 구현합니다.</li>\n<li>Unicode v17.0.0: 4,803개의 문자가 추가되어 총 159,801개의 문자가 인코딩되었습니다.</li>\n<li>Expo SDK 54: React Native 및 의존성 지원을 위한 사전 컴파일된 XCFrameworks를 도입하여 빌드 시간을 단축했습니다.</li>\n<li>Electron v38.0.0: 크로스 플랫폼 데스크톱 애플리케이션 플랫폼</li>\n<li>Zed v0.203.5: 코드 에디터</li>\n<li>Node.js v24.8.0 (Current): 자바스크립트 런타임</li>\n<li>LogTape v1.1.0: JavaScript 로깅 라이브러리</li>\n<li>ESLint v9.35.0: JavaScript 코드 분석 도구</li>\n<li>Regal v0.36.1: Rego 언어 린터, 디버거, 랭귀지 서버</li>\n<li>Deno v2.5: TypeScript 런타임</li>\n<li>Nuxt.js v4.1.0: 서버 렌더링 Vue.js 애플리케이션 프레임워크</li>\n<li>Prisma v6.16.0: TypeScript/Node.js 데이터베이스 툴킷</li>\n<li>Optique v0.4.0: TypeScript용 타입세이프 CLI 파서</li>\n<li>pnpm v10.16.0: Node.js 패키지 매니저</li>\n<li>pgAdmin 4 v9.8: PostgreSQL 클라이언트 도구</li>\n<li>ClickHouse v25.8: 컬럼형 데이터베이스</li>\n<li>GitButler v0.16: Git 클라이언트</li>\n<li>Spring Tools v4.32.0: Spring 코딩 환경 도구</li>\n<li>Spring gRPC v0.11.0: Spring의 gRPC 라이브러리</li>\n</ul>\n</body>","createdAt":"2025-09-15T17:35:00.000+00:00","link":"https://blog.outsider.ne.kr/1772","language":"ko"}