{"title":"기술 뉴스 #277 : 25-09-01","content":"<body>\n    <ul>\n        <li><b>The State of Python 2025:</b> Python Software Foundation and JetBrains' survey of 30,000 developers shows a shift towards async and Rust-based web servers, with FastAPI usage increasing to 38%.</li>\n        <li><b>Supply Chain Security Alert:</b> The Nx build system package was compromised with malware stealing SSH keys and npm tokens, exploiting AI CLI tools and leading to unauthorized public exposure of private repositories. Organizations should verify their exposure.</li>\n        <li><b>Apple Xcode Integration with Claude:</b> Apple is preparing to integrate Claude Sonnet 4.0 and Claude Opus 4 into Xcode, alongside ChatGPT.</li>\n        <li><b>Action Push Native Open-Sourced:</b> 37Signals has released Action Push Native as an open-source project for sending push notifications to mobile platforms.</li>\n        <li><b>MoQ for Real-Time Media:</b> Media over QUIC (MoQ) aims to simplify and improve the efficiency of real-time media communication on the web, offering sub-millisecond latency at broadcast scale over QUIC.</li>\n        <li><b>Gemini 2.5 Flash Image Released:</b> Google has launched Gemini 2.5 Flash Image, an image generation and editing model known as \"nano-banana.\"</li>\n        <li><b>Grok 2.5 Model Now Open Source:</b> xAI's Grok 2.5 model has been released as open source.</li>\n        <li><b>DeepSeek-V3.1 Release:</b> This release introduces a hybrid inference model capable of \"Think\" and \"Non-Think\" modes for faster responses, marking a step towards the agent era.</li>\n        <li><b>Google Releases AI Prompt Energy Usage Data:</b> Google has shared data indicating a median AI prompt uses 0.24 Wh of electricity, with Gemini queries' energy consumption decreasing 33-fold year-over-year.</li>\n        <li><b>AGENTS.md Proposal:</b> A proposal for AGENTS.md suggests a file to provide context and instructions for AI agents.</li>\n        <li><b>HR Company Flex Accused of Stock Option Mismanagement:</b> Flex is reportedly not compensating some former employees for stock options by valuing them at 0 KRW per share upon departure.</li>\n        <li><b>Sequoia Backs Zed's Collaborative Coding Vision:</b> Sequoia Capital has invested $32 million in Zed's Series B funding round to support its collaborative coding platform.</li>\n        <li><b>New Projects:</b></li>\n        <ul>\n            <li><b>Agent Client Protocol (ACP):</b> A communication protocol between code editors and coding agents, announced by Zed.</li>\n            <li><b>VibeVoice:</b> A Microsoft-released open-source text-to-speech model designed for generating long-form, multi-speaker conversational audio.</li>\n            <li><b>Regal:</b> A linter, debugger, and language server for the Rego language.</li>\n            <li><b>Debugging Teams (Korean Translation):</b> The Korean version of the book on collaboration.</li>\n            <li><b>Kubero:</b> A Heroku alternative for Kubernetes.</li>\n            <li><b>kubectrl-ai:</b> An AI assistant for Kubernetes.</li>\n            <li><b>Epicenter Whispering:</b> An open-source speech-to-text application.</li>\n            <li><b>Branchless workflow for Git:</b> A tool to simplify Git usage with commands like undo and restack.</li>\n            <li><b>GitHub Agentic Workflows:</b> Enables continuous AI workflows on GitHub Actions using natural language.</li>\n        </ul>\n        <li><b>Version Updates:</b></li>\n        <ul>\n            <li><b>FFmpeg 8.0 \"Huffman\":</b> Release announcement for the audio/video conversion framework.</li>\n            <li><b>Kubernetes v1.34 Of Wind & Will(O'WaW):</b> Release announcement for the container orchestration tool, including Dynamic Resource Allocation (DRA) reaching GA and KYAML support.</li>\n            <li><b>Node.js v22.19.0 (LTS) & v24.7.0 (Current):</b> Release announcements for the JavaScript runtime.</li>\n            <li><b>Mikro ORM v6.5.0:</b> Release announcement for the TypeScript ORM.</li>\n            <li><b>ESLint v9.34.0:</b> Release announcement for the JavaScript code analysis tool.</li>\n            <li><b>Omarchy v2.0.0:</b> Release announcement for DHH's Hyprland configuration for Arch Linux.</li>\n            <li><b>Rspack v1.5.0:</b> Release announcement for the web bundler.</li>\n            <li><b>Angular v20.2.0:</b> Release announcement for the JavaScript framework.</li>\n            <li><b>Nx v21.4.0:</b> Changes for the monorepo build system.</li>\n            <li><b>panda v1.1.0:</b> Release announcement for CSS-in-JS.</li>\n            <li><b>Rook v1.18:</b> Release announcement for cloud-native storage for Kubernetes.</li>\n            <li><b>Zed v0.201.8:</b> Release announcement for the code editor.</li>\n            <li><b>Git v2.51.0:</b> Changes for the distributed version control tool.</li>\n            <li><b>Dragonfly v2.3.0:</b> Release announcement for the P2P file distribution and image acceleration system.</li>\n            <li><b>Kyverno v1.15:</b> Release announcement for the Kubernetes policy engine.</li>\n            <li><b>TensorFlow v2.20.0:</b> Release announcement for the machine learning and deep learning library.</li>\n        </ul>\n    </ul>\n</body>","createdAt":"2025-08-31T16:21:33.000+00:00","link":"https://blog.outsider.ne.kr/1770","language":"en"}