{"content":"<body>\n    <p>쿠키런 킹덤의 4년차 클라이언트 프로그래머 박지선은 취업 준비생들에게 클라이언트 프로그래머의 실제 업무를 소개하고자 이 글을 작성했습니다. 단순한 게임 구현을 넘어, 다양한 직군과의 협업, 툴 개발, 리소스 관리 등 게임 개발 전반에 걸쳐 클라이언트 프로그래머가 수행하는 역할의 폭이 넓음을 강조합니다.</p>\n    <h2>게임 회사의 조직 구조와 직무 소개</h2>\n    <ul>\n        <li>PD (Project Director): 프로젝트 전체의 방향성과 퀄리티 총괄</li>\n        <li>PM (Project Manager): 프로젝트 개발 관리, 출시, 운영 및 외부 조직 커뮤니케이션 담당</li>\n        <li>서버 프로그래머: 게임 백엔드 구축, 유저 데이터 관리, 서버-클라이언트 통신 담당</li>\n        <li>클라이언트 프로그래머: 게임 구조 설계, 리소스 및 데이터 연결, 게임 구현</li>\n        <li>스토리: 게임 전반의 스토리, 캐릭터 서사 구성</li>\n        <li>아트: 컨셉 및 캐릭터 디자인, 게임 리소스 제작</li>\n        <li>UIUX: 인터페이스 및 유저 경험 설계, 프리팹 제작</li>\n        <li>이펙트: 전투 연출, UI 효과 등 시각적 효과 제작</li>\n        <li>모션: 캐릭터 및 오브젝트 모션 적용</li>\n        <li>기획: 게임 시스템, 콘텐츠, 밸런스 설계</li>\n        <li>QA (Quality Assurance): 기능 테스트, 유저 경험 피드백 제공</li>\n    </ul>\n    <h2>업데이트와 업무 루틴 (점핑 플랫폼 미니게임 예시)</h2>\n    <ol>\n        <li><strong>콘텐츠 결정:</strong> PD, 스토리, 아트팀이 1년 단위 업데이트 플랜에 맞춰 콘텐츠 결정</li>\n        <li><strong>상위 방향성 & 상세 기획 회의:</strong> PD, 기획팀 주도로 콘텐츠 경험 방향성 및 구성 논의 (클라이언트 프로그래머는 구현 가능성 확인)</li>\n        <li><strong>킥오프 회의:</strong> 기획팀 주도로 실무진(프로그래머, 아트, UIUX, 이펙트, 모션 등) 참석하여 구체적 스펙 체크 및 일정 조율. 클라이언트 프로그래머는 설계 참여 및 리소스 제작 방향 제시.</li>\n        <li><strong>데이터 구조 회의:</strong> 게임 데이터(엑셀) 입력 방식 논의</li>\n        <li><strong>툴 개발:</strong> 개발 효율 및 안정성 향상을 위한 툴(예: 맵 툴) 제작. 반복 작업 자동화, 실수 방지, 협업 효율 향상, 밸런싱 용이성 증대.</li>\n        <li><strong>작업 시작:</strong>\n            <ul>\n                <li><strong>데이터 & 서버 작업:</strong> 기획팀 가데이터 작업 후 서버 작업 진행, 클라이언트 프로그래머는 서버 확인</li>\n                <li><strong>리소스 작업:</strong> 아트팀 리소스 제작 → UIUX팀 UI/UX 설계 및 프리팹 조립 → 이펙트팀 이펙트 추가 → 모션팀 모션 적용. 중간중간 기획 의도대로 제작되는지 확인.</li>\n                <li><strong>클라이언트 작업:</strong> 모든 직군 작업 완료 후, 리소스, 서버, 데이터를 통합하여 게임 구현. (클라이언트 프로그래머 간 소통 중요)</li>\n            </ul>\n        </li>\n        <li><strong>리소스 관리:</strong> Unity AssetBundle을 활용하여 앱 용량 최적화. 빌드 리소스와 번들 리소스 참조 관계 관리 및 툴 제작.</li>\n        <li><strong>피드백 회의:</strong> PD 참여하에 구현 내용 피드백 및 수정 기간 거친 후 QA 시작.</li>\n        <li><strong>QA & 빌드 제출:</strong> QA팀의 기획서 리뷰(인스펙션), TC 작성, 유니티 에디터 및 실제 기기 테스트 진행. 클라이언트 프로그래머는 피드백 반영 및 이슈 수정 후 빌드 제출.</li>\n        <li><strong>사후 관리:</strong>\n            <ul>\n                <li><strong>라이브 이슈 수정:</strong> 업데이트 후 모니터링 및 이슈 발생 시 원인 파악 후 패치 또는 빌드 재진행.</li>\n                <li><strong>메모리 관리:</strong> 저사양 기기 유저를 위한 메모리 사용량 최적화 및 리소스 관리. (예: 로딩 화면 시 메모리 정리)</li>\n                <li><strong>리팩토링:</strong> 기술 부채 방지를 위한 코드 개선. (협의, QA, PM 공유 및 테스트 코드 작성 필수)</li>\n            </ul>\n        </li>\n    </ol>\n    <h2>클라이언트 프로그래머가 되고 싶은 사람에게 하고 싶은 이야기</h2>\n    <h3>신입으로서 알아두면 좋은 기술</h3>\n    <ul>\n        <li>자료구조와 알고리즘</li>\n        <li>디자인 패턴 (Factory, Singleton, State, Observer 등)</li>\n        <li>Git (버전 관리, 브랜치, 충돌 해결)</li>\n        <li>Unity Profiler / Memory Profiler (GC 스파이크, 메모리 누수 해결)</li>\n        <li>UniTask 라이브러리 (비동기 처리)</li>\n        <li>DOTween 라이브러리 (UI 애니메이션, 연출)</li>\n        <li>직접 게임 출시 또는 툴 개발 경험</li>\n    </ul>\n    <h3>실무에서 중요하게 여기는 태도</h3>\n    <ul>\n        <li>게임에 대한 애정과 몰입</li>\n        <li>끊임없이 배우려는 자세와 피드백 수용 능력</li>\n        <li>끈기와 탐구심 (문제 해결 능력)</li>\n        <li>협업 중심 사고 (타 직군 이해 노력)</li>\n    </ul>\n    <p>클라이언트 프로그래머는 게임을 살아 움직이게 만드는 사람이며, 기술뿐 아니라 소통, 문제 해결, 꾸준한 배움이 중요함을 강조하며, 게임을 좋아하고 배우려는 마음이 있다면 누구나 이 일을 해낼 수 있다고 격려합니다.</p>\n</body>\n</html>","createdAt":"2025-08-12T17:33:15.260Z","language":"ko"}