{"title":"20년 레거시를 넘어 미래를 준비하는 시스템 만들기","content":"<body>\n<p>토스페이먼츠는 온라인 결제 과정에서 고객과 가맹점을 잇는 보이지 않는 결제 백본 역할을 수행합니다. 2020년 8월, 결제 산업 혁신을 목표로 출범했으며, 기존 PG 사업을 인수하여 20년 이상의 레거시 시스템을 현대화하는 과정을 거쳤습니다.</p>\n\n<h2>토스페이먼츠의 제품 혁신</h2>\n<ul>\n  <li><strong>개발자 경험 혁신:</strong> RESTful API와 상세한 개발자 문서를 제공하여 결제 연동을 간소화했으며, 샌드박스를 통해 미리 결제 제품을 체험할 수 있도록 했습니다.</li>\n  <li><strong>AI 연동 도구 제공:</strong> MCP 서버를 공개하여 AI 코딩 도구가 토스페이먼츠 API를 더 잘 이해하고 개발자를 지원하도록 했습니다. (<a href=\"https://toss.tech/article/tosspayments-mcp\">관련 아티클</a>)</li>\n  <li><strong>비즈니스 혁신 (브랜드페이):</strong> 가맹점이 자체 간편결제 서비스를 단 몇 개의 API 연동으로 구축할 수 있도록 지원합니다.</li>\n  <li><strong>노코드 혁신 (결제위젯):</strong> 개발자 없이도 원하는 대로 결제 UI를 꾸밀 수 있는 기능을 제공합니다.</li>\n  <li><strong>수수료 혁신 (퀵계좌이체):</strong> 카드 결제 수수료 부담을 줄이고 빠르고 간편한 결제 경험을 제공합니다.</li>\n</ul>\n\n<h2>토스페이먼츠의 시스템 개선 여정 (9단계)</h2>\n<ol>\n  <li><strong>GitHub Enterprise 도입:</strong> 개인 PC에만 존재하던 소스코드를 GitHub으로 통합 관리하여 GitOps 환경을 구축하고 코드 리뷰 문화를 시작했습니다.</li>\n  <li><strong>빌드 표준화:</strong> Gradle 기반 통합 빌드 시스템과 Docker 기반 일관된 빌드 환경을 구축하여 어느 환경에서든 동일한 빌드 결과를 보장했습니다.</li>\n  <li><strong>MSA 전환 및 Kubernetes 도입:</strong> 150개 이상의 MSA 서비스 운영을 위해 Kubernetes를 도입하여 표준화되고 자동화된 방식으로 서비스를 관리했습니다.</li>\n  <li><strong>고가용성 인프라:</strong> 4개의 Kubernetes 클러스터를 AWS 4개 가용 영역과 IDC의 분산 배치하여 서비스 연속성을 확보했습니다.</li>\n  <li><strong>자동화된 코드 업데이트:</strong> 공통 라이브러리에 자동 코드 주입 방식을 적용하고, 문제가 되는 코드 패턴 발견 시 자동으로 코드를 수정하는 시스템을 개발하여 빠른 배포와 라이브러리 업데이트를 지원합니다.</li>\n  <li><strong>성능 및 안정성 강화:</strong>\n    <ul>\n      <li><strong>안정성:</strong> 인프라 레벨부터 애플리케이션까지 전 계층에서 1% 단위 트래픽 조절이 가능한 canary 배포를 지원합니다.</li>\n      <li><strong>성능:</strong> HTTP/3, TLS 1.3 적용, 다계층 캐시 아키텍처, 카드사 전문 통신을 위한 비동기 멀티플렉싱 서버 개발로 성능을 최적화했습니다.</li>\n    </ul>\n  </li>\n  <li><strong>대규모 데이터 조회 기술:</strong> 수십억 건의 거래 데이터를 SQL 문법으로 sub-second 수준의 지연으로 조회 가능하도록 하여, 기존 1분 이상 걸리던 쿼리를 1초 이내로 단축하고 조회 기간 제약을 5년으로 확대했습니다.</li>\n  <li><strong>보안 강화:</strong> 경계, 내부망, 업무망, 런타임, 컨테이너 런타임 보안까지 강화하고 AI를 활용한 보안 이벤트 분석으로 대응 체계를 고도화했습니다. ISO 27001, 27701, PCI-DSS, ISMS 등 보안 인증을 획득했습니다.</li>\n  <li><strong>애플리케이션 대개편:</strong> 2000년대 초반 스타일의 레거시 시스템을 React, Kotlin, Spring Boot 3.x 등을 활용한 현대적 아키텍처로 완전히 재개발했습니다. 수만 개 가맹점과의 호환성을 유지하며 테스트 자동화 시스템을 통해 안정적인 배포를 진행했습니다.</li>\n</ol>\n\n<h2>개편 후 현재의 토스페이먼츠</h2>\n<p>토스페이먼츠는 Public Cloud와 Private Cloud가 혼합된 Hybrid Cloud 환경에서 물리적 인프라 구성을 추상화하고, 1% 단위 점진적 배포가 가능한 CI/CD 플랫폼을 운영 중입니다. DevOps 및 Platform Engineering 역량을 바탕으로 개발·운영 프로세스의 효율성과 안정성을 극대화하고 있습니다. Zero Trust Network Architecture(ZTNA) 적용, 컨테이너 런타임 보안 강화, AI 기반 보안 이벤트 분석으로 최신 기술 아키텍처에 맞춰 대응력을 높였습니다. 또한, 수십억 건의 데이터를 sub-second 수준으로 서빙하는 기술 기반으로 폭증하는 거래량과 데이터를 실시간으로 처리·시각화하는 고성능 대시보드 서비스를 제공합니다.</p>\n<p>토스페이먼츠는 20년 레거시 시스템에 대한 존중을 바탕으로 혁신을 멈추지 않으며, 사업자의 유일무이한 기술 파트너가 되기 위한 노력을 지속하고 있습니다. 20년 레거시를 개편한 엔지니어링 고수들과 함께 다음 10년을 만들어갈 인재를 기다립니다.</p>\n</body>","createdAt":"2025-10-16T01:57:00.000+00:00","link":"https://toss.tech/article/payments-legacy-1","language":"ko"}