{"title":"25 new CSS features explained","content":"<body>\n  <p><strong>Frontend Focus</strong></p>\n  <p><strong>#714 — 2025년 10월 22일</strong></p>\n\n  <h2>주요 내용</h2>\n\n  <ul>\n    <li>\n      <p><strong>25분 만에 배우는 25가지 멋진 CSS 기능</strong>: Adam Argyle의 발표 영상과 슬라이드덱(코드 샘플 포함)을 통해 최신 CSS 기능(필드 크기 조정, 사용자 정의 스크롤바 스타일링, 수학 함수, 스크롤 기반 애니메이션 등)을 살펴봅니다. Cascadia JS 컨퍼런스의 다른 발표도 <a href=\"https://cascadiajs.com/2025/schedule/\">여기</a>서 볼 수 있습니다.</p>\n    </li>\n    <li>\n      <p><strong>OpenAI의 AI 기반 브라우저, ChatGPT Atlas 출시</strong>: macOS에서 먼저 사용 가능하며, OpenAI의 채팅/에이전트/웹 브라우저 하이브리드 경험을 제공하는 Chromium 기반 브라우저입니다. Windows 및 iOS/Android 지원 예정입니다.</p>\n    </li>\n    <li>\n      <p><strong>API 키 없이 안전하게 MCP 인증 출시</strong>: WorkOS Connect는 PKCE, 범위, 사용자 동의 및 보안 토큰 발급을 지원하는 완전 준수 OAuth 2.1 흐름을 제공합니다.</p>\n    </li>\n    <li>\n      <p><strong>Masonry: CSS 기능의 진화 과정을 지켜보기</strong>: Saleh Mubashar는 CSS Masonry 기능의 발전 과정과 새로운 CSS 기능 개발에서 얻을 수 있는 교훈에 대해 설명합니다.</p>\n    </li>\n  </ul>\n\n  <h2>간략 정보</h2>\n  <ul>\n    <li>URLPattern과 same-document view transitions가 기본적으로 사용 가능해졌습니다.</li>\n    <li>WordPress는 28,000개 이상의 이미지를 보유한 공개 도메인 스톡 사진 라이브러리가 있습니다.</li>\n    <li>Google은 \"낮은 채택률\"로 인해 여러 개인 정보 보호 샌드박스 기술의 지원을 중단합니다.</li>\n    <li>Safari Technology Preview 230의 릴리스 노트를 확인하세요.</li>\n    <li>점점 획일화되는 웹에서 2025년에 웹사이트를 구축해야 하는 50가지 이유를 Chris Coyier가 제시합니다.</li>\n  </ul>\n\n  <h2>기사, 의견 및 튜토리얼</h2>\n  <ul>\n    <li>\n      <p><strong>컨텍스트 인식 컴포넌트 만들기: CSS inherit()가 디자인 시스템을 간소화하는 방법</strong>: Stuart Robson은 개발 중인 CSS inherit() 기능이 var() 함수와 유사하게 작동하며, 컴포넌트를 자연스럽게 컨텍스트 인식으로 만들 수 있는 가능성을 탐구합니다.</p>\n    </li>\n    <li>\n      <p><strong>두 개의 버튼 문제</strong>: Chris Coyier는 버튼이 활성화되었는지 명확하게 알 수 있지만, 특정 디자인 트렌드로 인해 항상 그런 것은 아니라고 지적하며 UI 구현의 모호성을 해소하고자 합니다.</p>\n    </li>\n    <li>\n      <p><strong>준비된 백엔드로 앱을 더 빠르게 구축하세요</strong>: OneEntry는 프론트엔드 개발자에게 내장된 데이터베이스, 직관적인 관리자 패널 및 유연한 데이터 모델을 갖춘 바로 사용할 수 있는 클라우드 백엔드를 제공합니다.</p>\n    </li>\n    <li>\n      <p><strong>@starting-style의 큰 함정</strong>: Josh W. Comeau는 CSS 전환을 Enter 애니메이션에 사용할 수 있게 해주는 이 새로운 도구를 살펴보고, 유용성이 즉시 명확하지 않다고 결론짓습니다.</p>\n    </li>\n    <li>\n      <p><strong>2년간 내 사이트에서 Signed Exchanges를 사용한 후의 결론</strong>: Paweł Pokrywka는 Chrome 전용 웹 전달 메커니즘인 Signed Exchanges(SXG)에 대한 요약을 제공하며, 이 기술이 장기적으로 생존하기 어렵다고 언급합니다.</p>\n    </li>\n    <li>\n      <p><strong>ARIA의 상태는 무엇인가?</strong>: Aditya Jainapur는 aria-selected 및 aria-current와 같은 '상태' 또는 '선택' 속성을 설명하고, 이들의 기능, 사용 시기 및 일반적인 실수를 명확히 합니다.</p>\n    </li>\n    <li>\n      <p><strong>2025년 가을 앵커 포지셔닝 업데이트</strong>: James Stuckey Weber가 앵커 포지셔닝의 현재 상태를 개괄합니다.</p>\n    </li>\n    <li>\n      <p><strong>당신의 소매점 랜딩 페이지가 전환율을 해치고 있습니까?</strong>: Tammy Everts는 연중 가장 바쁜 온라인 쇼핑 시즌을 앞두고 고려해야 할 사항들을 제시합니다.</p>\n    </li>\n    <li>\n      <p><strong>웹상의 JavaScript의 신뢰성 향상</strong>: Michael Rosenberg(Cloudflare)가 WAICT(Web Application Integrity, Consistency, and Transparency)라는 W3C 지원 초기 노력을 소개합니다.</p>\n    </li>\n    <li>\n      <p><strong>날아다니는 자동차가 필요할 때 display: grid가 있는 이유</strong>: Rach Smith가 현대 CSS의 즐거움에 대해 이야기합니다.</p>\n    </li>\n    <li>\n      <p><strong>스크린 리더에 대한 일반적인 오해</strong>: Ela Gorla가 설명합니다.</p>\n    </li>\n    <li>\n      <p><strong>모달 vs 다이얼로그 컴포넌트 사용 시기</strong>: A11Y Collective가 설명합니다.</p>\n    </li>\n  </ul>\n\n  <h2>도구, 코드 및 리소스</h2>\n  <ul>\n    <li>\n      <p><strong>Obra Icons: 사용자 인터페이스를 위한 간단하고 일관된 아이콘 세트</strong>: Obra Studio는 SVG, PNG로 다운로드하거나 React/Svelte에서 사용할 수 있는 1000개 이상의 아이콘을 제공합니다. 색상, 두께, 크기를 실시간으로 테스트하고 사용자 정의할 수 있습니다.</p>\n    </li>\n    <li>\n      <p><strong>JointJS로 강력한 SCADA UI 구축</strong>: JOINTJS는 프로덕션 준비가 된 다이어그램 템플릿을 제공하여 산업 대시보드를 더 빠르게 온라인으로 전환할 수 있도록 지원합니다.</p>\n    </li>\n    <li>\n      <p><strong>Web Codegen Scorer: LLM 생성 웹 코드 품질 평가 도구</strong>: Google의 Angular 팀에서 개발한 이 도구는 다양한 모델의 출력을 비교하거나 품질을 모니터링하는 데 유용합니다.</p>\n    </li>\n    <li>\n      <p><strong>JustGage 2.0: 대시보드 스타일 SVG 게이지 그리기 및 애니메이션</strong>: 10년 이상 된 프로젝트의 대규모 릴리스로, 이제 네이티브 SVG API를 사용하여 현대화되었습니다. 플레이그라운드에서 옵션과 게이지 스타일을 조작할 수 있습니다.</p>\n    </li>\n    <li>\n      <p><strong>Format JSON Online: JSON 및 데이터 처리를 위한 종합 툴킷</strong>: JSON 데이터를 거의 모든 방식으로 처리할 수 있는 도구 모음으로, JSON 수정 및 생성 AI 유틸리티, 공유 및 협업 도구도 포함되어 있습니다.</p>\n    </li>\n    <li>\n      <p><strong>Grayscale-Image-to-STL: 모든 흑백 이미지를 3D STL 모델로 변환</strong>: Three.JS를 기반으로 하는 브라우저 기반 도구로, 릴리프, 높이 맵, 3D 프린팅 등에 유용합니다.</p>\n    </li>\n    <li>\n      <p><strong>ColorMate: 디자이너 및 개발자를 위한 무료 색상 도구</strong>: 색상 팔레트 생성, CSS 그라디언트, 이미지에서 색상 추출 도구를 제공합니다.</p>\n    </li>\n  </ul>\n</body>","createdAt":"2025-10-22T00:00:00.000+00:00","link":"https://frontendfoc.us/issues/714","language":"ko"}