{"content":"<p>Block quotes and pull quotes are typographic elements used to punctuate text and catch the eye. There are no strict rules for their length, size, or style, allowing for creative design choices that reflect a brand's visual identity.</p>\n\n<p>The author details their process for designing block and pull quotes, focusing on styling the HTML <code>blockquote</code> element with borders, decorative quote marks, and custom shapes. The example used is a website design for \"Patty Meltt,\" an up-and-coming country music sensation.</p>\n\n<p>The article clarifies the semantic use of HTML elements:\n    <ul>\n        <li><code>blockquote</code>: Used for quoted content.</li>\n        <li><code>footer</code>: Ideal for attributions (reviewer's name).</li>\n        <li><code>cite</code>: Intended for the title of a creative work (e.g., a magazine name), not the author's name.</li>\n    </ul>\n</p>\n\n<p>Browsers typically style <code>blockquote</code> with minimal margins. To create expressive design elements, the author suggests using styling techniques such as:\n    <ul>\n        <li><strong>Borders</strong>: Left or top borders can separate quotes from main text. Borders can be thin and understated or bold and confident. Faux borders using <code>::before</code> and <code>::after</code> pseudo-elements can be used for custom sizing and animations.</li>\n        <li><strong>Quote Marks</strong>: While not strictly necessary for semantics or accessibility (screen readers recognize <code>blockquote</code>), quote marks can add visual emphasis and personality. They can be traditional, oversized opening marks, or custom SVG elements. The author maintains a library of quote marks from different fonts.</li>\n        <li><strong>Shapes</strong>: Quotes can be styled into various shapes like speech or thought bubbles, or transformed using <code>clip-path</code> or masks.</li>\n    </ul>\n</p>\n\n<p>For Patty Meltt's website, the design incorporated a mixture of quote marks, avatar images, and borders, with the quote text styled in a flowing script font (<code>\"Lobster Two\"</code>). An SVG quote mark from the Blazeface type family was used, and flexbox was employed to align content vertically, with a generated horizontal line to fill remaining space.</p>\n\n<p>The conclusion emphasizes that with care and creativity, block quotes can become distinctive, brand-building elements that reinforce a client's personality and voice. The key is to get the semantics right, choose styling that matches the tone, and experiment with different design elements.</p>","createdAt":"2025-08-12T09:43:59.150Z","language":"en"}