{"title":"Design System Culture: What It Is And Why It Matters (Excerpt)","content":"<body>\n<p>이 글은 Maturing Design Systems의 스폰서로 제공되었습니다.</p>\n\n<p>디자인 시스템은 프로젝트의 성공에 필수적인 요소가 되었습니다. 단순히 좋은 토큰, 컴포넌트, 구성만으로는 충분하지 않으며, 지속 가능하고 널리 채택되는 시스템을 만드는 데는 문화와 큐레이션이 가장 중요합니다. 시간을 투자하고 주의를 기울여야 할 부분을 파악하는 것은 어려울 수 있습니다. 팀을 지원하고 업무를 향상시키며 함께 성장하는 디자인 시스템을 어떻게 구축하고 유지할 수 있을까요?</p>\n\n<h2>디자인 시스템 문화</h2>\n<p>문화는 신기한 것입니다. 우리는 문화의 중요성을 본능적으로 느끼지만, 정의하기 어렵고 변화시키기란 마법처럼 느껴질 수 있습니다. 특정 기업 문화가 어떤 사람에게는 영감을 주지만 다른 사람에게는 지루하게 느껴질 수 있고, 성장의 기회가 되기도 하지만 억압적으로 느껴지기도 합니다. 또한, 회사 전체의 문화뿐만 아니라 여러 하위 문화가 존재합니다. 문화는 한 개인이 만드는 것이 아니라, 같은 사람들이 반복적으로 모일 때 형성되기 때문입니다. 회사가 성장하고 계층과 구조가 추가되면서 특정 목표, 제품, 기능, 분야를 중심으로 형성된 팀들은 각자 고유한 하위 문화를 발전시킵니다. 아마 여러분에게도 디자인 하위 문화, 제품 소유권 하위 문화, 심지어는 점심시간에 Zoom 통화를 하며 뜨개질을 하고 수다를 떠는 사람들을 중심으로 형성된 하위 문화도 있을 것입니다. 대부분의 규모 있는 조직에는 이러한 수백 가지 이상의 하위 문화가 존재합니다. 이는 복잡하고 미묘하며 매우 중요합니다.</p>\n\n<p>개인이 자신의 관리 방식에 어려움을 겪을 때, 어떤 문화는 상사에게 솔직한 피드백을 제공하도록 하지만, 다른 문화는 새로운 직장을 찾게 만듭니다. 회사가 금요일마다 무료 점심을 제공할 때, 어떤 문화는 이 혜택에 감사함을 느끼게 하지만, 다른 문화는 이 점심이 영원히 회사를 떠날 수 없다는 기대를 동반한다고 느끼게 만듭니다. 어떤 문화는 존중하는 상호작용보다 재정적 결과를 우선시합니다. 어떤 문화는 팀 간의 경쟁을 장려하는 반면, 다른 문화는 동료와의 협업을 강조합니다.</p>\n\n<h3>왜 문화인가?</h3>\n<p>2021년 초, 필자의 회사는 대규모 조직이 새로운 제품 아이디어의 최소 기능 제품(MVP)과 함께 디자인 시스템을 계획, 설계, 구축하도록 돕는 요청을 받았습니다. 필자의 팀이 가장 좋아하는 일이기에 의욕적으로 뛰어들었습니다. 디자인 시스템에 관한 책의 저자로서, 이 협업이 얼마나 멋지게 진행되었는지 여러분께 말씀드리고 싶지만, 실제로는 엄청난 고난의 연속이었습니다. 종이 위에서는 필자의 팀과 자신에게 완벽한 종류의 일이었음에도 불구하고, 연말에 고객과의 계약을 중단해야 하는 힘든 결정을 내려야 했습니다. 이는 일을 할 수 없어서도, 기술적인 문제나 예산 문제 때문도 아니었습니다. 우리가 제시한 이유는 “문화적 비호환성”이었습니다. 거의 20년 동안 사업을 운영하면서 이런 일은 처음이었습니다. 결국, 고객들은 모든 것을 해결했기 때문에 우리를 찾는 것이 아니라 도움이 필요하다는 것을 알기에 우리를 찾는 것입니다. 어려운 시기에 그들을 안내할 수 없다면, 우리가 존재해야 할 이유가 무엇이겠습니까!? 말할 것도 없이, 이는 필자에게 씁쓸한 경험이었습니다. 따라서, 몇 가지 쓸모없는 두려움의 실타래를 따라가지 않고, 지난 1년 동안 조직 문화에 대한 연구의 심연으로 빠져들었습니다. 다음 섹션은 지난 1년 동안 배운 내용과 이후 어떻게 적용하고 있는지 요약한 것입니다. 시작하기 전에, 문화에 대한 공통된 이해를 찾아봅시다.</p>\n\n<h3>문화란 무엇인가?</h3>\n<p>지난 수십 년 동안 직장 문화에 대해 많은 이야기가 있었습니다. 문화가 왜 중요한지, 리더십 방식에 어떤 영향을 미치는지 이해하는 것부터, 문화를 변화시키는 방법론을 제공하는 것까지. 필자는 비즈니스 이론가이자 심리학자인 에드가 샤인의 연구와 글에서 엄청난 가치를 발견했습니다. 샤인은 문화를 설명하기 위한 간단한 모델을 제시하며, 세 가지 수준으로 나눕니다:</p>\n\n<h4>아티팩트</h4>\n<p>아티팩트는 샤인 모델의 가장 높은 수준입니다. 이것이 사람들이 \"문화\"라고 말할 때 떠올리는 것들입니다. 즉, 회사가 제공하는 눈에 보이는 혜택입니다. 필자는 팀을 위해 도넛을 가져오도록 비용을 처리해주는 곳에서 일한 적이 있습니다. 다른 직장에서는 테이블 축구대를 제공했습니다. 어떤 회사에서는 매주 함께 점심을 요리하도록 격려했습니다. 이러한 것들, 회사 기념품, 동료를 자랑할 수 있는 Slack 채널, 회사 리트릿 등이 모두 회사 문화의 \"아티팩트\"입니다.</p>\n\n<h4>표방된 가치와 신념</h4>\n<p>그다음 단계는 \"표방된 가치와 신념\"이라고 불립니다. 이것은 문화 내 사람들이 믿는다고 말하는 것입니다. 가치 목록, 사명 선언문, 비전입니다. 웹사이트의 내용이나 벽에 붙어 있는 것들입니다. 면접 과정에서 모든 질문에 대한 답변으로 기대했던 것입니다.</p>\n\n<h4>기본적인 근본 가정</h4>\n<p>가장 깊은 수준은 \"기본적인 근본 가정\"이라고 불립니다. 이것은 조직 내 사람들이 실제로 믿는 것입니다. 이것은 리더십과 직원들이 행동하는 방식이며, 특히 어려운 결정에 직면했을 때 두드러집니다. 이 수준이 문화의 뿌리입니다. 여러분이 무엇을 보여주든(아티팩트), 무엇을 말하든(표방된 신념), 여러분이 믿는 것(근본 가정)은 결국 드러날 것입니다.</p>\n\n<p><strong>바닥에서 시작됩니다</strong></p>\n<p>직원으로서 여러분은 이러한 것들을 위에서 아래로 경험하게 됩니다. 첫날, 여러분은 주변에서 일어나는 일을 관찰하며 문화의 아티팩트를 봅니다. 점차 몇 사람과 알게 됩니다. 그들과 점점 더 많은 대화를 나누면서, 그들이 문화에 대해 이야기하는 방식을 듣게 될 것입니다. 즉, 그들의 표방된 신념을 듣게 됩니다. 어느 시점에서 문화 내 사람들은 어려운 상황에 직면하게 됩니다. 이때가 결정적인 순간이며, 여러분은 그 개인들의 기본적인 근본 가정이 무엇인지 배우게 됩니다.</p>\n\n<p>건강하지 않은 조직은 이러한 근본 가정을 표출하고 가치를 부여하는 프로세스가 없습니다. 건강한 조직은 문화가 회사 내 모든 개인의 기본적인 근본 가정에서 시작된다는 것을 알고 있습니다. 건강하지 않은 조직은 복리후생과 사명 선언문으로 문화를 만들려고 합니다. 건강한 조직은 상위 두 계층이 하위 계층에서 자연스럽게 나타나도록 합니다.</p>\n\n<p>기본적인 근본 가정이 표방된 신념 및 아티팩트와 일치하지 않을 때, 단절은 강렬하게 느껴집니다. 문제를 명확히 설명하기 어려운 경우가 많지만, 사람들은 그것을 느낍니다. 이것은 \"가족 우선\"이라는 핵심 가치를 가지고 있지만, 실제 가족에게 미치는 영향을 전혀 고려하지 않고 항상 출장을 요구하는 회사입니다. 가족을 우선시한다는 표방된 신념은 실제로 내려지는 결정에 의해 적극적으로 지지되지 않습니다.</p>\n\n<h3>강점과 약점</h3>\n<p>우리 모두는 이러한 것들을 무의식적으로 알고 있으며, 이는 조직의 문화를 이야기할 때 우리가 사용하는 언어에 반영됩니다. 우리는 문화를 설명하기 위해 \"강하다\"와 \"약하다\"라는 단어를 사용하는 경향이 있습니다. \"저 회사는 문화가 강하다\"라고 말할 수 있습니다. 이 진술은 계층이 정렬되어 있음을 나타내며, 이는 문화 자체가 의사결정을 안내하는 역할을 한다는 것을 의미합니다. 우리 모두 공유된 가치를 가지고 있다면, 우리는 서로의 결정이 그 가치와 일치할 것이라고 믿을 수 있습니다.</p>\n\n<p>반대로, 문화가 약한 조직은 그들이 말하는 것과 그들이 내리는 결정 사이에 정렬이 부족합니다. 이러한 문화는 종종 개인의 행동을 통제하기 위해 정책과 절차를 지속적으로 추가합니다. 이 시나리오에서 문화는 약한데, 이는 더 강한 문화가 제공하는 유기적인 지침을 제공하지 못하기 때문입니다. 이러한 불일치는 우리가 선택하는 행동이 우리가 말하는 것과 다르다는 것을 의미합니다.</p>\n\n<p>이는 정책과 절차가 나쁘다는 것을 의미하지는 않습니다. 회사가 성장함에 따라 사람들에 대한 기대를 문서화할 필요가 있습니다. 강한 문화의 선제적 특성은 이러한 문서가 종종 유기적으로 나타난 것을 공식화한 것인 반면, 약한 문화는 나쁜 일이 다시 발생하지 않도록 예방하기를 바라며 부정적인 상황에 반응합니다.</p>\n\n<p><strong>편집자 주</strong></p>\n<p>지금까지 읽은 내용이 마음에 드시나요? 이것은 Ben의 곧 출판될 책, Maturing Design Systems의 발췌본입니다. 이 책에서 그는 디자인 시스템의 해부학을 탐구하고, 문화가 성과를 어떻게 형성하는지 설명하며, v1 구축 및 건강한 채택 증진부터 \"사춘기\"를 헤쳐나가고 궁극적으로 안정적이고 영향력 있는 시스템을 운영하기까지 각 단계의 어려움에 대한 실질적인 지침을 공유합니다.</p>\n\n<h3>목차</h3>\n<ul>\n<li><strong>맥락</strong>: 디자인 시스템의 맥락에 대한 소개, 조직 내에서의 위치, 무엇이 디자인 시스템을 키우는지, 그리고 디자인 시스템을 구축해야 하는지 여부에 대한 이해.</li>\n<li><strong>디자인 시스템 문화</strong>: 문화란 무엇인지, 디자인 시스템 팀이 문화를 이해하는 것이 왜 중요한지, 그리고 문화가 어떻게 실제 가치를 제공할 수 있는 능력을 부여하는지에 대한 심층 분석.</li>\n<li><strong>디자인 시스템의 해부학</strong>: 수년간 수백 개의 디자인 시스템을 평가한 결과를 바탕으로 디자인 시스템을 구성하는 계층과 부분을 탐구.</li>\n<li><strong>성숙</strong>: 디자인 시스템 성숙도 모델 개요, 4단계 성숙, 기원 이야기, 건강하게 성숙하기 위한 프레임워크, 디자인 시스템 안정성을 위한 프레임워크 포함.</li>\n<li><strong>1단계, 버전 1 구축</strong>: 디자인 시스템 성숙도 1단계의 의미와 초기 단계에서 올바른 것에 집중하는 데 도움이 되는 몇 가지 사고 모델에 대한 탐구.</li>\n<li><strong>2단계, 채택 증진</strong>: 디자인 시스템 성숙도 모델 2단계 해부, 채택에 대한 시야 확장, 채택 곡선, 지속 가능한 채택을 만드는 방법 심층 분석.</li>\n<li><strong>3단계, 사춘기 생존</strong>: 디자인 시스템 성숙도 모델 3단계의 관련 우려 사항과 이 성숙도 수준에서 오는 더 미묘한 문제를 해결하는 방법 이해.</li>\n<li><strong>4단계, 건강한 프로그램 진화</strong>: 디자인 시스템 성숙도 모델 4단계의 의미, 조직 전체에서 영향력 있는 리더가 되었을 때의 모습 탐구.</li>\n</ul>\n\n<h3>저자 소개</h3>\n<p>Ben Callahan은 작가, 디자인 시스템 연구원, 코치, 강연가입니다. 그는 디자인 시스템 커뮤니티인 Redwoods와 협업 학습을 위한 주간 포럼인 The Question을 설립했습니다. Sparkbox의 공동 창립 파트너로서, 그는 조직이 디자인 시스템에 인간 중심 문화를 통합하도록 돕습니다. 그의 작업은 사람과 시스템을 연결하며, 기술에서 지속 가능한 성장, 팀 정렬, 의미 있는 영향을 강조합니다. 그는 모든 상호작용이 학습의 기회라고 믿습니다.</p>\n\n<h3>검토자 증언</h3>\n<ul>\n<li>\"이 책은 대규모 디자인 시스템을 성숙시키기 위한 명확하고 통찰력 있는 청사진입니다. 잘 지원되는 팀에게는 실제 사례에 기반한 전략과 명확성을 제공합니다. 저와 같은 소규모 팀에게는 작업을 옹호하고 팀의 성숙도에 맞는 솔루션을 찾는 데 도움이 되는 북극성이 됩니다. 디자인 시스템을 구축하는 모든 사람에게 강력히 추천합니다.\" — Lenora Porter, 제품 디자이너</li>\n<li>\"Ben은 프로세스, 협업, 정체성 간의 연결을 직관적이면서도 계시적인 방식으로 제시합니다. 많은 디자인 시스템 서적이 전술적이고 기술적인 부분에 머무르지만, 이 책은 '어떻게'를 넘어 '왜'로 나아갑니다. 독자들이 단순히 제품 소유자, 디자이너 또는 엔지니어로서뿐만 아니라 복잡한 조직 내에서 공유된 이해의 수호자로서 자신의 역할을 성찰하도록 초대합니다. 이 책은 엄격한 해결책을 제시하지 않습니다. 대신, 독자들이 자신이 영향을 미치는 시스템에 의도성, 공감, 회복력을 어떻게 가져올 수 있는지 고려하도록 장려하며 자기 성찰과 정렬을 촉구합니다.\" — Tarunya Varma, 제품 디자인 관리자, Tide</li>\n<li>\"Ben Callahan의 Maturing Design Systems는 많은 사람들이 느끼지만 정확히 설명하기 어려운 어려움에 언어를 부여합니다. 문화, 설정, 리더십의 숨겨진 영향을 파헤쳐 시스템 작업을 수정하고 앞으로 나아갈 수 있는 명확성, 도구 및 프레임워크를 제공합니다. 신생 기업을 성장시키거나 엔터프라이즈를 확장하든 상관없이 해당됩니다.\" — Ness Grixti, 디자인 리드, Wise, \"A Practical Guide to Design System Components\" 저자</li>\n</ul>\n\n<p><strong>놓치지 마세요!</strong></p>\n<p>수년간의 인터뷰, 코칭, 컨설팅을 통해 Ben은 디자인 시스템이 성숙하는 방식에 대한 모델을 발견했습니다. 시스템이 어떻게 성숙하는 경향이 있는지 이해하면 디자인 시스템을 중심으로 지속 가능한 프로그램을 만들 수 있습니다. 이는 단순히 기술적이고 창의적인 측면뿐만 아니라 이 작업의 인간적이고 변화 관리적인 측면을 인정하는 것입니다. 이 책은 디자인 시스템을 다루는 모든 사람에게 귀중한 자료가 될 것입니다!</p>\n\n<p><strong>널리 알려주세요</strong></p>\n<p>Smashing 뉴스레터에 가입하고 Maturing Design Systems를 사전 주문할 수 있을 때 가장 먼저 알아보세요. 여러분과 이 책을 공유할 날을 고대하고 있습니다!</p>\n</body>","createdAt":"2025-11-25T18:00:00.000+00:00","link":"https://smashingmagazine.com/2025/11/design-system-culture/","language":"ko"}