{"content":"<body>\n  <h1>이번 주 프론트엔드 링크 모음</h1>\n  <h2>Links</h2>\n  <ul>\n    <li>\n      <a href=\"https://www.mux.com/blog/tailwind-is-the-worst-form-of-css-except-for-all-the-others\">Tailwind is the worst form of CSS, except for all the others</a>\n      Tailwind의 고집스러운 방식이 거칠게 느껴질 수 있다는 점을 이해합니다. 하지만 다른 관점을 제시하고 싶습니다. 여러분이 좋아하든 싫어하든, opiniónated 도구는 여러분과 팀에 좋기 때문에 Tailwind는 여러분에게 좋습니다.\n    </li>\n    <li>\n      <a href=\"https://www.frontendmasters.com/blog/view-transition-list-reordering-with-a-kick-flip/\">View Transition List Reordering (with a Kick Flip)</a>\n      목록 항목을 새로운 위치로 애니메이션하는 것은 꽤 간단하지만, 특정 항목이 다른 전환이 필요할 때 몇 가지 트릭이 있습니다.\n    </li>\n    <li>\n      <a href=\"https://una.im/popover-hint/\">What is popover=hint?</a>\n      새로운 popover 기능이 정확히 무엇을 하는지, 그리고 interest invokers와 어떻게 관련되는지 알아보세요.\n    </li>\n    <li>\n      <a href=\"https://jeremyrobertjones.com/posts/css-image-rows/\">Creating proportional, equal-height image rows with CSS, 11ty, and Nunjucks</a>\n      동일한 높이의 이미지 레이아웃은 반응형으로 만들려고 할 때 복잡해집니다. 이 튜토리얼에서는 flexbox aspect ratios, Eleventy Image 플러그인, Nunjucks shortcode를 사용한 제 해결책을 안내합니다.\n    </li>\n    <li>\n      <a href=\"https://piccalil.li/blog/a-revisit-of-the-every-layout-sidebar-with-has-and-selector-performance/\">A revisit of the Every Layout sidebar with :has() and selector performance</a>\n      Heydon Pickering은 6년 후 Every Layout 사이드바 레이아웃을 다시 살펴보고 현대 CSS 선택기가 이를 개선할 수 있는지 확인합니다.\n    </li>\n  </ul>\n  <h2>Videos</h2>\n  <ul>\n    <li>\n      <a href=\"https://www.youtube.com/watch?v=2-hJ70-tF3A\">Form control styling</a>\n      텍스트 입력, 체크박스, 라디오 버튼, 슬라이더 등 폼 컨트롤은 웹의 일부였지만 스타일링은 여전히 어렵습니다. 올바르게 보이도록 CSS 줄을 맞추거나 사용자 정의가 충분하지 않아 네이티브 요소를 처음부터 다시 만드는 데 시간을 보냈다면 혼자가 아닙니다. 이 세션에서는 HTML 폼 컨트롤을 스타일링하기 어려웠던 이유를 살펴보고 CSS만 사용하여 사용자 정의를 더 쉽게 만들 수 있는 향후 개선 사항을 소개합니다. 폼 컨트롤이 어떻게 발전해 왔는지, 그리고 새로운 개선 사항이 더 넓은 웹 생태계에 어떻게 적합하는지에 대한 엿보기 기능도 제공합니다. 폼 컨트롤로 어려움을 겪었다면 이 강연에서 실용적인 통찰력과 다음 단계를 엿볼 수 있습니다.\n    </li>\n  </ul>\n  <h2>Sponsor</h2>\n  <ul>\n    <li>\n      Sponsored by Cloud Four\n      이번 주 뉴스레터를 후원해 주신 Cloud Four에게 감사합니다! 그들은 전자 상거래, 의료, 패션, B2B, SaaS 및 비영리 단체를 위한 복잡한 반응형 웹 디자인 및 개발 과제를 해결합니다.\n      Friday Front-End 운영 비용을 지원하고 싶으시다면 월 1달러부터 Patreon을 후원하실 수 있습니다.\n      <a href=\"https://cloudfour.com/\">cloudfour.com</a>\n    </li>\n  </ul>\n  <p>이 RSS 피드는 https://fridayfrontend.curated.co/ 에 게시됩니다. 이메일로도 구독하실 수 있습니다.</p>\n</body>\n","createdAt":"2025-08-13T04:33:52.985Z","language":"ko"}