{"content":"<p>Frontend Focus #701 (2025년 7월 16일)</p>\n\n<h2>주요 기사 및 의견</h2>\n<ul>\n  <li>\n    <p><strong>\"이 128 킬로바이트에 대해 그 이후로 만든 어떤 것보다 더 자랑스럽습니다\"</strong>: 대역폭, 처리 능력 등 엄격한 제약 조건이 어떻게 혁신으로 이어질 수 있는지를 강조하는 프로젝트 회고입니다. 또한 모든 사용자를 고려하고 그에 맞게 디자인해야 한다는 점을 상기시켜 줍니다. (Mike Hall)</p>\n  </li>\n  <li>\n    <p><strong>백엔드 복잡성 없이 프론트엔드 보안 강화</strong>: 로그인, 등록, SSO, MFA를 몇 줄의 코드로 앱에 추가할 수 있습니다. FusionAuth가 보안을 처리하므로 사용자 경험에 집중할 수 있습니다. React, Vue, Angular, 일반 JavaScript와 통합됩니다. 무료로 시작하세요. (FusionAuth 후원)</p>\n  </li>\n  <li>\n    <p><strong>Apple의 브라우저 엔진 금지는 DMA 하에서도 지속됩니다</strong>: Apple이 iOS의 브라우저 엔진 선택과 관련하여 EU의 디지털 시장법(DMA)을 효과적으로 준수하지 않고 있다고 주장합니다. \"Apple은 장벽이 무엇인지 정확히 알고 있으며 이를 제거하지 않기로 선택했습니다.\" (Open Web Advocacy)</p>\n  </li>\n  <li>\n    <p><strong>WebAssembly: 네, 하지만 무엇을 위해?</strong>: ACM Queue에 기고한 여러 JavaScript 및 WASM 구현 기여자가 브라우저와 서버 측에서 WebAssembly가 사용되는 곳과 결국 거의 모든 곳에 포함되는 방법을 잘 요약했습니다. (Andy Wingo / ACM)</p>\n  </li>\n</ul>\n\n<h2>간추린 소식</h2>\n<ul>\n  <li>Mozilla가 마침내 Firefox 141(초기에는 Windows, 이후 macOS 및 Linux)에 WebGPU 지원을 추가합니다.</li>\n  <li>AI가 오픈 소스 개발자 생산성에 미치는 영향에 대한 보고서입니다.</li>\n  <li>Firefox 팀이 Mozilla 브라우저에 대한 사람들의 진짜 요구 사항에 대한 솔직한 피드백을 찾고 있습니다.</li>\n  <li>Andy Bell이 앵커링된 URL에 필요한 여백을 추가하는 CSS 스니펫을 공유합니다.</li>\n</ul>\n\n<h2>기사, 의견 및 튜토리얼</h2>\n<ul>\n  <li>\n    <p><strong>CSS에서 줄 길이 설정 (및 텍스트를 컨테이너에 맞추기)</strong>: clamp(), calc()와 같은 도구 덕분에 몇 년 전보다 줄 길이를 설정하는 것이 훨씬 쉬워졌습니다. Daniel이 옵션과 사용 방법을 살펴보고 미래에 무엇이 있을지 살펴봅니다. (Daniel Schwarz)</p>\n  </li>\n  <li>\n    <p><strong>▶ 다단 및 조각화</strong>: 올해 CSS Day의 거의 한 시간 분량의 발표에서 사양 작성자인 Rachel Andrew가 CSS 다단 레이아웃 사양에 대한 업데이트를 공유하고, 단, 상자, 조각화, 브라우저 지원 등에 대해 자세히 설명합니다. (Rachel Andrew)</p>\n  </li>\n  <li>\n    <p><strong>Lovable으로 AI 코딩 규칙 앱 만들기</strong>: 최소한의 프롬프트로 안전한 전체 스택 앱을 생성하도록 AI를 안내하세요. 아이디어를 작동하는 소프트웨어로 빠르게 전환하는 방법을 배웁니다. (Clerk 후원)</p>\n  </li>\n  <li>\n    <p><strong>스크롤 기반 고정 제목</strong>: Amit은 CSS 스크롤 기반 애니메이션이 \"단순히 멋진 트릭 이상입니다. 새로운 웹 디자인 세계를 열어주는 게임 체인저입니다.\"라고 언급합니다. 이 게시물은 이러한 동적이고 매력적인 것들의 한 가지 예시를 공유합니다 (브라우저 지원은 아직 보편적이지는 않지만). (Amit Sheen)</p>\n  </li>\n  <li>\n    <p><strong>스택 변환</strong>: Chris가 animation-composition CSS 속성을 살펴보고 변환이 애니메이션 중에 어떻게 영향을 미치는지 자세히 설명합니다. 흥미로운 분석이며 Chris는 \"언젠가 유용할 것입니다 [...] 필요할 때까지는 필요하지 않을 것입니다\"라고 언급합니다. (Chris Coyier)</p>\n  </li>\n  <li>\n    <p><strong>ARIA Notify를 사용할 수 있을까요?</strong>: \"미래에 모든 브라우저에서 ARIA Notify API를 사용할 수 있기를 간절히 바라는 이유입니다.\" (Nic Chan)</p>\n  </li>\n  <li>\n    <p>Babylon.js로 3D 제품 구성 프로그램 만들기: 구성 가능한 3D 모델을 웹으로 가져옵니다. (Josh Sanderson)</p>\n  </li>\n  <li>\n    <p>2025년에 순수 HTML 및 CSS를 작성하는 이유 (Joel Dare)</p>\n  </li>\n  <li>\n    <p>ARIA 역할 및 속성을 효과적으로 사용하는 방법 (Michael Beck)</p>\n  </li>\n  <li>\n    <p>스크롤 동작 디자인: 사용자의 위치를 저장할 시점 (Megan Chan)</p>\n  </li>\n  <li>\n    <p>AI는 웹 디자인을 죽이지 않았습니다. 템플릿이 먼저 했습니다. (Noah Davis)</p>\n  </li>\n</ul>\n\n<h2>도구, 코드 및 리소스</h2>\n<ul>\n  <li>\n    <p><strong>SveltePlot: Svelte용 시각화 프레임워크</strong>: API는 Observable의 유사한 플로팅 라이브러리에서 영감을 받았으며 D3 위에 구축되었습니다. 문서에는 플로 플롯, 산점도, 지도, 스트림 그래프 등 다양한 좋은 예가 있습니다. (Gregor Aisch)</p>\n  </li>\n  <li>\n    <p><strong>Eleventy LibDoc: 멋진 문서 작성을 위한 Eleventy 스타터 프로젝트</strong>: 프로젝트의 문서 사이트는 그것이 생성하는 매력적이고 직관적인 레이아웃의 예입니다. 접근 가능하며 검색, 구문 강조 등 다양한 기능을 포함합니다. (IT Automotive Design System)</p>\n  </li>\n  <li>\n    <p><strong>SplitThing: 이미지 업로드 및 사용자 정의 그리드로 분할</strong>: 특정 사용 사례를 위한 간단한 도구입니다. 슬라이더를 사용하여 그리드의 열과 행 수를 정의한 다음 분할된 이미지를 ZIP 파일로 다운로드할 수 있습니다. (Florian Reintgen)</p>\n  </li>\n  <li>\n    <p><strong>Chili3D: 온라인 모델 디자인 및 편집을 위한 웹 기반 3D CAD 앱</strong>: OpenCascade을 WebAssembly로 컴파일하고 Three.js와 통합하여 \"네이티브에 가까운 성능\"을 달성한다고 주장합니다. 직접 시도해 볼 수 있습니다. (xiange chen)</p>\n  </li>\n  <li>\n    <p><strong>designtokens.fyi: 디자인 토큰 관련 용어집</strong>: 현재 33개의 용어가 설명된 잘 구성된 작은 정보 사이트로, CSS에 사용되는 \"사용자 정의 속성\"과 같은 일반적인 것과 \"smedium\"과 같이 규모를 유지하는 데 문제가 있는 것과 같이 덜 일반적인 것들도 포함합니다. (Design Systems House)</p>\n  </li>\n  <li>\n    <p>서버 측 렌더링(SSR) 확인: 제공된 URL의 페이지 요소 중 어떤 것이 서버 측 렌더링되는지 나란히 확인할 수 있도록 도와주는 간단한 도구입니다. (Punit Sethi)</p>\n  </li>\n  <li>\n    <p>FontGen: 지능형 글꼴 페어링 도구: 사용하려면 가입해야 하지만 15개 이상의 범주에 걸쳐 1,000개 이상의 글꼴에 액세스할 수 있습니다. (FontGen)</p>\n  </li>\n  <li>\n    <p>Pandabox: Astro를 위한 경량 라이트박스 및 갤러리 구성 요소: 실제 팬더가 포함된 데모를 여기에서 시도해 볼 수 있습니다. (StJohn)</p>\n  </li>\n</ul>","createdAt":"2025-08-12T10:05:11.374Z","language":"ko"}