{"title":"EP177: The Modern Software Stack","content":"<body>\n    <p>This week's system design refresher covers several key topics relevant to modern software development.</p>\n    <ul>\n        <li>\n            <p><strong>QA Wolf (Sponsored):</strong> A service that automates testing for web and mobile apps, aiming to reduce QA cycles to minutes and enable faster software releases. It offers unlimited parallel test runs, 24-hour maintenance, human-verified bug reports, and a zero-flakes guarantee.</p>\n        </li>\n        <li>\n            <p><strong>How Key Value Stores Work (Redis, DynamoDB, Memcached):</strong> An overview of the fundamental principles behind key-value stores.</p>\n        </li>\n        <li>\n            <p><strong>The Modern Software Stack:</strong> An explanation of the nine typical layers in modern applications, including Presentation, Edge and Delivery, Integration, Messaging & Async Processing, Business Logic, Data Access, Data Storage, Analytics & ML, and Infrastructure.</p>\n        </li>\n        <li>\n            <p><strong>Concurrency is NOT Parallelism:</strong> A distinction between concurrency (managing multiple tasks over overlapping periods, often through rapid switching) and parallelism (simultaneous execution of tasks using multiple CPU cores). The text explains how they can work together.</p>\n        </li>\n        <li>\n            <p><strong>JWT vs PASETO:</strong> A comparison of JSON Web Tokens (JWT) and Platform-Agnostic Security Tokens (PASETO). PASETO is presented as a more modern alternative addressing JWT's security flaws with secure defaults and enforced strong algorithms.</p>\n        </li>\n        <li>\n            <p><strong>The Linux Cron Cheatsheet:</strong> A guide to Cron, a time-based job scheduler for automating repetitive tasks using cron expressions, including format, examples, special strings, and characters.</p>\n        </li>\n        <li>\n            <p><strong>AI Agent versus MCP:</strong> An explanation of AI agents (autonomous software programs that interact with their environment to achieve goals) and Model Context Protocol (MCP) (an Anthropic system enabling AI models to connect to external systems via an open standard).</p>\n        </li>\n        <li>\n            <p><strong>Data-in-Motion Transparency (Sponsored):</strong> Qtap, a lightweight eBPF agent, is introduced as a tool providing kernel-level visibility into TLS/SSL traffic, showing unencrypted payloads, originating processes, and full context with zero performance impact.</p>\n        </li>\n        <li>\n            <p><strong>DevStats (Sponsored):</strong> A tool for engineering leaders to analyze metrics, understand flow, and ship faster, helping to identify bottlenecks, link dev work to business goals, and prove impact.</p>\n        </li>\n    </ul>\n</body>","createdAt":"2025-08-23T15:30:26.000+00:00","link":"https://blog.bytebytego.com/p/ep177-the-modern-software-stack","language":"en"}