{"title":"EP190: Cloudflare vs. AWS vs. Azure","content":"<body>\n    <h1>Sentry, 이제 로그까지 지원합니다 (스폰서)</h1>\n    <p>Sentry의 새로운 기능인 Logs를 통해 사용자 요청부터 코드 실행, 로그 기록까지 모든 단계를 추적할 수 있습니다. 에러, 추적, 플레이백과 자동으로 연결되어 디버깅 컨텍스트를 한곳에서 관리할 수 있습니다. 결과적으로 더 많은 컨텍스트, 적은 탭, 빠른 수정, 더 많은 배포 시간을 얻을 수 있습니다.</p>\n    <p>지금 Sentry 무료 체험을 시작하세요!</p>\n\n    <h2>이번 주 시스템 디자인 복습</h2>\n    <ul>\n        <li>Cloudflare vs. AWS vs. Azure</li>\n        <li>인기 있는 백엔드 기술 스택</li>\n        <li>HTTP vs. HTTPS</li>\n        <li>Forward Proxy와 Reverse Proxy</li>\n        <li>동시성(Concurrency)과 병렬성(Parallelism)의 차이</li>\n    </ul>\n\n    <h2>Cloudflare vs. AWS vs. Azure</h2>\n    <p>Cloudflare는 CDN과 DDoS 보호 서비스를 넘어 Workers, R2, D1과 같은 개발자 친화적인 엣지 네이티브 서비스를 제공하며 AWS, Azure와 경쟁하는 클라우드 제공업체로 성장했습니다. Cloudflare는 다음과 같은 기능을 지원합니다:</p>\n    <ul>\n        <li>엣지 컴퓨팅 및 서버리스</li>\n        <li>객체 및 블롭 스토리지</li>\n        <li>관계형 데이터베이스</li>\n        <li>컨테이너</li>\n        <li>샌드박스</li>\n        <li>워크플로우</li>\n        <li>AI 에이전트 SDK</li>\n        <li>벡터 및 AI 검색</li>\n        <li>데이터 연결</li>\n        <li>AI 인프라</li>\n        <li>콘텐츠 전송 네트워크 (CDN)</li>\n        <li>DNS</li>\n        <li>로드 밸런싱</li>\n    </ul>\n    <p>Cloudflare의 새로운 기능에 대한 의견을 공유해 주세요.</p>\n\n    <h2>인기 있는 백엔드 기술 스택: HTTP vs. HTTPS</h2>\n    <p>HTTP와 HTTPS의 차이는 데이터 전송의 안전성을 결정합니다.</p>\n    <h3>HTTP</h3>\n    <ul>\n        <li>데이터를 일반 텍스트로 전송하여 네트워크 상의 누구나 가로챌 수 있습니다.</li>\n        <li>클라이언트와 서버 간에 단순한 TCP 핸드셰이크 (SYN, SYN-ACK, ACK)를 수행합니다.</li>\n        <li>빠르지만 보안에 취약하여 비밀번호, 토큰, 폼 데이터 등이 전송 중에 노출될 수 있습니다.</li>\n    </ul>\n    <h3>HTTPS (SSL/TLS)</h3>\n    <ol>\n        <li><strong>TCP 핸드셰이크:</strong> 표준 연결 설정</li>\n        <li><strong>인증서 확인:</strong> 클라이언트가 'hello'를 보내면 서버는 'hello'와 함께 SSL/TLS 인증서를 응답합니다. 이 인증서에는 서버의 공개 키가 포함되어 있으며 신뢰할 수 있는 인증 기관(CA)이 서명했습니다. 브라우저는 이 인증서가 유효하고 만료되지 않았으며 접속하려는 도메인에 속하는지 확인하여 공격자가 아닌 실제 서버와 통신하고 있음을 증명합니다.</li>\n        <li><strong>키 교환:</strong> 비대칭 암호화가 이루어집니다. 서버는 공개 키와 개인 키를 가지고 있습니다. 클라이언트는 세션 키를 생성하고 서버의 공개 키로 암호화하여 전송합니다. 서버는 개인 키로만 이 세션 키를 복호화할 수 있습니다. 이제 양측은 다른 사람이 가로챌 수 없는 동일한 세션 키를 갖게 되며, 이 키는 세션 동안 대칭 암호화 키로 사용됩니다.</li>\n        <li><strong>데이터 전송:</strong> 이후 모든 요청과 응답은 이 세션 키를 사용하여 대칭 암호화됩니다.</li>\n    </ol>\n    <p>TLS 문제 디버깅에 주로 사용하는 도구는 무엇인가요? (openssl, curl -v 등)</p>\n\n    <h2>Forward Proxy와 Reverse Proxy</h2>\n    <p><strong>Forward Proxy:</strong> 클라이언트(사용자)와 인터넷 사이에 위치하며, 사용자를 대신하여 트래픽을 필터링하거나 익명성을 보호합니다. 주로 사용자 브라우징 보호, 웹사이트 접근 제한, 자주 접근하는 콘텐츠 캐싱을 통한 웹 브라우징 속도 향상에 사용됩니다.</p>\n    <p><strong>Reverse Proxy:</strong> 인터넷(클라이언트)과 백엔드 서버 사이에 위치하며, 서버를 대신하여 들어오는 트래픽을 처리합니다. 여러 서버로 트래픽을 분산하여 부하를 줄이고, SSL 암호화/복호화를 처리하며, 백엔드 서버를 DDoS 공격으로부터 보호하는 데 사용됩니다.</p>\n    <p>Forward Proxy와 Reverse Proxy에 대해 추가적으로 알아야 할 내용이 있다면 무엇인가요?</p>\n\n    <h2>모든 개발자가 알아야 할 것: 동시성(Concurrency)은 병렬성(Parallelism)이 아니다</h2>\n    <p>시스템 디자인에서 동시성과 병렬성의 차이를 이해하는 것은 중요합니다.</p>\n    <p><strong>동시성(Concurrency):</strong> 많은 일을 한 번에 <strong>처리하는 것</strong>에 관한 것입니다. 프로그램의 <strong>설계</strong>와 관련 있으며, 여러 작업을 동시에 관리하고 시작, 실행, 완료가 겹칠 수 있지만 반드시 동시에 완료될 필요는 없습니다. 독립적으로 실행되는 프로세스의 구성이며, 한 작업을 완료하기 전에 다른 작업을 시작할 수 있습니다.</p>\n    <p><strong>병렬성(Parallelism):</strong> 많은 일을 한 번에 <strong>수행하는 것</strong>에 관한 것입니다. 프로그램의 <strong>실행</strong>과 관련 있으며, 여러 프로세서 또는 코어를 활용하여 여러 연산을 동시에 수행합니다. 병렬성은 여러 처리 장치를 필요로 하며, 시스템의 처리량과 계산 속도를 높이는 것이 주 목표입니다.</p>\n    <p><strong>실질적으로:</strong></p>\n    <ul>\n        <li><strong>동시성:</strong> I/O 바운드 및 고지연 작업에서 프로그램이 외부 이벤트(파일, 네트워크, 사용자 입력 등)를 기다리는 동안에도 응답성을 유지하고 백그라운드 작업을 수행하며 여러 작업을 동시에 처리하는 것처럼 보이게 합니다. 단일 코어 프로세서에서도 효과적입니다.</li>\n        <li><strong>병렬성:</strong> CPU 바운드 작업에서 계산 속도와 처리량이 병목 현상일 때 중요합니다. 복잡한 수학 계산, 데이터 분석, 이미지 처리, 실시간 처리 등은 병렬 실행을 통해 크게 이점을 얻을 수 있습니다.</li>\n    </ul>\n\n    <h2>스폰서 모집</h2>\n    <p>100만 명 이상의 기술 전문가에게 제품을 선보이세요. 본 뉴스레터는 수십만 명의 엔지니어링 리더 및 시니어 엔지니어에게 직접적으로 도달하여 중요한 기술 결정 및 구매에 영향을 미치는 잠재 고객에게 귀사의 제품과 서비스를 소개합니다.</p>\n    <p><strong>광고 공간은 빠르게 마감됩니다. 지금 예약하세요.</strong></p>\n    <p>광고는 일반적으로 약 4주 전에 매진됩니다. 이 영향력 있는 오디언스에게 광고를 전달하려면 sponsorship@bytebytego.com으로 이메일을 보내 지금 공간을 예약하세요.</p>\n</body>","createdAt":"2025-11-22T16:30:44.000+00:00","link":"https://blog.bytebytego.com/p/ep190-cloudflare-vs-aws-vs-azure","language":"ko"}