{"content":"```html\n<h2>CSS Interview Questions Preparation Guide</h2>\n\n<p>This article provides a comprehensive list of 10 common CSS interview questions for front-end developers, categorized by difficulty.</p>\n\n<h3>Easy Questions:</h3>\n<ol>\n    <li><strong>Responsive Website Building:</strong> Discussed using relative units (%, em, rem), media queries, and fluid layouts. Emphasized a \"mobile-first\" approach.</li>\n    <li><strong>CSS Preprocessors:</strong> Explained Sass, Less, and Stylus for features like mixins and functions, promoting DRY code.</li>\n    <li><strong>Responsive Fonts:</strong> Covered using rem, em, clamp(), viewport units (vw, vh), and media queries for readable text across devices.</li>\n</ol>\n\n<h3>Medium Questions:</h3>\n<ol start=\"4\">\n    <li><strong>z-index and Stacking Context:</strong> Described how z-index controls element layering and how stacking contexts are formed by positioning and specific CSS properties.</li>\n    <li><strong>Display Property (block, inline, inline-block):</strong> Differentiated how these values affect an element's flow, width, and height behavior.</li>\n    <li><strong>box-sizing: border-box:</strong> Explained how it includes padding and border within an element's total width and height, improving layout predictability.</li>\n    <li><strong>Responsive Images:</strong> Covered using max-width: 100%, the padding-bottom trick for aspect ratio, and the modern aspect-ratio property. Mentioned HTML's srcset and &lt;picture&gt; element.</li>\n</ol>\n\n<h3>Hard Questions:</h3>\n<ol start=\"8\">\n    <li><strong>CSS Performance:</strong> Outlined strategies like minimizing bundle size, splitting/lazy-loading CSS, using shallow selectors, minifying/compressing, considering critical CSS, reducing expensive properties, avoiding !important, optimizing unused CSS, and regular auditing using browser DevTools.</li>\n    <li><strong>CSS-in-JS vs. External CSS Imports:</strong> Compared pros and cons, including scoping, runtime overhead, caching, and dynamic styling. Suggested a hybrid approach.</li>\n    <li><strong>Layout Building:</strong> Highlighted the common \"Holy Grail\" layout challenge, emphasizing problem-solving and demonstrating knowledge of CSS Grid or Flexbox.</li>\n</ol>\n\n<p>The article concludes by encouraging thorough preparation of these topics and provides a link to frontendlead.com for further resources.</p>\n```","createdAt":"2025-08-12T09:41:40.883Z","language":"en"}