{"title":"How Uber Built a Conversational AI Agent For Financial Analysis","content":"<body>\n    <p>Uber 엔지니어링 팀은 재무팀의 데이터 접근성 문제를 해결하기 위해 'Finch'라는 대화형 AI 데이터 에이전트를 개발했습니다. Finch는 Slack 내에서 자연어로 질문하면 실시간으로 금융 데이터를 조회하여 제공합니다. 이는 여러 플랫폼을 탐색하거나 복잡한 SQL 쿼리를 작성할 필요 없이, 질문에 대한 답변을 즉시 얻을 수 있게 하여 의사 결정 속도를 높입니다.</p>\n    <h2>Finch의 주요 기능 및 아키텍처</h2>\n    <ul>\n        <li>\n            <p><strong>자연어 기반 데이터 조회</strong>: 사용자가 간단한 자연어로 질문하면, Finch는 이를 SQL 쿼리로 변환하여 적절한 데이터 소스에서 최신 금융 데이터를 실시간으로 가져옵니다.</p>\n        </li>\n        <li>\n            <p><strong>보안</strong>: 역할 기반 접근 제어(RBAC)를 통해 민감한 금융 정보에 대한 접근을 안전하게 관리합니다.</p>\n        </li>\n        <li>\n            <p><strong>자동 데이터 내보내기</strong>: 데이터 세트가 클 경우, Google Sheets로 자동 내보내어 사용자가 추가 작업 없이 바로 분석할 수 있도록 지원합니다.</p>\n        </li>\n        <li>\n            <p><strong>모듈식 아키텍처</strong>: 데이터 레이어, 시맨틱 레이어, Generative AI Gateway, LangChain/LangGraph, OpenSearch, Slack SDK, Google Sheets Exporter 등으로 구성되어 확장성과 유지보수성을 높였습니다.</p>\n        </li>\n        <li>\n            <p><strong>OpenSearch 활용</strong>: 자연어 용어와 실제 데이터베이스 스키마 간의 매핑 정보를 저장하여, 다양한 표현으로 질문해도 정확하게 데이터를 인식하고 처리할 수 있습니다.</p>\n        </li>\n        <li>\n            <p><strong>에이전트 워크플로우</strong>: Supervisor Agent가 요청을 분류하고, SQL Writer Agent가 OpenSearch의 메타데이터를 활용하여 SQL 쿼리를 생성 및 실행하는 방식으로 작동합니다. 처리 과정은 Slack을 통해 실시간으로 사용자에게 피드백됩니다.</p>\n        </li>\n    </ul>\n    <h2>정확성 및 성능 평가</h2>\n    <ul>\n        <li>\n            <p><strong>지속적인 평가</strong>: 하위 에이전트 평가, Supervisor Agent 라우팅 정확도 확인, 엔드 투 엔드 검증, 회귀 테스트 등을 통해 시스템의 정확성을 꾸준히 검증합니다.</p>\n        </li>\n        <li>\n            <p><strong>성능 최적화</strong>: 효율적인 SQL 쿼리 작성, 병렬 처리 가능한 하위 에이전트 활용, 자주 사용되는 메트릭 사전 로딩 등을 통해 응답 속도를 최적화합니다.</p>\n        </li>\n    </ul>\n    <h2>향후 계획</h2>\n    <ul>\n        <li>\n            <p><strong>기능 확장</strong>: 더 많은 금융 시스템 및 워크플로우를 지원하기 위한 FinTech 통합, CEO 및 CFO를 위한 인간-기계 검증 시스템 도입, 예측, 보고, 자동 분석 등 더 풍부한 금융 사용 사례 지원을 계획하고 있습니다.</p>\n        </li>\n    </ul>\n    <p>Finch는 Uber의 재무팀이 데이터를 접근하고 상호 작용하는 방식을 혁신적으로 개선하여, 복잡한 데이터 처리 과정을 단순화하고 의사 결정의 효율성을 극대화하는 솔루션입니다.</p>\n</body>","createdAt":"2025-11-10T16:31:11.000+00:00","link":"https://blog.bytebytego.com/p/how-uber-built-a-conversational-ai","language":"ko"}