{"title":"How Netflix Built a Distributed Write Ahead Log For Its Data Platform","content":"<body>\n<p>Netflix는 데이터의 복원력을 강화하기 위해 Write-Ahead Log (WAL) 시스템을 구축했습니다. 이 시스템은 스키마 변경으로 인한 데이터 손상, 다양한 저장 시스템 간의 불일치, 일시적인 장애로 인한 메시지 전달 실패와 같은 반복적인 문제를 해결하는 데 목적이 있습니다.</p>\n<h2>Write-Ahead Log (WAL) 란?</h2>\n<p>WAL은 데이터베이스에 변경 사항을 적용하기 전에 모든 변경 사항을 기록하는 시스템입니다. 이는 데이터가 손실되거나 불일치가 발생하는 것을 방지하여 복구 및 일관성을 보장합니다.</p>\n<h2>Netflix WAL의 특징</h2>\n<ul>\n<li><strong>분산형:</strong> 대규모 데이터 처리를 위해 여러 서버에 걸쳐 실행됩니다.</li>\n<li><strong>플러그형:</strong> Kafka, Amazon SQS, Apache Cassandra, EVCache 등 다양한 기술과 쉽게 통합할 수 있습니다.</li>\n</ul>\n<h2>WAL의 주요 이점</h2>\n<ul>\n<li><strong>내구성:</strong> 모든 변경 사항이 먼저 기록되므로 데이터베이스 장애 시에도 데이터 손실이 없습니다.</li>\n<li><strong>재시도 및 지연 지원:</strong> 장애 발생 시 메시지를 자동으로 재시도하고 사용자 정의 지연 시간을 설정할 수 있습니다.</li>\n<li><strong>지역 간 복제:</strong> 재해 복구를 위해 여러 데이터 센터에 동일한 정보가 복제됩니다.</li>\n<li><strong>다중 파티션 일관성:</strong> 여러 테이블 또는 파티션을 포함하는 복잡한 업데이트 시 변경 사항의 조정을 보장합니다.</li>\n</ul>\n<h2>WAL API</h2>\n<p>WAL API는 간단한 <code>WriteToLog</code> 작업을 제공합니다. 서비스는 데이터 변경 사항을 설명하는 요청을 WAL에 보내고, WAL은 이를 처리하여 안전하게 저장한 후 성공 여부를 응답합니다.</p>\n<ul>\n<li><strong>요청 구성 요소:</strong> Namespace, Lifecycle, Payload, Target</li>\n<li><strong>응답 구성 요소:</strong> Durable, Message</li>\n</ul>\n<p>각 네임스페이스는 자체 구성을 가지며, Kafka 또는 Amazon SQS와 같은 다른 시스템을 사용하도록 설정할 수 있습니다.</p>\n<h2>WAL의 다양한 활용 사례</h2>\n<ul>\n<li><strong>지연 큐:</strong> 다운스트림 서비스의 일시적 장애 시 Amazon SQS를 사용하여 메시지를 지연시키고 나중에 재시도합니다.</li>\n<li><strong>지역 간 복제:</strong> EVCache와 같은 시스템에서 데이터를 여러 지역으로 복제하여 전 세계적으로 일관성을 유지합니다.</li>\n<li><strong>다중 파티션 변환:</strong> Apache Cassandra와 같은 시스템에서 여러 파티션 또는 테이블에 걸친 복잡한 업데이트를 원자적으로 처리합니다.</li>\n</ul>\n<h2>WAL 내부 아키텍처</h2>\n<ul>\n<li><strong>Producers:</strong> 애플리케이션의 변경 요청을 받아 큐에 기록합니다.</li>\n<li><strong>Consumers:</strong> 큐에서 메시지를 읽어 대상 시스템으로 전달합니다.</li>\n<li><strong>Message Queues:</strong> Kafka 또는 Amazon SQS를 사용하여 Producer와 Consumer를 연결하고, 각 네임스페이스별로 독립적인 큐를 제공합니다.</li>\n<li><strong>Dead Letter Queue (DLQ):</strong> 처리 실패 메시지를 저장하여 나중에 검토하고 수정할 수 있도록 합니다.</li>\n<li><strong>Control Plane:</strong> 큐 유형, 재시도 횟수, 지연 시간 등 설정을 애플리케이션 코드 변경 없이 관리합니다.</li>\n<li><strong>Targets:</strong> 데이터가 전달되는 최종 목적지 (데이터베이스, 캐시, 메시지 큐 등)입니다.</li>\n</ul>\n<h2>WAL 배포 모델</h2>\n<p>WAL은 Netflix의 Data Gateway Infrastructure 위에 배포되어 보안, 연결 관리, 자동 확장 및 로드 셰딩 기능을 활용합니다. WAL 배포는 여러 애플리케이션 또는 사용 사례를 처리하는 독립적인 배포 단위인 샤드로 구성됩니다. 각 샤드 내의 네임스페이스 설정은 전역적으로 복제된 SQL 데이터베이스에 저장됩니다.</p>\n<h2>결론</h2>\n<p>WAL의 성공은 플러그형 아키텍처, 기존 인프라 활용, Producer와 Consumer의 분리, 그리고 시스템의 한계를 고려한 설계 원칙에 기반합니다. 향후 Netflix는 WAL에 보조 인덱스 지원 및 다중 대상 쓰기를 추가하여 기능을 더욱 강화할 계획입니다.</p>\n</body>","createdAt":"2025-12-02T16:30:47.000+00:00","link":"https://blog.bytebytego.com/p/how-netflix-built-a-distributed-write","language":"ko"}