{"content":"```html\n<p>We are taking a break and will return on Wednesday, August 20.</p>\n<section>\n  <h3>React Status</h3>\n  <ul>\n    <li><a>JavaScript Isn’t the Problem, Replacing the Browser Was</a> by Peter Pistorius</li>\n    <li><a>Embrace: User-Focused Observability for Mobile and Web</a> (Sponsored)</li>\n    <li><a>Building a Full-Stack App with React and Aspire</a> by Sayed Ibrahim Hashimi</li>\n  </ul>\n  <h4>In Brief:</h4>\n  <ul>\n    <li>TypeScript 5.9 released with import defer and expandable hovers.</li>\n    <li>Jack Herrington pits tRPC against oRPC in type-safe API battle.</li>\n    <li>Vercel AI SDK 5 released.</li>\n    <li>Minimal React framework Waku adopts Vite's official RSC plugin.</li>\n    <li>A project to reproduce macOS UI with React.</li>\n  </ul>\n  <ul>\n    <li><a>Unlocking Web Workers with React: A Step-by-Step Guide</a> by Rahul M. Juliato</li>\n    <li><a>React Query Selectors, Supercharged</a> by Dominik Dorfmeister</li>\n    <li><a>How Teams Like Cursor Stop Bots from Abusing Free Trials</a> (Sponsored)</li>\n  </ul>\n  <ul>\n    <li>Component Testing with Storybook 9 and Vitest by Dominic Nguyen</li>\n    <li>How to Build An AI Assistant with LangGraph, Next.js, and Auth0 by Deepu K Sasidharan</li>\n    <li>Introducing Stan: A New State Management Library for TypeScript by Rafał Krupiński</li>\n    <li>We’ve Moved From TanStack Start to Next.js: Here's Why by LLM Gateway</li>\n  </ul>\n</section>\n<section>\n  <h3>Code, Tools & Libraries</h3>\n  <ul>\n    <li><a>FlashList v2: A High Performance List for React Native</a> by Shopify</li>\n    <li><a>React Native Audio API</a> by Software Mansion</li>\n    <li><a>React-Date-Picker 12.0</a> by Wojciech Maj</li>\n  </ul>\n  <ul>\n    <li>Relay 20.1</li>\n    <li>Storybook 9.1</li>\n    <li>React Stripe.js 3.9</li>\n    <li>react-json-view 1.27</li>\n  </ul>\n</section>\n<section>\n  <h3>Classifieds</h3>\n  <ul>\n    <li>Add barcode & QR scanning to your web app with STRICH.</li>\n  </ul>\n</section>\n<section>\n  <h3>Elsewhere in JavaScript</h3>\n  <ul>\n    <li>Update on ViteLand, including Vite 7.0, Rolldown, Oxlint, Vitest.</li>\n    <li>Significant performance improvements to JSON.stringify in V8 13.8.</li>\n    <li>Node.js v22.18.0 (LTS) can execute TypeScript natively.</li>\n    <li>Dan Abramov blogs about the Lean programming language.</li>\n  </ul>\n</section>\n<p>See you again on Wednesday, August 20. Feel free to send submissions.</p>\n```","createdAt":"2025-08-12T09:39:00.245Z","language":"en"}