{"title":"Is there no such thing as a 'CSS reset'?","content":"<body>\n  <h1>프론트엔드 최신 정보 요약</h1>\n  <p>지난주 휴가 후 돌아온 최신 프론트엔드 링크 모음입니다. 추가 업데이트는 Bluesky에서도 팔로우하실 수 있습니다.</p>\n\n  <h2>🚀 프론트엔드 포커스</h2>\n\n  <ul>\n    <li>\n      <p><strong>SVG 경로 대화형 가이드</strong>: Josh W. Comeau가 SVG 경로에 대한 자세한 정보를 제공합니다. 복잡해 보이는 SVG 경로를 쉽게 이해할 수 있도록 설명합니다.</p>\n    </li>\n    <li>\n      <p><strong>CSS 현황 2025 결과</strong>: 올해 CSS 설문조사 결과를 통해 스타일링을 넘어선 CSS의 변화를 조명합니다. 레이아웃, 모션, 접근성 등 CSS 활용에 대한 실제적인 정보를 제공하며, 80%의 응답자가 :has() 의사 클래스를 사용했다고 합니다.</p>\n    </li>\n    <li>\n      <p><strong>패스키는 보안 로그인 미래</strong>: FusionAuth sponsored. 비밀번호보다 안전한 로그인 방법을 소개합니다. 패스키는 WebAuthn을 사용하여 피싱을 방지하고 사용자 경험을 향상시키며, 여러 기기에서 안전하게 로그인할 수 있게 합니다.</p>\n    </li>\n    <li>\n      <p><strong>새로운 @function 규칙을 사용한 유용한 CSS 함수 5가지</strong>: Una Kravets가 Chrome 139에 새로 추가된 CSS 함수 사용법을 실용적인 예시와 함께 소개합니다. 아직 브라우저 지원은 제한적이지만, 이 기능이 열어갈 가능성을 보여줍니다.</p>\n    </li>\n    <li>\n      <p><strong>CSS 속성: 출시 날짜 및 문서 링크 포함 완전 참조</strong>: Nikolai Shabalin이 CSS 속성의 역사적인 정보를 제공합니다. 연도별 속성 도입 현황을 볼 수 있으며, 30년 가까이 된 속성도 33개나 된다는 점이 흥미롭습니다.</p>\n    </li>\n  </ul>\n\n  <h2>⚡️ 간단 소식</h2>\n  <ul>\n    <li>Firefox 최신 버전 성능 문제에 대한 Mozilla의 비판과 수정 작업이 진행 중입니다.</li>\n    <li>OpenAI가 Chromium 기반 AI 브라우저를 테스트/준비 중이라는 소식이 있습니다.</li>\n    <li>MDN이 깔끔한 인터페이스와 개선된 UX로 새 단장을 합니다.</li>\n    <li>Jeremy Wagner가 최근 Baseline 변경 사항에 대한 업데이트를 공유했습니다.</li>\n  </ul>\n\n  <h2>📙 기사, 의견 & 튜토리얼</h2>\n  <ul>\n    <li>\n      <p><strong>앵커 포지셔닝에 대한 쉬운 소개</strong>: Saron Yitbarek (WebKit)이 anchor()를 사용하여 CSS만으로 한 요소를 다른 요소에 상대적으로 배치하는 방법을 설명합니다.</p>\n    </li>\n    <li>\n      <p><strong>scroll-marker-group 및 :target-current를 사용한 CSS 전용 스크롤스파이 효과</strong>: Sara Soueidan이 이 새로운 속성을 사용하여 Bootstrap Scrollspy 효과를 몇 줄의 코드로 재현하는 방법을 보여줍니다. 사용자의 스크롤 위치에 따라 활성 네비게이션 링크를 업데이트하는 접근적이고 포괄적인 방법을 설명합니다.</p>\n    </li>\n    <li>\n      <p><strong>커서와 같은 팀이 봇의 무료 평가판 남용을 막는 방법</strong>: WorkOS sponsored. WorkOS Radar는 장치 지문 인식, 무차별 대입 공격 탐지 및 실시간 방어를 사용하여 봇, 사기 및 남용을 차단합니다.</p>\n    </li>\n    <li>\n      <p><strong>Intl API의 힘: 브라우저 기본 국제화에 대한 결정적 가이드</strong>: Fuqiao Xue가 무거운 타사 라이브러리 대신, 강력하고 네이티브한 국제화 처리 방법을 제공하는 Intl API를 소개합니다.</p>\n    </li>\n    <li>\n      <p><strong>'CSS 리셋이란 없다'</strong>: Adam Stoddard가 '리셋'이라는 단어의 의미에 대해 질문합니다. 브라우저 기본값이 유일한 객관적인 기본 상태라고 주장합니다.</p>\n    </li>\n    <li>\n      <p><strong>내 Baseline은 무엇인가?</strong>: Jeremy Wagner가 Baseline 프로젝트가 웹 전반의 기능 채택과 잠재적 위험을 더 잘 이해하도록 돕는다고 설명합니다. Chrome 팀은 프로젝트에서 사용하는 Baseline 타겟 공유를 권장합니다.</p>\n    </li>\n    <li>\n      <p><strong>노란색, 보라색, 그리고 \"접근성이 색상 팔레트를 제한한다\"는 신화</strong>: Stéphanie Walter가 접근성이 색상 팔레트 선택을 제한하지 않으며, 제한은 종종 WCAG 색상 대비에 대한 지식 부족 때문이라고 말합니다.</p>\n    </li>\n    <li>\n      <p><strong>▶ Polypane 개발 브라우저로 더 나은 웹사이트 구축</strong>: Stefan Judis가 Polypane 개발 브라우저를 소개하는 1시간 분량의 영상을 제공합니다. 개발 배경과 개발 도구로서의 유용성을 보여줍니다.</p>\n    </li>\n    <li>\n      <p><strong>hidden=until-found 다루기</strong>: Geoff Graham이 이 기능에 대한 익숙하지 않음을 공유합니다.</p>\n    </li>\n    <li>\n      <p><strong>PostCSS 제작에서 배운 것</strong>: Andrey Sitnik (Evil Martians)이 PostCSS 제작 경험을 공유합니다.</p>\n    </li>\n    <li>\n      <p><strong>CSS 두 줄로 DOM 요소 크기 조정</strong>: Amit Merchant가 DOM 요소 크기를 조정하는 방법을 보여줍니다.</p>\n    </li>\n    <li>\n      <p><strong>느린 웹사이트 수정 방법: 웹 성능 팁 4가지</strong>: Scott Moore가 웹사이트 속도 개선을 위한 팁을 제공합니다.</p>\n    </li>\n    <li>\n      <p><strong>접근성에 얼마를 써야 할까?</strong>: Karl Groves가 접근성 투자에 대한 질문에 답합니다.</p>\n    </li>\n  </ul>\n\n  <h2>🧰 도구, 코드 & 리소스</h2>\n  <ul>\n    <li>\n      <p><strong>jQuery 4.0.0 Release Candidate 1</strong>: Timmy Willison이 jQuery 4.0의 릴리스 후보를 알립니다. 사용자들이 테스트하고 피드백을 제공하도록 독려합니다.</p>\n    </li>\n    <li>\n      <p><strong>백엔드 서비스 통신 보안 준비</strong>: Clerk sponsored. Clerk M2M 토큰이 공개 베타로 출시되어 백엔드 인프라 내 머신 간 요청을 인증할 수 있습니다.</p>\n    </li>\n    <li>\n      <p><strong>Panda CSS 1.0: 모던, 빌드 타임, 타입 안전 CSS-in-JS</strong>: Segun Adebayo가 Chakra UI 제작자가 만든 DX 중심의 CSS-in-JS 접근 방식을 소개합니다. 빌드 타임 생성 스타일과 타입 안전성을 제공하며, Remix, Vite, Next.js, Astro 및 서버 컴포넌트와 함께 작동합니다.</p>\n    </li>\n    <li>\n      <p><strong>Apache ECharts 6.0: 강력한 데이터 시각화 라이브러리</strong>: Apache Software Foundation이 ECharts 6.0을 소개합니다. 다양한 시각화 유형과 새로운 기본 테마, 동적 테마 전환, 다크 모드 지원 등을 제공합니다.</p>\n    </li>\n    <li>\n      <p><strong>Hoverly: 링크 및 제목에 호버 효과 추가</strong>: Karol Król이 WordPress용으로 디자인되었지만 어디서든 사용할 수 있는 호버 효과 도구를 소개합니다. 글로우, 밑줄 슬라이드, 텍스트 채우기 등 효과를 빠르게 미리 볼 수 있습니다.</p>\n    </li>\n    <li>\n      <p><strong>PatternCraft: 모던 배경 패턴 & 그라디언트</strong>: PatternCraft에서 100개 이상의 미리 볼 수 있는 그라디언트, 기하학적 패턴, 장식 패턴 및 효과를 제공합니다.</p>\n    </li>\n    <li>\n      <p><strong>Kelp: 모던 CSS와 웹 컴포넌트로 구동되는 UI 라이브러리</strong>: Chris Ferdinandi가 클래스 없는 HTML과 유틸리티 클래스, 웹 컴포넌트를 기반으로 하는 Kelp UI 라이브러리를 소개합니다. 빌드 단계가 필요 없으며 CSS 변수와 HTML 속성으로 사용자 정의할 수 있습니다.</p>\n    </li>\n  </ul>\n\n  <h2>📨 마지막으로</h2>\n  <ul>\n    <li>\n      <p><strong>이메일은 '쉬워요'</strong>: Sam Rose가 이메일 주소의 유효성을 판단하는 간단한 퀴즈를 제공합니다.</p>\n    </li>\n  </ul>\n</body>","createdAt":"2025-08-20T00:00:00.000+00:00","link":"https://frontendfoc.us/issues/705","language":"ko"}