{"content":"<body>\n<p>본 글은 OpenInfra Foundation 공식 블로그 Superuser에 영문본으로 게시된 내용을 바탕으로 작성되었습니다.</p>\n<p>2024년 9월 3일에 개최된 오픈인프라 아시아 서밋(OpenInfra Summit Asia) 2024는 아시아 오픈소스 커뮤니티 지원을 위해 2023년 설립된 오픈인프라 아시아(OpenInfra Asia)의 첫 서밋으로, 앤트그룹, 화웨이 등 아시아 주요 기업과 NHN Cloud가 참여했습니다.</p>\n<p>Open Compute Project(OCP) 재단과의 공동 주최로 240명 이상의 연사가 190개 이상의 세션을 통해 리눅스, 오픈스택, Kubernetes 등 30개 이상의 오픈소스 프로젝트를 다루었으며, 30개국에서 1500명 이상의 참가자가 모였습니다.</p>\n<p>다수의 세션이 영어와 한국어로 진행되었으며, 16개국 이상 언어 동시 번역 서비스가 flitto를 통해 제공되어 참가자들이 편리하게 접근할 수 있었습니다.</p>\n\n<h2>주요 키노트 발표 내용</h2>\n<ul>\n  <li>\n    <h3>인프라 트렌드 4가지 (Mark Collier, OpenInfra Foundation COO)</h3>\n    <ul>\n      <li><strong>Digital Sovereignty:</strong> 데이터 주권에 대한 관심 증대로, 프랑스 은행들의 오픈스택 도입 사례와 같이 데이터를 직접 관리하려는 움직임이 확산되고 있습니다. 이는 RISC-V와 같은 오픈소스 하드웨어 트렌드와도 연결됩니다.</li>\n      <li><strong>License Changes:</strong> Terraform의 라이선스 변경으로 Open Tofu가 등장하고, VMware의 라이선스 변경으로 OpenStack 마이그레이션이 주목받는 것처럼, 오픈소스가 해결책을 제시하고 있습니다. GEICO의 VMware에서 OpenStack으로의 마이그레이션 사례가 소개되었습니다.</li>\n      <li><strong>Security Concerns:</strong> 컨테이너 이미지 취약점 문제 해결을 위해 Kata Container 프로젝트가 주목받고 있으며, Microsoft Azure, NVIDIA, AWS 등이 지원하고 있습니다.</li>\n      <li><strong>AI Redefining Infra:</strong> AI 기술 발전에 따라 GPU 확보 및 데이터센터 구축 투자가 활발하며, 오픈스택이 AI 워크로드를 지원하는 데 중요한 역할을 하고 있습니다.</li>\n    </ul>\n  </li>\n</ul>\n\n<h2>주요 세션 내용</h2>\n<ul>\n  <li>\n    <h3>NHN Cloud의 OpenStack 네트워크 구현 (박성우 이사)</h3>\n    <ul>\n      <li>NHN Cloud는 2015년부터 OpenStack Neutron을 활용하여 네트워크를 구축했으나, 초기에는 이중화, 장애 조치, 스케일업 기능의 한계가 있었습니다.</li>\n      <li>Neutron의 기본 구조(큐라우터, OVS integration bridge, 리눅스 브릿지)에서 겪었던 문제점(유지 보수 부담, OSI 2계층 제약)을 해결하기 위해 리눅스 브릿지와 큐라우터를 제거하고 OVS integration bridge로 대체했습니다.</li>\n      <li>VxLAN 기반 네트워크 분할, NVIDIA SR-IOV Representer 연동을 통한 I/O 성능 개선, 큐라우터를 랙 상단으로 이동하여 컴퓨트 노드 단순화 등의 방안을 적용했습니다.</li>\n      <li>랙 상단 라우터 트래픽 집중 문제를 해결하기 위해 5mpps 처리 속도를 자랑하는 자체 개발 vSwitch를 도입했습니다.</li>\n      <li>고객 증가에 따른 VPC 생성 필요성으로 VLAN에서 VxLAN으로 전환했으며, Security Groups 외 Network ACL 구성, VPN Gateway 연결로 보안과 안정성을 강화했습니다.</li>\n    </ul>\n  </li>\n  <li>\n    <h3>커뮤니티와 기여 조직 간의 격차 해소 (포럼)</h3>\n    <p>오픈 소스 커뮤니티 활성화를 위한 포럼으로, 신규 및 기존 기여자 간의 원활한 소통과 기여자 경험 개선 방안에 대한 논의가 이루어졌습니다.</p>\n  </li>\n</ul>\n\n<h2>OpenStack의 미래 역할</h2>\n<p>오픈인프라 아시아 서밋 2024는 클라우드 산업 혁신에서 오픈소스 커뮤니티의 중요성을 재확인하는 자리였습니다. VMware에서 OpenStack으로의 마이그레이션 증가는 오픈스택이 확장 가능하고 안전하며 비용 효율적인 솔루션으로 주목받고 있음을 보여줍니다. AI와 같은 고성능 컴퓨팅 요구 증가에 대응할 수 있는 오픈인프라 커뮤니티의 잠재력과 지속 가능한 기술 개발에 대한 기대감을 높였습니다.</p>\n</body>","createdAt":"2025-08-12T16:25:26.385Z","language":"ko"}