{"title":"Masonry: Things You Won’t Need A Library For Anymore","content":"<body>\n<p>15년 전, 필자는 여행사, 공항 직원, 항공사를 위한 앱을 개발하던 회사에서 일했습니다. 당시에는 JS, Ajax, 동적 HTML이 혁신으로 여겨졌고, 필자의 팀은 자체 UI 컴포넌트 프레임워크를 구축하여 모든 것을 JavaScript로 해결했습니다. 브라우저 호환성 문제, 특히 Internet Explorer 지원 때문에 웹 플랫폼 자체의 기능을 깊이 이해하기보다는 JavaScript로 해결하는 방식을 택했습니다.</p>\n\n<p>하지만 오늘날 웹 플랫폼은 훨씬 발전했으며, 더 많은 기능을 내장하고 있어 라이브러리 의존도를 줄일 수 있습니다. 이는 다음과 같은 이점을 제공합니다:</p>\n\n<ul>\n<li>\n<p><strong>코드 최소화</strong>: 라이브러리 대신 웹 플랫폼 기능을 사용하면 기기로 전송되는 코드의 양이 크게 줄어들어 로딩 성능이 향상됩니다.</p>\n</li>\n<li>\n<p><strong>성능 향상</strong>: JavaScript 추상화가 적을수록 코드가 더 빠르게 실행되고 응답성이 좋아집니다.</p>\n</li>\n<li>\n<p><strong>유지보수 용이성</strong>: 웹 표준을 따르는 코드는 이해하기 쉽고, 라이브러리 변경이나 중단으로 인한 위험이 적습니다.</p>\n</li>\n</ul>\n\n<p>현재 웹 플랫폼에서 다음과 같은 기능들을 통해 라이브러리 의존성을 줄일 수 있습니다:</p>\n\n<ul>\n<li>\n<p><strong>팝오버 및 다이얼로그</strong>: Popover API, <code>&lt;dialog&gt;</code> 요소를 사용하여 팝업, 툴팁, 다이얼로그 라이브러리를 대체할 수 있습니다. 이들은 접근성과 포커스 관리를 자동으로 처리하며 CSS로 사용자 정의가 가능합니다.</p>\n</li>\n<li>\n<p><strong>아코디언</strong>: <code>&lt;details&gt;</code> 및 <code>&lt;summary&gt;</code> 요소를 사용하여 아코디언 컴포넌트 없이도 상호 배타적인 요소의 콘텐츠를 표시하고 숨길 수 있습니다. 이는 JavaScript 없이도 작동하며 애니메이션도 지원합니다.</p>\n</li>\n<li>\n<p><strong>CSS 기능</strong>: Cascade layers, CSS nesting, 새로운 색상 함수, <code>:has()</code> 등은 CSS 전처리기나 유틸리티 라이브러리에 대한 의존성을 줄여줍니다.</p>\n</li>\n<li>\n<p><strong>JS 유틸리티</strong>: 최신 배열 및 Set 메서드를 사용하면 Lodash와 같은 라이브러리를 대체할 수 있습니다.</p>\n</li>\n<li>\n<p><strong>컨테이너 쿼리</strong>: 뷰포트 크기 외에 컨테이너 크기에 반응하여 UI 컴포넌트를 재사용 가능하게 만들어 JavaScript 기반 UI 라이브러리나 폴리필 없이 사용할 수 있습니다.</p>\n</li>\n<li>\n<p><strong>레이아웃</strong>: Grid, subgrid, flexbox, multi-column과 같은 기능은 Bootstrap, Tailwind CSS 등의 레이아웃 시스템을 대체할 수 있습니다.</p>\n</li>\n</ul>\n\n<p>향후에는 다음과 같은 기능들이 더욱 널리 사용될 것으로 예상됩니다:</p>\n\n<ul>\n<li>\n<p><strong>앵커 포지셔닝</strong>: 팝오버와 툴팁을 다른 요소에 상대적으로 배치하고 화면 내에 유지하는 기능을 제공하여 JavaScript 기반 솔루션을 대체할 수 있습니다.</p>\n</li>\n<li>\n<p><strong>Navigation API</strong>: 싱글 페이지 앱(SPA)의 네비게이션 처리를 간소화하여 React Router, Next.js 라우팅 등 라이브러리를 대체할 수 있습니다.</p>\n</li>\n<li>\n<p><strong>View Transitions API</strong>: 페이지 상태 간의 부드러운 전환 애니메이션을 SPA 및 다중 페이지 애플리케이션 모두에서 지원하여 애니메이션 라이브러리를 대체할 수 있습니다. 이 API가 있었다면 SPA 프레임워크 없이도 페이지 전환 시 발생하는 흰색 깜빡임을 방지할 수 있었을 것입니다.</p>\n</li>\n<li>\n<p><strong>스크롤 기반 애니메이션</strong>: 사용자의 스크롤 위치에 따라 애니메이션을 실행하여 스토리텔링이나 제품 투어에 유용하며 ScrollReveal, GSAP Scroll 등의 라이브러리를 대체할 수 있습니다.</p>\n</li>\n<li>\n<p><strong>사용자 정의 가능한 선택</strong>: <code>&lt;select&gt;</code> 요소를 통해 접근성과 성능을 유지하면서 모양과 콘텐츠를 완전히 사용자 정의할 수 있어, 유지보수가 어려운 기존 JavaScript 기반 사용자 정의 선택 컴포넌트를 대체할 수 있습니다.</p>\n</li>\n<li>\n<p><strong>CSS Masonry</strong>: 현재는 라이브러리로 구현되는 Masonry 레이아웃을 CSS 내장 기능으로 제공하여 성능, 반응성, 사용 편의성을 향상시킬 것입니다. 이는 Pinterest와 같은 사이트에서 볼 수 있는 레이아웃으로, 아이템들이 각 트랙에 최대한 가깝게 배치되는 방식입니다. 브라우저 벤더들이 이 기능 구현에 적극적이며, CSS working group에서도 표준화 작업이 진행 중입니다. (참고: <a href=\"https://developer.chrome.com/blog/css-masonry\">CSS Masonry</a>)</p>\n</li>\n</ul>\n\n<p>웹 플랫폼 기능을 학습하고 활용하는 것은 개발자에게 큰 이점을 제공하며, 코드의 효율성과 성능을 높이는 데 기여합니다.</p>\n</body>\n<link rel=\"alternate\" hreflang=\"en\" href=\"https://developer.chrome.com/blog/css-masonry/\">\n<link rel=\"alternate\" hreflang=\"ko\" href=\"https://developer.chrome.com/ko/blog/css-masonry/\">\n<link rel=\"canonical\" href=\"https://developer.chrome.com/blog/css-masonry/\">","createdAt":"2025-12-02T10:00:00.000+00:00","link":"https://smashingmagazine.com/2025/12/masonry-things-you-wont-need-library-anymore/","language":"ko"}