{"content":"<body>\n<p>This article explores the need for an intermediate CSS unit between root and relative values, proposing a new concept called \"base\" units like <code>bem</code> (base em) and <code>blh</code> (base line-height).</p>\n\n<p>Current CSS units fall into two categories:</p>\n<ul>\n<li>Root values (e.g., <code>rem</code>, <code>rlh</code>) tied to the <code>:root</code> selector (commonly the <code>html</code> element).</li>\n<li>Relative values (e.g., <code>em</code>, <code>lh</code>, <code>ch</code>) tied to the <code>font-size</code> of the specific element they are applied to.</li>\n</ul>\n\n<p>The author argues that a unit referencing a specific element's font size, but acting as a base for its children, would simplify styling, especially for typographic rhythm and component spacing.</p>\n\n<p>Two primary examples illustrate the problem:</p>\n<ul>\n<li><strong>Prose example:</strong> Using <code>1lh</code> for margins in a <code>.prose</code> class breaks down when typography of different sizes is introduced, as <code>1lh</code> becomes disproportionately large. While Flexbox with <code>gap</code> can help, it leads to proximity confusion, requiring more complex margin adjustments.</li>\n<li><strong>Card component example:</strong> Applying <code>lh</code> for padding within a card with a different header font size causes the header's margin to become excessively large. Using <code>rlh</code> is also problematic when the card needs to scale to different font sizes.</li>\n</ul>\n\n<p>The proposed \"base\" units (<code>bem</code> and <code>blh</code>) would allow elements to inherit a defined font size from a specific parent, simplifying calculations for padding, margins, and other spacing.</p>\n\n<p>Potential implementation methods discussed include:</p>\n<ul>\n<li><strong>Container Queries:</strong> Introducing units like <code>cqbem</code> or <code>cqlh</code>, though this requires defining containers and can lead to collisions.</li>\n<li><strong>Anchor Positioning Syntax:</strong> Explicitly defining a <code>base-anchor</code> or <code>base-name</code> for elements to inherit values from.</li>\n</ul>\n\n<p>The article also provides a practical, albeit more verbose, workaround using CSS variables and <code>calc()</code> that can be implemented today, along with suggestions for abstracting this into Sass mixins or Tailwind utilities. The author also mentions a library called \"Splendid Styles\" that offers pre-built solutions.</p>\n\n<p>The author seeks community feedback on the concept of these intermediate units, the proposed names <code>bem</code> and <code>blh</code>, and whether this design aspect is overthought.</p>\n</body>","createdAt":"2025-08-13T20:26:41.021Z","language":"en"}