{"content":"<body>\n<p>이번 주 React 업데이트 소식입니다. TanStack 생태계에서 많은 흥미로운 릴리스가 있었습니다. React Native에서는 iOS 빌드 시간 단축과 개발 경험 향상에 대한 기대가 있습니다. 또한 TC39 회의와 TypeScript 5.9, Node 22.18 출시가 임박했습니다.</p>\n<ul>\n<li>TanStack DB 0.1 출시: React Query와 함께 사용되는 임베디드 클라이언트 데이터베이스로, 데이터 간의 관계를 설정하고 변경된 부분만 재계산하는 차분 데이터 흐름을 사용합니다.</li>\n<li>React Core PR: \"Throw a Promise\" 기법을 Deprecate하고 React.use(promise)로 마이그레이션 권장.</li>\n<li>React Core PR: React.cache() 수명 종료 시 AbortSignal을 제공하여 네트워크 요청을 중단할 수 있도록 합니다.</li>\n<li>Next.js PR: Turbopack 사용 시 모듈 그래프 등을 쿼리할 수 있는 MCP 서버를 노출합니다.</li>\n<li>Next.js Conf - 2025년 10월 23일 샌프란시스코에서 개최.</li>\n<li>Useless useCallback: useCallback의 잘못된 사용으로 인한 최적화 문제에 대해 설명합니다.</li>\n<li>How Parcel bundles React Server Components: Parcel이 RSC 환경에서 코드를 분할하고 사전 로드하는 방식을 설명합니다.</li>\n<li>TanStack Start에서 Next.js로 마이그레이션: 제품 변경 사항과 X에서의 논의를 공유합니다.</li>\n<li>React Hooks From Scratch: React Hooks를 처음부터 작성하는 방법을 안내합니다.</li>\n<li>Component Test with Storybook and Vitest: Storybook과 Vitest를 사용한 컴포넌트 테스트 방법을 설명합니다.</li>\n<li>Apryse WebViewer: DOCX 편집 기능을 React 앱에 추가하는 방법을 소개합니다.</li>\n<li>React 19.1.1: 버그 수정 릴리스.</li>\n<li>Remix 2.17: create-react-router로 리디렉션.</li>\n<li>TanStack Router 1.130: disableGlobalCatchBoundary 옵션 추가.</li>\n<li>TanStack Form 1.15: new withFieldGroup API 출시.</li>\n<li>React Hook Form 7.61: useWatch() 구독을 위한 compute prop 추가.</li>\n<li>Int 6.1: React CLI 렌더러의 Box 컴포넌트에 backgroundColor 지원 추가.</li>\n<li>React Aria - 7월 22일 릴리스: 무한 스크롤, 자동 폼 리셋, 추가 DOM 이벤트/속성 지원.</li>\n<li>Base UI 1.0 beta.2: Radix UI 대안으로 발전 중.</li>\n<li>Satori 0.16: JSX를 SVG로 변환, Yoga 레이아웃 엔진 업그레이드.</li>\n<li>Preact 10.27: ref 콜백 정리 함수 typedefs에 추가.</li>\n<li>React Native 0.81: iOS 빌드 시간 단축을 위한 사전 컴파일된 React Native 사용 가능.</li>\n<li>React Native PR: enableEagerAlternateStateNodeCleanup으로 메모리 사용량 감소.</li>\n<li>Expo Changelog - 7월 중순 웹사이트 업데이트: EAS Hosting, Workflows, Organizations 등.</li>\n<li>Expo Docs: \"dangerous mod\" 문서 페이지 추가.</li>\n<li>Boost Your React Native App Start Time: Lottie JSON을 앱 번들에 포함하지 않고 파일 시스템에서 읽도록 권장.</li>\n<li>Nativewind v5 Migration Guide: v5로의 마이그레이션 준비 가이드.</li>\n<li>On-Device Text Embeddings in React Native with Apple NLP framework: Apple NLP 프레임워크를 사용한 온디바이스 텍스트 임베딩.</li>\n<li>6 reasons to use EAS Update: EAS Update 사용의 6가지 이유.</li>\n<li>Rozenite: React Native DevTools를 위한 플러그인 프레임워크. Flipper의 현대적인 대안으로 기대됨.</li>\n<li>React Native AI 0.2: Apple Foundation Model 개선, 스트리밍 지원.</li>\n<li>React Navigation Routers 7.5: backBehavior=fullHistory에 대한 params 보존.</li>\n<li>Nitro 0.27: new dispose() API, Swift 클래스 공개, 속도 향상.</li>\n<li>Bottom Sheet 5.1.8: Reanimated 4 지원.</li>\n<li>Tinybase 6.5: MMKV 스토어를 위한 새 persister.</li>\n<li>Reanimated 4: CSS Transition & Animations에 대한 모든 것.</li>\n<li>Create Stunning App Icons with AI: AI를 사용한 앱 아이콘 생성 방법.</li>\n<li>React Native Charts for Beginners: 초보자를 위한 React Native 차트.</li>\n<li>RNR 338: React Native Enterprise Framework with Michał Pierzchała.</li>\n<li>TC39 회의 진행 중: Map.getOrInsert(), Math.sumPrecise(), Iterator sequencing 등 여러 제안 진행.</li>\n<li>The many, many, many JavaScript runtimes of the last decade: JavaScript 런타임 다양성의 원인을 설명하는 기사.</li>\n<li>vi.mock Is a Footgun - Why vi.spyOn Should Be Your Default: Vitest/Jest 모킹 기능 설명.</li>\n<li>DNS Caching in NodeJS: DNS 확인으로 인한 스레드 풀 과부하 문제.</li>\n<li>Treating types as values with type-level maps: 타입 레벨 맵을 사용한 타입 처리.</li>\n<li>When Is WebAssembly Going to Get DOM Support?: WebAssembly의 DOM 지원 시점.</li>\n<li>TypeScript 5.9 RC: import defer, require(esm)에 대한 stable 옵션, IDE 툴팁 확장, 타입 인스턴스화 속도 향상.</li>\n<li>es-toolkit 1.39: lodash의 현대적 대안, 속도 및 크기 개선. lodash와 100% 호환.</li>\n<li>ArkType Attest: TypeScript 타입을 런타임에서 사용할 수 있게 하는 테스트 라이브러리.</li>\n<li>npq: npm 패키지 설치 전 감사.</li>\n</ul>\n<p>다음 뉴스레터는 8월 20일에 발행됩니다.</p>\n</body>","createdAt":"2025-08-13T00:42:09.906Z","language":"ko"}