{"title":"This Week In React #247: nuqs, Concurrent React, Apollo, shadcn, Streamdown, Fragment Refs, Waku, React-Aria | Expo Launch, Maestro, SPM, Screens, ExecuTorch, BottomSheet, Jest | Zod, Rspack, ESLint, CSS, Bun, Firefox","content":"<body>\n<p>이번 주 React 커뮤니티 소식입니다. 휴가에서 돌아온 커뮤니티는 흥미로운 글과 릴리스를 쏟아냈습니다. Nx 사용자라면 현재 진행 중인 공급망 공격에 주의하세요.</p>\n<h2>주요 업데이트</h2>\n<ul>\n<li>nuqs 2.5: type-safe 검색 파라미터 상태 관리 라이브러리에 디바운스, 표준 스키마, TanStack Router 지원 등 다양한 기능이 추가되었습니다.</li>\n<li>React Context Selectors RFC 업데이트: React 컴파일러 팀에서 컨텍스트 셀렉터의 확장성 문제와 대안에 대한 업데이트를 공유했습니다.</li>\n<li>React Types PR - Fragment Refs: React 프래그먼트에 대한 실험적인 기능으로, Fragment Instance API가 공개될 예정입니다.</li>\n<li>React PR - &lt;div&gt; 및 &lt;span&gt; 요소에 name prop 추가: React DevTools에서 컴포넌트를 쉽게 식별하고 검색하는 데 유용할 것으로 예상됩니다.</li>\n<li>Next.js PR - export const prefetch: ‘static’ | ‘runtime’: 경로 세그먼트의 사전 가져오기를 제어하는 새로운 API입니다.</li>\n<li>React 문서 - Custom Elements: 사용자 정의 HTML 요소에 값을 전달하고 이벤트를 수신하는 방법에 대한 새 문서가 추가되었습니다.</li>\n<li>Remix v3: Preact 기반이 아닌 JSX 기반 컴포넌트 모델을 탐색할 예정입니다.</li>\n<li>React Summit US: 11월 18일과 21일 미국 뉴욕에서 개최됩니다.</li>\n<li>React의 useTransition 및 상태 업데이트 재정렬: setState 업데이트 순서에 대한 흥미로운 사례를 문서화했습니다.</li>\n<li>React 커뮤니티에 대한 성찰: Vercel/Next.js의 전 DevRel인 Lee Robinson이 Vercel의 React 추진 인센티브에 대한 인사이트를 공유했습니다.</li>\n<li>스냅되지 않는 시계: 정적 렌더링된 React 페이지에서 현재 시간을 표시하는 과제와 해결책을 설명합니다.</li>\n<li>Tanstack Query를 사용하여 전역적으로 Toast 알림 관리: TkDodo의 권장 사항에 따라 mutationMeta를 사용합니다.</li>\n<li>React Router의 React Server Components - 첫인상: 개인 웹사이트에 React Router RSC를 적용한 후 긍정적인 피드백을 공유했습니다.</li>\n<li>React 동시 기능 개요</li>\n<li>React를 사용하여 웹 워커 잠금 해제 - 단계별 가이드</li>\n<li>React 19 및 Strapi 5로 최신 블로그 구축 - 단계별 튜토리얼</li>\n<li>Apollo Client 4.0: 프레임워크에 구애받지 않고 번들 크기 감소, 통합 오류 처리, TypeScript 지원 강화 등 대규모 업데이트가 이루어졌습니다.</li>\n<li>Streamdown: AI 기반 스트리밍을 위한 react-markdown 대체 라이브러리입니다.</li>\n<li>Waku 0.24 / 0.25 / 0.26: Vite RSC 플러그인 채택 및 Slice Components API 도입 등의 업데이트가 있었습니다.</li>\n<li>shadcn CLI 3.0: 네임스페이스 레지스트리, 개인 레지스트리, 검색 및 검색, 오류 처리 개선 등의 기능을 제공합니다.</li>\n<li>React Aria - 8월 25일 릴리스: Popover 애니메이션, GridListSection, 자동 완성 필터링 개선</li>\n<li>Preact 11 베타: 하이드레이션 개선, 기본적으로 전달되는 ref 등</li>\n<li>Alex Booker - Next.js로 더 나은 인증</li>\n<li>Alem Tuzlak - 10분 안에 TanStack Devtools로 놀라게 해주겠습니다.</li>\n<li>Theo - 모든 개발자가 React를 피해야 하는 이유</li>\n<li>Jack Herrington - AI SDK 버전 5 on TanStack Start!</li>\n<li>Cosden Solutions - React 성능 최적화의 잘못된 방법</li>\n<li>PodRocket - 동시 렌더링 및 Aurora Sharff와의 액션</li>\n<li>PodRocket - DOM을 넘어선 React: Erik Rasmussen과 함께하는 사용자 정의 렌더러 탐색</li>\n</ul>\n<h2>React Native</h2>\n<ul>\n<li>Expo Launch 소개: 웹사이트 인터페이스에서 iOS 앱을 TestFlight로 배포하는 새로운 방법입니다.</li>\n<li>React Universe Conf: \"10 Years of React Native and Beyond\" 패널 토론</li>\n<li>Swift Package Manager 지원 진행 상황: 0.81 프리빌드가 SPM을 사용하며, RNTester 앱을 SPM으로 빌드하기 위한 작업이 진행 중입니다.</li>\n<li>RFC - Jest를 React Native Core에서 분리: Jest 프리셋을 별도 패키지로 추출하여 유지 관리 용이성을 높이고 Vitest 사용자를 위한 Jest 설치 부담을 줄입니다.</li>\n<li>제안 - iOS에서 누락된 CSS 필터 구현: CAFilter 및 Swift Modifier의 두 가지 접근 방식</li>\n<li>Android의 Bridging Trace API</li>\n<li>격리된 React Native 인스턴스 간의 보안 통신</li>\n<li>Apple Developer Program 없이 개발 빌드 생성</li>\n<li>EAS Workflows: React Native CI/CD</li>\n<li>Apple 기기에서 AI SDK를 사용한 온디바이스 텍스트 음성 변환</li>\n<li>React Native 성능 기법: 최신 전략 및 도구</li>\n<li>Maestro 2.0: Java 17, GraalJS 기본, Maestro Studio Desktop, 웹 테스팅, 방향 설정 개선</li>\n<li>Screens 4.15: 탭 개선 (외부 아이콘, 시스템 항목, 방향, 모양 유형)</li>\n<li>React Native ExecuTorch 0.5: 더 빠른 Whisper 전사, Zod 구조화 출력, 제로 복사 데이터 전송</li>\n<li>React Native Parlant: RN으로 규정 준수 Parlant AI 채팅 에이전트 구축</li>\n<li>Bottom Sheet 5.2: useBottomSheetScrollableCreator()를 LegendList/FlashList와 통합</li>\n<li>Re.Pack 5.2: 더 빠른 변환, TS 구성 지원, RN 0.80/0.81 및 Rozenite DevTools</li>\n<li>React Native Reusables: 새로운 CLI, 라이브 미리보기로 재설계된 문서, 새로운 블록</li>\n<li>notJust.dev - Expo SDK 54 (베타) 출시!</li>\n<li>Callstack - iOS 앱의 점진적 React Native 채택</li>\n<li>Expo - 오버 더 에어 업데이트 사용 시기 | 세 가지 중요한 OTA 사용 사례</li>\n<li>Simon Grimm - Expo Router를 사용한 중첩 탭이 있는 서랍 탐색</li>\n<li>RNR 341 - Leland Takamine이 참여하는 Maestro 따라잡기</li>\n<li>Rocket Ship 79 - Jamon Holmgren과 함께하는 New Arch, AI 영향 및 차세대 RN 혁신</li>\n</ul>\n<h2>기타</h2>\n<ul>\n<li>Big O 표기법 - 시각적 소개: JS 기반 예제를 포함한 상호 작용형 기사</li>\n<li>Rush.js 모노레포를 Node 타입 스트리핑으로 마이그레이션한 방법</li>\n<li>CSS random()으로 주사위 굴리기</li>\n<li>새로운 @function 규칙을 사용하는 5가지 유용한 CSS 함수</li>\n<li>ESLint 9.34: 멀티스레드 린팅으로 30%~380% 속도 향상</li>\n<li>Zod 4.1: 코덱, encode()/decode()를 통한 양방향 변환</li>\n<li>Rspack 1.5: 더 빠른 와처, 최적화, 브라우저 지원, 가상 모듈, Rust 확장 등. Rslint(TypeScript Go 기반의 새 Go 린터) 발표</li>\n<li>Bun 1.2.21: 통합 Bun.SQL 클라이언트, YAML 지원, 500배 빠른 postMessage(), Bun.secrets, 보안 스캐너 등</li>\n<li>Firefox 142.0: URLPattern API, 스케줄러 API 등</li>\n</ul>\n</body>","createdAt":"2025-08-27T00:00:00.000+00:00","link":"https://thisweekinreact.com/newsletter/247","language":"ko"}