{"title":"This Week In React #267: Bun, Next-Intl, Grab, Aria, ViewTransition, Skills, Gatsby, R3f | Worklets, Teleport, Voltra, AI SDK, Screens, Tamagui, Xcode, Agent-Device | State of JS, Temporal, Babel, Astro, npmx","content":"<body>\n  <h1>AI와 React 생태계 소식</h1>\n  <p>이번 주에도 AI와 React 생태계에 대한 다양한 소식을 전해드립니다. State of JavaScript 2025 설문조사에서 저희 뉴스레터가 상위 5위 안에 든 것을 다시 한번 자랑스럽게 생각하며, 여러분의 성원에 감사드립니다. 2026년에도 더 나은 뉴스레터를 만들기 위한 여러분의 소중한 피드백을 기다립니다. </p>\n\n  <h2>주요 스폰서</h2>\n  <ul>\n    <li>\n      <p><strong>React Performance, v2</strong> - Steve Kinney의 고급 성능 과정으로, React 19 패턴을 사용하여 실제 병목 현상을 진단하고 느린 React 앱을 최적화합니다. Suspense, transitions, deferred values, hydration, server actions 등 현대 React 기능을 다루며, React DevTools와 Profiler를 활용한 디버깅, 최적화 기법, Feel-Fast UX 등을 배울 수 있습니다. (4+시간, 4.8점, Frontend Masters 제공)</p>\n      <p><strong>URL:</strong> <a href=\"https://frontendmasters.com/courses/react-performance-v2/\">https://frontendmasters.com/courses/react-performance-v2/</a></p>\n    </li>\n    <li>\n      <p><strong>Meticulous</strong> - Notion, Dropbox, LaunchDarkly가 사용하는 새로운 테스트 패러다임으로, 개발 노력 없이도 거의 완벽한 E2E UI 테스트 커버리지를 제공합니다. 개발자의 개입 없이 자동으로 진화하는 테스트 슈트를 생성하며, 플렉스(flake) 없는 안정적인 테스트 환경을 제공합니다. (문의: <a href=\"mailto:learnmore@meticulous.ai\">learnmore@meticulous.ai</a>)</p>\n    </li>\n  </ul>\n\n  <h2>React</h2>\n  <ul>\n    <li>PostHog: 에이전트 운영 1년 동안의 8가지 학습 내용</li>\n    <li>React DOM PR: SubmitEvent.submitter 지원</li>\n    <li>React.dev PR: useOptimistic, useActionState, useEffectEvent 문서 개편</li>\n    <li>React’s ViewTransition Element: Chris Coyier가 React 앱에서 ViewTransition Element 사용과 네이티브 platform API document.startViewTransition() 사용의 장단점을 비교 분석했습니다.</li>\n    <li>Why Inngest migrated off Next.js to TanStack Start: Inngest가 RSCs 사용 시 겪었던 느린 로컬 개발 경험과 Turbopack 사용에도 불구하고 겪었던 어려움을 공유하며, Next.js에서 TanStack Start로 마이그레이션한 전략과 교훈을 제시합니다. 로컬 개발 시간을 83% 단축했습니다.</li>\n    <li>Reverse-Engineering Figma Make: .fig 파일에서 React 앱 추출 방법을 설명합니다. Figma Make는 React, Radix UI, Tailwind를 사용하며, .fig 파일에서 기반 React 앱을 재현할 수 있습니다.</li>\n    <li>The engineering behind GitHub Copilot CLI’s animated ASCII banner: React Ink 렌더러를 사용하더라도 터미널 UI에 안정적인 애니메이션 컴포넌트를 렌더링하는 복잡성을 다룹니다.</li>\n    <li>Can AI actually debug complex React/Next.js issues?: Claude Opus를 사용하여 3가지 실제 버그를 디버깅한 결과, 하나만 제대로 수정했습니다.</li>\n    <li>React design system library MCP: 실험적인 Storybook MCP 서버 활용법</li>\n    <li>ElevenLabs: 대규모 AI 음성 에이전트 구축을 위한 경영진 플레이북</li>\n    <li>Next Intl 4.8: Ahead-of-time 컴파일 기능을 통해 번들 크기를 크게 줄일 수 있습니다. ICU 파서를 클라이언트에 번들링하는 대신, 미리 컴파일된 ICU 메시지를 경량 런타임으로 해석합니다.</li>\n    <li>Bun 1.3.8: Bun.markdown API가 추가되었으며, Bun.markdown.react() API를 통해 React 대안보다 훨씬 빠른 속도를 제공한다고 합니다.</li>\n    <li>React Grab 1.0: 웹사이트에서 코딩 에이전트의 컨텍스트를 직접 선택할 수 있는 도구로, 보다 정확한 프롬프트로 코딩 에이전트를 3배 빠르게 만들 수 있습니다.</li>\n    <li>shadcn/ui 업데이트: RTL 지원, 통합 Radix UI 패키지</li>\n    <li>React Aria 1.15: 새로운 render prop, Agent Skills, blur 시 날짜 제약 기능 추가</li>\n    <li>Gatsby 5.16: React 19 및 Node 24 지원 추가</li>\n    <li>Rspress 2.0: 문서 프레임워크로, 테마 스타일링, AI 네이티브 기능, Shiki 하이라이팅, 성능 개선, 새로운 플러그인 포함</li>\n    <li>React Three Fiber 10.0 alpha: 이전 버전과 호환되며, WebGPU 지원, TSL hooks, 새로운 스케줄러 포함</li>\n    <li>Travels 1.0: React 통합 기능을 갖춘 빠르고 프레임워크에 구애받지 않는 undo/redo 라이브러리</li>\n    <li>Prefill: React 컴포넌트의 부분 적용</li>\n    <li>Meteor 3.4: Rspack 통합, 빌드 속도 4배 향상, 번들 크기 8배 감소, 번들러 기능 확장</li>\n    <li>ESLint React 2.9: React RSC 서브 플러그인 추출, 새로운 RSC 프리셋</li>\n    <li>Rsbuild Plugin React Router 0.1: React Router의 공식 Vite 플러그인과 유사한 동작</li>\n    <li>Agent Skills: React Router, React Composition Patterns</li>\n    <li><strong>동영상:</strong> Toby Mey - Where to put Auth in Next.js 16?</li>\n    <li><strong>동영상:</strong> Remotion - AI를 활용한 모션 그래픽 제작 (초보자 튜토리얼)</li>\n  </ul>\n\n  <h2>React Native</h2>\n  <ul>\n    <li>Behind the Scenes of React Native Multithreading: Vision Camera V5 x React Native Worklets: Worklets가 Reanimated에서 분리되어 1급 멀티스레딩 프리미티브가 되었습니다. VisionCamera V5에 통합되어 실시간 프레임 프로세서 시스템을 카메라 스레드에서 직접 실행할 수 있습니다. Worklets 0.8의 Bundle Mode 미리보기는 워크렛 내에서 타사 라이브러리 및 네트워크 요청 사용을 가능하게 합니다.</li>\n    <li><strong>스폰서:</strong> Radon의 Element Inspector는 수동 컴포넌트 검색 없이 React Native 앱을 더 빠르게 구축할 수 있도록 돕습니다.</li>\n    <li>Building Voltra: Renderer: Widgets 및 Live Activities 라이브러리 제작자가 커스텀 렌더러의 작동 방식을 설명하며, react-reconciler가 적합하지 않아 React DOM SSR 코드에서 영감을 받았다고 합니다.</li>\n    <li>2026년 모바일 앱 다운로드 및 리텐션 증대 5가지 팁</li>\n    <li>Teleport 1.0: React Native에 진정한 네이티브 포털을 제공하며, 모바일을 위한 ReactDOM.createPortal의 대안으로, 추가적인 뷰 재부모화, 재사용, 사전 렌더링 기능을 제공합니다. 크로스 플랫폼이며 웹도 지원합니다.</li>\n    <li>Screens 4.21: Android 스택 화면 사전 로딩, iOS xcassets 아이콘 카탈로그 지원 (React Navigation에서도 사용 가능)</li>\n    <li>Xcode 26.3 RC: 에이전트 코딩 기능을 지원하며, MCP 및 RenderPreview 도구를 통해 AI에 시각적 피드백을 제공할 수 있습니다. (RN 뷰에는 작동하지 않을 수 있습니다.)</li>\n    <li>Agent-Device: iOS 및 Android 장치를 AI 에이전트용으로 제어하는 CLI (Vercel의 agent-browser와 유사)</li>\n    <li>AI SDK Profiler: Rozenite DevTools 플러그인으로 RN AI SDK에서 오는 OpenTelemetry 스팬을 검사합니다.</li>\n    <li>AI SDK 0.12: Profiler 플러그인, ai v6, Llama 모델용 툴 호출 및 재랭킹</li>\n    <li>Tamagui 2.0 RC: React를 위한 범용 스타일 라이브러리로, 더 안정적이고 쉬우며 빠르고 기능이 풍부합니다.</li>\n    <li>Uniwind 1.3: 데이터 속성 지원</li>\n    <li>Superconfig: Nitro를 사용하여 react-native-config보다 18배 빠릅니다.</li>\n    <li><strong>동영상:</strong> Callstack - Implementing an Android TurboModule from Scratch</li>\n    <li><strong>동영상:</strong> React Native Live - Infinite Red의 새로운 월간 라이브 쇼</li>\n    <li><strong>동영상:</strong> Beto - Are You Leaking Your Environment Variables? React Native + Expo</li>\n    <li><strong>동영상:</strong> Simon Grimm - 10 Tips You Need For Expo Router in 2026!</li>\n    <li>RNR 352: Expo Launch with Cedric van Putten</li>\n  </ul>\n\n  <h2>기타</h2>\n  <ul>\n    <li>State of JavaScript 2025 설문조사 결과: React와 Next.js는 사용량이 증가했지만 만족도는 감소하는 추세입니다. Astro와 Solid와 같은 대안은 높은 만족도를 보입니다.</li>\n    <li>Implementing the Temporal proposal in JavaScriptCore: JS Temporal API가 곧 모든 브라우저에 도입될 예정이며, Safari가 마지막 남은 브라우저입니다. JSC (Safari, Bun)에 대한 구현은 완료되었으나 아직 병합되지 않았습니다.</li>\n    <li>Node.js Path Traversal: Prevention & Security Guide: Node 앱을 안전하지 않은 경로 입력으로부터 보호하는 방법을 설명합니다.</li>\n    <li>Building a browser API in one shot: 전문가가 만든 프롬프트로 Claude Opus가 IndexedDB의 TypeScript 구현을 한 번에 생성할 수 있습니다.</li>\n    <li>Astro 5.17: Dev 툴바 배치, 파티션 쿠키, 비동기 파일 로더 파서</li>\n    <li>Turborepo 2.8: Git worktree 지원, Agent skills, AI 지원</li>\n    <li>Babel 7.29: Babel 7의 마지막 마이너 릴리스이며, Babel 8 RC 버전도 발표했습니다. ESM 전용으로 채택이 용이하도록 설계되었습니다.</li>\n    <li>npmx: npm 레지스트리를 위한 빠르고 현대적인 브라우저</li>\n  </ul>\n</body>","createdAt":"2026-02-04T00:00:00.000+00:00","link":"https://thisweekinreact.com/newsletter/267","language":"ko"}