{"title":"This Week In React #247: nuqs, Concurrent React, Apollo, shadcn, Streamdown, Fragment Refs, Waku, React-Aria | Expo Launch, Maestro, SPM, Screens, ExecuTorch, BottomSheet, Jest | Zod, Rspack, ESLint, CSS, Bun, Firefox","content":"<body>\n  <h2>This Week In React Summary</h2>\n  <ul>\n    <li>React community is active with new articles and releases.</li>\n    <li>Nx users: Beware of a critical supply chain attack.</li>\n    <li>AG Charts: High-performance, canvas-based charting library for React.</li>\n    <li>nuqs 2.5 released with debounce, standard schema, and more.</li>\n    <li>Next.js 15 and React 19 full-stack development guide.</li>\n    <li>React Context Selectors RFC update: focus shifts to React Compiler and Concurrent Stores.</li>\n    <li>React Types PR: Fragment Refs to enhance React fragments.</li>\n    <li>React PR: new experimental 'name' prop for `<div>` and `<span>`.</li>\n    <li>Next.js PR: unstable 'prefetch' API to control path segment prefetching.</li>\n    <li>New React docs on Custom Elements.</li>\n    <li>Remix v3 will explore a JSX-based component model.</li>\n    <li>React Summit US event in New York, November 18 & 21.</li>\n    <li>Documented React's useTransition and state update reordering.</li>\n    <li>Reflections on the React community and Vercel's incentives.</li>\n    <li>Solution for displaying current time in statically rendered React pages.</li>\n    <li>Managing toast notifications globally with Tanstack Query.</li>\n    <li>First impressions of React Server Components in React Router.</li>\n    <li>Overview of React Concurrent Features.</li>\n    <li>Guide to unlocking Web Workers with React.</li>\n    <li>Tutorial: Build a modern blog with React 19 and Strapi 5.</li>\n    <li>Apollo Client 4.0: framework-agnostic, smaller, unified error handling, better TS support.</li>\n    <li>Streamdown: drop-in replacement for react-markdown for AI streaming.</li>\n    <li>Waku releases: Vite RSC plugin, Slice Components API.</li>\n    <li>shadcn CLI 3.0: namespaced registries, search, improved error handling.</li>\n    <li>React Aria August 25 release: Popover anim, GridListSection, autocomplete.</li>\n    <li>Preact 11 beta: better hydration, default refs forwarding.</li>\n    <li>Video: Better Auth with Next.js by Alex Booker.</li>\n    <li>Video: TanStack Devtools in under 10 minutes by Alem Tuzlak.</li>\n    <li>Video: Why every dev should avoid React by Theo.</li>\n    <li>Video: AI SDK Version 5 on TanStack Start! by Jack Herrington.</li>\n    <li>Video: The Wrong Way to Optimize Performance in React by Cosden Solutions.</li>\n    <li>Podcast: Concurrent Rendering & Actions with Aurora Sharff (PodRocket).</li>\n    <li>Podcast: React beyond the DOM with Erik Rasmussen (PodRocket).</li>\n    <li>Wallaby.js: AI and time travel debugging for TypeScript/JavaScript.</li>\n    <li>React Native: Expo Launch beta for deploying iOS apps.</li>\n    <li>React Universe Conf: \"10 Years of React Native and Beyond\" panel.</li>\n    <li>React Native progress on Swift Package Manager support.</li>\n    <li>React Native RFC: Split Jest from Core.</li>\n    <li>React Native Proposal: Implementing missing CSS filters on iOS.</li>\n    <li>React Native blog post on Bridging Trace API on Android.</li>\n    <li>React Native blog post on Secure Communication Between Isolated RN Instances.</li>\n    <li>React Native blog post on Creating Development Builds Without Apple Developer Program.</li>\n    <li>React Native blog post on EAS Workflows for CI/CD.</li>\n    <li>React Native blog post on On-Device Text To Speech with AI SDK.</li>\n    <li>React Native blog post on performance tactics.</li>\n    <li>Maestro 2.0: Java 17, GraalJS, Maestro Studio Desktop, Web Testing.</li>\n    <li>Screens 4.15: Tabs improvements.</li>\n    <li>React Native ExecuTorch 0.5: Faster Whisper transcriptions, Zod structured output.</li>\n    <li>React Native Parlant: Build compliant AI chat agents.</li>\n    <li>Bottom Sheet 5.2: useBottomSheetScrollableCreator for LegendList/FlashList.</li>\n    <li>Re.Pack 5.2: Faster Transforms, TS config support, RN 0.80/0.81.</li>\n    <li>React Native Reusables: New CLI, redesigned docs.</li>\n    <li>Video: Expo SDK 54 (beta) new features by notJust.dev.</li>\n    <li>Video: Incremental React Native Adoption in iOS Apps by Callstack.</li>\n    <li>Video: When to use over the air updates by Expo.</li>\n    <li>Video: Drawer Navigation with Nested Tabs using Expo Router by Simon Grimm.</li>\n    <li>Podcast: Catching Up With Maestro by Leland Takamine (RNR 341).</li>\n    <li>Podcast: New Arch, AI Impact, and the Next Wave of RN Innovation with Jamon Holmgren (Rocket Ship 79).</li>\n    <li>Other: Visual introduction to Big O notation.</li>\n    <li>Other: Migrating Rush.js monorepo to Node type stripping.</li>\n    <li>Other: Rolling the Dice with CSS random().</li>\n    <li>Other: 5 Useful CSS functions using the new @function rule.</li>\n    <li>ESLint 9.34: Multithread Linting for significant speed improvements.</li>\n    <li>Zod 4.1: Codecs, bi-directional transformations with encode()/decode().</li>\n    <li>Rspack 1.5: Faster watchers, optimizations, browser support, Rslint announced.</li>\n    <li>Bun 1.2.21: Unified Bun.SQL client, YAML support, Bun.secrets.</li>\n    <li>Firefox 142.0: URLPattern API, scheduler API.</li>\n  </ul>\n</body>","createdAt":"2025-08-27T00:00:00.000+00:00","link":"https://thisweekinreact.com/newsletter/247","language":"en"}