{"title":"This Week In React #257: Navigation API, PPR, directives, micro-frontends, i18n, Storybook, Immer | Godot, Uniwind, RCE, iOS filters, Windows, GPU, Hermes, Meta Quest | Node LTS, Safari, Rspack, Vite, SWC, Remix","content":"<body>\n    <p>이번 주 React 및 React Native 커뮤니티의 흥미로운 업데이트와 소식을 요약합니다. 특히 directives, Partial Pre-Rendering, 성능 최적화, 마이크로 프론트엔드, i18n, React Native 개발 서버 취약점 등에 대한 내용을 다룹니다.</p>\n\n    <h2>React</h2>\n    <ul>\n        <li>\n            <p><strong>Navigation API</strong>: 모든 브라우저에서 곧 지원될 예정이며, SPA 네비게이션 방식을 혁신할 것입니다. React 팀은 이 API를 활용하여 네이티브 로딩 상태 피드백을 제공하는 Transition Indicator 기능을 개발 중입니다.</p>\n            <p><em>관련 URL 내용 요약</em>: 이 API는 기존의 History API의 단점을 보완하고, 클릭 이벤트를 가로채 `event.preventDefault()` 및 `history.pushState()`를 호출하는 번거로운 과정 없이 네비게이션 이벤트를 중앙에서 처리하고 가로챌 수 있게 합니다.</p>\n        </li>\n        <li>\n            <p><strong>Partial Prerendering</strong>: Vercel 엔지니어가 PPR의 동기와 초기 오류 기반 방식에서 Promise 기반 아키텍처로 전환된 과정을 설명합니다. 이는 웹 성능 최적화를 목표로 합니다.</p>\n        </li>\n        <li>\n            <p><strong>Next.js 16 ‘use cache’와 next-intl 연동</strong>: Next.js와 next-intl 라이브러리 간의 호환성 문제를 다루며, `headers()`에서 로케일을 읽는 방식과 관련된 문제입니다. 향후 `rootParams` API가 i18n 및 멀티 테넌시 사용 사례를 개선할 것으로 기대됩니다.</p>\n        </li>\n        <li>\n            <p><strong>컴포넌트 내 상태 캡슐화</strong>: 비동기 액션을 트리거하는 버튼의 로딩 상태를 제어된 prop으로 노출하는 대신 컴포넌트 내부에서 캡슐화하는 것이 더 나은 경우가 많다는 의견을 제시합니다.</p>\n        </li>\n        <li>\n            <p><strong>새로운 프로그래밍 프론티어: Vercel이 \"언어\"를 재정의하는 방식</strong>: directives의 동기를 설명하는 고수준 기사로, 분산 시스템 구축의 DX(개발자 경험)를 향상시키는 언어 구문을 제공합니다.</p>\n        </li>\n        <li>\n            <p><strong>스타트업이 React를 선택하는 이유 (및 그렇지 않을 때)</strong>: React 생태계의 흥미로운 통계, 특히 \"라이브러리 생존율\"에 대한 정보를 제공합니다. (결론에 대한 동의 여부는 개인에 따라 다를 수 있습니다.)</p>\n        </li>\n        <li>\n            <p><strong>Atomic State를 사용한 React 성능 향상</strong>: Jotai atoms가 불필요한 리렌더링을 방지하는 데 어떻게 도움이 되는지 보여주는 대화형 기사입니다.</p>\n        </li>\n        <li>\n            <p><strong>i18n in React 품질 보증</strong>: `i18n-check`와 같은 도구가 누락되거나 사용되지 않는 번역 키를 감지하고 CI에 유효성 검사를 통합하여 React 및 React Native 앱 전반의 번역 품질과 일관성을 개선하는 방법을 탐구합니다.</p>\n        </li>\n        <li>\n            <p><strong>Immer 10.2 및 Redux Toolkit 2.10</strong>: Immer의 최근 버전에서 발생한 성능 저하 문제와 이를 해결하기 위한 노력, 그리고 Redux Toolkit 2.10에 적용된 Immer 성능 개선 사항을 다룹니다.</p>\n        </li>\n        <li>\n            <p><strong>React Concurrent Store</strong>: 실험적인 React Concurrent Stores의 커뮤니티 빌드 버전으로, Redux 및 Relay와의 통합 테스트를 목표로 합니다.</p>\n        </li>\n        <li>\n            <p><strong>Turborepo 2.6</strong>: 로컬 마이크로 프론트엔드 개발 및 Bun 패키지 매니저 안정화를 지원합니다. Vercel은 마이크로 프론트엔드 지원 개선을 위한 기능을 개발 중인 것으로 보입니다.</p>\n        </li>\n        <li>\n            <p><strong>Storybook 10.0</strong>: ESM 전용, 모듈 자동 모킹, 타입 안전한 React CSF 팩토리가 미리 보기 기능으로 제공됩니다.</p>\n        </li>\n        <li>\n            <p><strong>TypeScript Plugin Directives</strong>: \"use server\", \"use client\", \"use cache\" 등에 대한 IDE 수준의 인식을 제공하는 언어 서비스 플러그인입니다.</p>\n        </li>\n        <li>\n            <p><strong>Ink 6.4</strong>: `onRender()` 훅이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>React Intersection Observer 10.0</strong>: 새로운 `useOnInView()` 훅이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>Next SEO 7.0</strong>: 완벽한 재작성과 새로운 API가 특징입니다.</p>\n        </li>\n        <li>\n            <p><strong>Shadcn Registry 디렉토리</strong>: 코드를 탐색하고 컴포넌트를 가져올 수 있는 코드 레지스트리 목록입니다.</p>\n        </li>\n        <li>\n            <p><strong>다양한 영상 자료</strong>: React Compiler 1.0, Next.js 16 관련 논의, React Server Components에 대한 영상이 소개되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>This Month in React 2025-10</strong>: React 19.2, React Foundation, React Native의 오래된 아키텍처 제거, Next.js의 directives에 대한 내용을 다룹니다.</p>\n        </li>\n    </ul>\n\n    <h2>React Native</h2>\n    <ul>\n        <li>\n            <p><strong>React Native + Godot</strong>: Godot 게임 엔진을 React Native 앱에 직접 임베딩하여 네이티브 뷰처럼 2D/3D 장면 및 물리 세계를 통합할 수 있는 새로운 방법을 소개합니다. iOS 및 Android에서 실행되며 전용 엔진 스레드, 일시 중지/재개 제어, TypeScript에서 전체 Godot API에 접근 가능합니다.</p>\n            <p><em>주요 기능</em>: 크로스 플랫폼 지원, 수명 주기 제어, 일시 중지/재개, 스레드 격리, 뷰 임베딩, 전체 Godot API 접근, Worklet 브릿지.</p>\n        </li>\n        <li>\n            <p><strong>Uniwind</strong>: React Native를 위한 가장 빠른 Tailwind 바인딩으로, 빌드 시간 속도, 원활한 테마화, 웹, iOS, Android 전반의 크로스 플랫폼 스타일링을 제공합니다. Tailwind v4 구문 및 일반 CSS를 이해하며, 무제한 테마 지원, 자동 React Native 바인딩, 웹과 유사한 의사 클래스 및 반응형 디자인을 지원합니다.</p>\n            <p><em>주요 기능</em>: CSS 파서, 다중 테마 지원, 자동 React Native 바인딩, 빠른 성능, 의사 클래스 및 반응형 디자인, 확장성.</p>\n        </li>\n        <li>\n            <p><strong>Meta Quest 호환성</strong>: 대부분의 Expo 라이브러리가 Meta Quest에서 잘 작동하지만, 일부 수정이 필요한 경우에 대한 정보를 제공합니다.</p>\n        </li>\n        <li>\n            <p><strong>Swift를 사용한 크로스 플랫폼 Turbo Module</strong>: Swift를 사용하여 iOS 및 Android에서 실행되는 크로스 플랫폼 Turbo Module을 구축하는 방법을 설명합니다.</p>\n        </li>\n        <li>\n            <p><strong>Hermes 임베딩 간소화</strong>: C++ 세 단계를 통해 Hermes를 임베딩하는 방법을 안내합니다.</p>\n        </li>\n        <li>\n            <p><strong>RNLConf - 🇬🇧 런던</strong>: 11월 13-14일에 열리는 React Native 컨퍼런스 티켓 구매를 독려하며, 할인 코드를 제공합니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native CLI의 심각한 RCE 취약점</strong>: 개발 서버에 영향을 미치는 취약점이 패치되었으며, 사용자는 최신 버전으로 업데이트하거나 Metro를 localhost에 바인딩해야 합니다.</p>\n        </li>\n        <li>\n            <p><strong>Reanimated PR - Shared Element Transition</strong>: 새로운 아키텍처에서의 Shared Element Transition 지원 PR이 검토 준비 상태로 이전되었으며, 기능 플래그로 제어되고 현재 범위가 제한적입니다.</p>\n        </li>\n        <li>\n            <p><strong>Expo Router PR – 정적 웹 내보내기용 서버 데이터 로더 추가</strong>: 빌드 시점에 라우트 데이터를 사전 로드하고 번들링하여 Expo 웹 앱의 빠른, 데이터 인지 정적 내보내기를 가능하게 합니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native PR - iOS용 CSS 필터 누락 구현</strong>: `grayscale`, `drop-shadow`, `saturate`, `contrast`, `hueRotate` CSS 필터 지원이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native PR - iOS용 background-size/position/repeat 지원</strong>: CSS 배경 속성에 대한 iOS 지원이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>State of React Native 2025 미리 보기 / 질문 요청</strong>: 차기 State of React Native 설문 조사를 개선하기 위한 커뮤니티 피드백을 요청합니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native RFC – React Native (Android)용 표준화된 Brownfield 통합 API</strong>: Android에서 React Native 통합을 위한 표준화된 API에 대한 RFC입니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native Windows 0.80</strong>: 새로운 아키텍처가 기본적으로 활성화되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>Flash-List 2.2</strong>: 네이티브 드라이버 스티키 헤더를 지원하는 `stickyHeaderConfig` 및 `onChangeStickyIndex`가 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>Detox 20.45</strong>: Swift 지원 및 iOS18 호환성이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native WebGPU 0.4</strong>: iOS, Android 및 visionOS와 함께 Web 지원이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>TypeGPU 0.8</strong>: 셰이더의 인체 공학, 성능 및 DX를 개선합니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native Clusterer</strong>: Nitro 기반 라이브러리로, 최대 10배 빠른 지리 공간 마커 클러스터를 제공합니다.</p>\n        </li>\n        <li>\n            <p><strong>Expo 앱에 Meta Quest 지원 추가하는 방법</strong>: `expo-horizon-core` 및 VR용 포크된 모듈을 사용하여 Meta Quest에서 Expo/React Native 앱을 실행하는 방법을 설명합니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native 온보딩은 어렵지 않습니다</strong>: Reanimated 기반의 애니메이션 및 테마를 갖춘 부드럽고 사용자 정의 가능한 온보딩 흐름을 위한 크로스 플랫폼 라이브러리를 소개합니다.</p>\n        </li>\n        <li>\n            <p><strong>Vega용 React Native - Apple & Google Photos 복제 (3부)</strong>: RN 0.72 + Fabric/TurboModules를 사용하여 Amazon의 새로운 Vega OS에 React Native 사진 갤러리 앱을 확장하는 방법을 보여줍니다.</p>\n        </li>\n        <li>\n            <p><strong>React Native 앱에서 SQLite 데이터베이스 AirDrop하는 방법</strong>: React Native 앱에서 SQLite 데이터베이스를 AirDrop하는 방법을 설명합니다.</p>\n        </li>\n        <li>\n            <p><strong>Expo 모듈을 사용한 MIDI-over-Bluetooth 앱 구축</strong>: Expo 모듈을 사용하여 MIDI-over-Bluetooth 앱을 구축하는 방법을 안내합니다.</p>\n        </li>\n        <li>\n            <p><strong>다양한 영상 자료</strong>: Swift를 사용한 React Native TurboModules 구축, Expo 앱 속도 향상 방법, Expo Router와 React Native Skia를 사용한 Liquid Tabs 생성, Expo UI에 대한 영상이 소개되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>Rocket Ship 84</strong>: Expo MCP, MMKV, Godot Games 및 React Native 패키지 혼란에 대한 내용을 다룹니다.</p>\n        </li>\n    </ul>\n\n    <h2>기타</h2>\n    <ul>\n        <li>\n            <p><strong>Node.js v22 ~ v24</strong>: Node 24.11 \"Krypton\"이 새로운 LTS 버전이 되었으며, Node.js 팀은 호환되지 않는 변경 사항을 명확하게 문서화하고 codemod를 제공합니다.</p>\n        </li>\n        <li>\n            <p><strong>setHTML(), Trusted Types 및 Sanitizer API</strong>: 웹 보안을 위한 새로운 API에 대해 설명합니다.</p>\n        </li>\n        <li>\n            <p><strong>Safari 26.2 베타</strong>: Navigation API, `commandfor`, `hidden=\"until-found\"` 등 모든 브라우저에서 지원될 예정인 새로운 기능을 포함한 대규모 Safari 릴리스입니다.</p>\n        </li>\n        <li>\n            <p><strong>Remix Interaction 0.1</strong>: Remix Jam conf에서 소개된 유연하고 구성 가능하며 타입 안전한 이벤트/상호 작용 패키지입니다.</p>\n        </li>\n        <li>\n            <p><strong>Rspack 1.6</strong>: `import defer`, ESM 출력, 배럴 최적화, 안정적인 레이어, JSX 보존 등을 개선했습니다.</p>\n        </li>\n        <li>\n            <p><strong>SWC 1.15</strong>: 안정적인 ABI 및 이전 버전과 호환되는 Wasm 플러그인을 제공합니다.</p>\n        </li>\n        <li>\n            <p><strong>Vite 7.2</strong>: `build.license` 옵션, 프록시 + HTTP2 지원 등이 추가되었습니다.</p>\n        </li>\n        <li>\n            <p><strong>Mock Service Worker 2.12</strong>: Server-Sent Events 모킹을 지원합니다.</p>\n        </li>\n        <li>\n            <p><strong>Syntax.fm - Remix 3 첫 보기</strong>: Remix 3에 대한 첫인상을 공유합니다.</p>\n        </li>\n    </ul>\n</body>\n```","createdAt":"2025-11-05T00:00:00.000+00:00","link":"https://thisweekinreact.com/newsletter/257","language":"ko"}