{"title":"Those are some S-tier animation techniques","content":"<body>\n  <h1>Frontend Focus #717 (2025년 11월 12일)</h1>\n  \n  <h2>주요 내용</h2>\n  <ul>\n    <li>\n      <h3>웹 애니메이션 성능 티어 리스트</h3>\n      <p>Matt Perry가 작성한 포괄적이고 상세한 가이드로, 렌더 파이프라인, 하드웨어 가속 등을 다루며 애니메이션 성능에 대한 모든 것을 공유합니다. 다양한 기술이 성능에 미치는 영향을 티어 리스트 형식으로 평가하며, 부드럽고 반응성 있는 UI를 목표로 하는 개발자에게 필수적인 읽을거리입니다.</p>\n    </li>\n    <li>\n      <h3>TypeScript: 첫걸음부터 전문가까지</h3>\n      <p>Anjana Vakil이 TypeScript를 단계별로 가르치며, 신뢰할 수 있는 코드를 작성하는 데 자신감을 더합니다. 실습 프로젝트를 통해 JavaScript를 TypeScript로 변환하면서 강력한 타입, 인터페이스 재사용, 타입 안전성을 앱 전체에 적용하는 방법을 배울 수 있습니다. (Frontend Masters 스폰서)</p>\n    </li>\n    <li>\n      <h3>CSS Custom Highlight API를 이용한 고성능 구문 강조</h3>\n      <p>이제 모든 주요 브라우저에서 지원되는 CSS Custom Highlight API는 JavaScript를 사용하여 텍스트 범위를 생성하고 CSS를 사용하여 스타일을 지정함으로써 문서 내 임의의 텍스트 범위에 스타일을 지정하는 메커니즘을 제공합니다. (Pavitra Golchha)</p>\n    </li>\n    <li>\n      <h3>position: sticky; 의 이상한 부분들</h3>\n      <p>매우 유용하지만 100% 올바르게 사용하는 것이 까다로울 수 있는 CSS 기능입니다. Adam Rackis는 position: sticky;가 작동하는 방식을 설명하고 일반적인 좌절점을 해결하는 방법을 강조합니다.</p>\n    </li>\n  </ul>\n  \n  <h2>간략 정보</h2>\n  <ul>\n    <li>Mosaic 브라우저가 1.0을 기록한 지 32년하고 하루가 지났습니다.</li>\n    <li>GitHub는 접근성 및 사용성 문제로 인해 '토스트(toast)' (작고 직사각형인 알림) 사용을 중단했습니다.</li>\n    <li>개발자 브라우저 Polypane는 Google에서 최근 출시한 chrome-devtools-mcp를 통해 코딩 에이전트와 상호 작용할 수 있습니다.</li>\n    <li>Mozilla는 Firefox 마스코트 'Kit'에게 새로운 모습을 선사합니다.</li>\n  </ul>\n  \n  <h2>기사, 의견 및 튜토리얼</h2>\n  <ul>\n    <li>\n      <h3>pathLength로 SVG 경로 애니메이션 관리 용이성 증대</h3>\n      <p>stroke-dasharray, stroke-dashoffset 및 CSS 전환을 결합하여 SVG 경로를 효과적으로 애니메이션하는 방법에 대한 빠른 팁입니다. (Stefan Judis)</p>\n    </li>\n    <li>\n      <h3>완벽하게 뾰족한 툴팁: 모서리까지</h3>\n      <p>지난주에 공유된 툴팁 시리즈의 최신 부분으로, 이번에는 모서리를 완벽하게 만드는 데 중점을 둡니다. (Temani Afif)</p>\n    </li>\n    <li>\n      <h3>Next로 가는 길</h3>\n      <p>Next.js 15와 React 19로 풀스택 웹 개발을 배우세요. 프론트엔드 너머로 나아가고 싶은 JavaScript 개발자에게 완벽한 조합입니다. (Robin Wieruch 스폰서)</p>\n    </li>\n    <li>\n      <h3>독학하는 프론트엔드 개발자를 위한 프로그래밍 원칙</h3>\n      <p>워크플로우를 개선하거나 바로잡는 데 도움이 될 만한 견고하고 실용적인 경험 법칙 제안입니다. (Kilian Valkhof)</p>\n    </li>\n    <li>\n      <h3>효과적인 웹 성능 모니터링</h3>\n      <p>웹 성능 최적화를 위한 전략을 설명하고 다양한 유형의 데이터가 수행하는 역할을 설명합니다. (Matt Zeunert)</p>\n    </li>\n    <li>\n      <h3>\"AI\" 브라우저: 입장료가 너무 비싸다</h3>\n      <p>\"데이터가 AI의 연료라면, 제품은 무엇인가?\" (Bruce Lawson 의견)</p>\n    </li>\n    <li>\n      <h3>반응형 배경 그라디언트와 함께 3D 무한 캐러셀 만들기</h3>\n      <p>(Clément Grellier)</p>\n    </li>\n    <li>\n      <h3>시맨틱 HTML 요소를 사용할 때의 접근성 이점 설명</h3>\n      <p>(Geoff Graham)</p>\n    </li>\n    <li>\n      <h3>100, 150 또는 200? alt 텍스트 문자 '제한'에 대한 오해 풀기</h3>\n      <p>(Chris Yoong)</p>\n    </li>\n  </ul>\n  \n  <h2>도구, 코드 및 리소스</h2>\n  <ul>\n    <li>\n      <h3>Umami 3.0: 자체 호스팅, 개인 정보 보호 중심의 Google Analytics 대안</h3>\n      <p>Plausible 및 Google Analytics와 같은 서비스의 자체 호스팅 대안입니다. 전체 기능 목록을 확인할 수 있습니다. 유료 호스팅 서비스로도 이용 가능합니다. (Umami Software, Inc.)</p>\n    </li>\n    <li>\n      <h3>Agentic Postgres: 에이전트가 코드를 짜도록 하세요</h3>\n      <p>AI 앱을 더 빠르게 구축하세요: 내장된 메모리, 검색, 무료 포크 가능한 DB를 갖춘 Postgres입니다. Tiger에서 무료로 사용해 보세요. (Tiger Data 스폰서)</p>\n    </li>\n    <li>\n      <h3>Travels: 빠르고 프레임워크에 구애받지 않는 실행 취소/다시 실행 라이브러리</h3>\n      <p>텍스트 편집기, 그리기 도구 또는 기타 대화형 소프트웨어와 같은 앱에 실행 취소/다시 실행 기능을 추가할 수 있습니다. 전체 스냅샷이 아닌 변경 사항만 저장하여 메모리 관리가 더 뛰어나다고 자랑합니다. (mutative)</p>\n    </li>\n    <li>\n      <h3>FileMock: 앱에 테스트 데이터를 추가하기 위한 무료 테스트 파일 생성기</h3>\n      <p>수십 가지 형식의 비디오, 오디오 클립, 이미지 및 문서를 생성할 수 있으며 테스트 요구 사항에 맞게 사용자 정의할 수 있습니다. (FileMock)</p>\n    </li>\n    <li>\n      <h3>sitemap.js 9.0: 사이트맵 생성 CLI 도구 및 Node.js 라이브러리</h3>\n      <p>XML '사이트맵' 파일은 검색 스파이더(예: Googlebot)가 사이트를 크롤링하는 데 도움이 되며, 현재 시스템에서 생성하지 않는 경우 이 라이브러리/CLI를 사용하여 지루한 작업을 오프로드할 수 있습니다. (Eugene Kalinin)</p>\n    </li>\n    <li>\n      <h3>Horizon: 대략적인 위치의 현재 하늘, CSS 그라디언트로 렌더링</h3>\n      <p>다른 말로 하면, 밤에 보면 그냥 검은 페이지가 될 것입니다! 😅 해가 뜨면 여기에서 결과를 볼 수 있습니다. 오래된 방식으로 meta http-equiv=\"Refresh\"(Drudge Report가 오늘날까지 사용하는 속임수)를 사용하여 최신 상태를 유지하며 서버 측에서 렌더링됩니다. (Daniel Lazaro)</p>\n    </li>\n  </ul>\n  \n  <h2>...그리고 마지막으로</h2>\n  <ul>\n    <li>\n      <h3>Scope Creep</h3>\n      <p>재미있는 '간택하라, 모험하라' 스타일의 인터랙티브 내러티브 게임입니다. 당신은 고객을 위해 '저주받은' 웹사이트 브리프를 전달해야 하는 프로젝트 매니저 역할을 맡습니다. 프로젝트 단계를 탐색하고, 선택을 하고, 피할 수 없는 문제에 직면해야 합니다. (Wondermake)</p>\n    </li>\n  </ul>\n</body>","createdAt":"2025-11-12T00:00:00.000+00:00","link":"https://frontendfoc.us/issues/717","language":"ko"}