{"title":"[Book] Hypermedia Systems","content":"<body>\n  <h2>Hypermedia Systems 서적 요약</h2>\n  <p>이 서평은 Carson Gross, Adam Stepinski, Deniz Akşimşek이 저술한 \"Hypermedia Systems\"라는 책에 대한 리뷰입니다. 리뷰어는 책의 핵심 내용인 '하이퍼미디어란 무엇인가'에 초점을 맞춰 요약하고 있습니다.</p>\n\n  <h3>1. 하이퍼미디어 시스템의 중요성</h3>\n  <ul>\n    <li>이 책은 RESTful, 하이퍼미디어 시스템 아키텍처가 다른 클라이언트-서버 시스템과 어떻게 다른지, 그리고 하이퍼미디어 접근 방식의 강점과 약점을 명확히 이해시키는 것을 목표로 합니다.</li>\n    <li>젊은 웹 개발자들이 JSON API와 React.js 기반으로 경력을 시작하면서 하이퍼미디어의 중요성을 배우지 못하는 현실을 지적하며, 이는 웹 개발 커뮤니티 리더들의 하이퍼미디어 지원 부족 때문이라고 비판합니다.</li>\n    <li>하이퍼미디어는 훌륭한 아이디어였고 지금도 그렇다고 강조합니다.</li>\n  </ul>\n\n  <h3>2. 하이퍼미디어의 역사</h3>\n  <ul>\n    <li>1974년 Ted Nelson의 \"Computer Lib/Machine Dreams\"를 현대 하이퍼미디어 시대의 시작으로 언급하며, HyperText, HyperLink, HyperMedia, HyperData, Intertwingularity 등의 용어를 창안했음을 설명합니다.</li>\n    <li>Nelson의 아이디어가 퍼지는 데 20년이 걸렸고, Douglas Engelbart, Wendy Hall, Tim Berners-Lee 등을 거쳐 오늘날 월드와이드웹(WWW), HTML, HTTP의 근간이 되었음을 이야기합니다.</li>\n    <li>2000년 Roy Fielding의 박사 학위 논문 \"Architectural Styles and the Design of Network-based Software Architectures\"에서 REpresentational State Transfer(REST) 모델이 정의되었고, 2008년 Leonard Richardson과 Sam Ruby의 \"RESTful Web Services\" 출간으로 널리 알려졌다고 설명합니다.</li>\n    <li>Richardson과 Ruby의 책은 REST의 힘뿐만 아니라 이를 구축하는 방법에 대한 실용적인 가이드라인을 제공했다고 평가합니다.</li>\n  </ul>\n\n  <h3>3. RESTful과 JSON API의 구분</h3>\n  <ul>\n    <li>하이퍼미디어 시스템은 Roy Fielding이 정의한 RESTful 네트워크 아키텍처를 준수하는 시스템으로 정의합니다.</li>\n    <li>오늘날 'REST'라는 용어가 JSON API와 연관되어 잘못 사용되고 있음을 지적합니다. JSON API는 하이퍼미디어 컨트롤이 없어 진정한 하이퍼미디어가 아니며, 하이퍼미디어 교환은 RESTful 시스템의 명시적인 요구 사항임을 강조합니다.</li>\n    <li>Fielding은 당시 웹 브라우저와 HTML, HTTP로 이루어진 월드와이드웹을 설명했으며, 이를 RESTful이라고 불렀다고 설명합니다. JSON API가 일반화되기 전 REST는 하이퍼미디어와 웹 1.0 버전에 관한 것이었습니다.</li>\n  </ul>\n\n  <h3>4. 하이퍼미디어의 현재와 SPA와의 비교</h3>\n  <ul>\n    <li>하이퍼미디어는 여전히 탐구되지 않은 개념으로 남아 있으며, 주로 전문가들의 영역이 되었습니다. HTML 작성법은 많지만, HTML을 하이퍼미디어로 보는 논의나 하이퍼미디어 시스템 구성에 대한 논의는 드물다고 지적합니다.</li>\n    <li>초기 웹 개발 시대에는 REST와 HATEOAS가 자주 논의되었음을 언급합니다.</li>\n    <li>하이퍼미디어는 텍스트와 같은 미디어 내에서 비선형적으로 분기되는 기능을 포함하며, 이 분기는 하이퍼링크를 통해 이루어진다고 설명합니다. HTML은 읽기 전용 하이퍼미디어로 시작하여 form 태그 도입으로 애플리케이션 구축이 가능해졌습니다.</li>\n    <li>하이퍼미디어 서버는 새 페이지에 대한 HTML 응답으로 클라이언트와 통신하며, 이는 진정한 RESTful 하이퍼미디어 시스템의 중요한 측면이라고 강조합니다.</li>\n    <li>JSON API 기반 서버 상호 작용은 하이퍼미디어를 사용하지 않으며, 하이퍼링크나 컨트롤이 없다고 설명합니다. HTML은 UI 구축에 사용되지만, 앵커 태그와 form 태그의 하이퍼미디어 측면은 JavaScript를 통해 동기화되는 방식으로 사용되지 않습니다.</li>\n    <li>싱글 페이지 애플리케이션(SPA) 접근 방식은 하이퍼미디어 아키텍처를 포기하고 JavaScript 중심의 동작을 선호하며, 이는 1980년대의 클라이언트-서버 애플리케이션과 유사하다고 지적합니다.</li>\n    <li>SPA는 기존 웹 1.0 하이퍼미디어 기반 애플리케이션보다 인터랙티브하고 몰입감 있는 경험을 제공하지만, 이는 하이퍼미디어 아키텍처 자체의 우월성 때문이 아니라 HTML의 상호작용성과 표현력 부족 때문에 발생한 현상이라고 설명합니다.</li>\n    <li>하이퍼미디어 아키텍처는 다음과 같은 장점을 가집니다.\n      <ul>\n        <li>매우 간단한 웹 애플리케이션 구축 방식</li>\n        <li>콘텐츠 및 API 변경에 대한 관용성</li>\n        <li>브라우저의 검증된 기능(캐싱 등) 활용</li>\n      </ul>\n    </li>\n    <li>SPA는 복잡한 인프라, API 변경으로 인한 문제('JSON API 이탈'), 'JavaScript 피로감' 등을 야기하는데, 하이퍼미디어 아키텍처는 이러한 문제를 해소할 수 있다고 믿습니다.</li>\n  </ul>\n\n  <h3>5. 하이퍼미디어의 발전 저해 요인과 MPA</h3>\n  <ul>\n    <li>HTML이 하이퍼미디어로서 크게 발전하지 않았고(거의 30년간 새로운 상호작용 방식 부재), 웹 사용자의 요구는 증가하여 JavaScript 기반 SPA가 등장하게 된 역사적 배경을 설명합니다.</li>\n    <li>MPA(Multi Page Application)는 링크와 양식을 사용하여 HTTP 요청을 보내고 HTML 응답을 받는 기존 웹 1.0 방식을 현대적으로 부른 것이며, 이는 하이퍼미디어 중심 애플리케이션으로 Roy Fielding의 REST 모델과 정확히 일치한다고 말합니다.</li>\n    <li>Svelte.js 창시자 Rich Harris가 제안한 MPA와 SPA를 혼합하는 '과도기적' 접근 방식도 언급하며, 이는 두 접근 방식 간의 절충안이지만 불만족스럽다고 평가합니다.</li>\n    <li>하이퍼미디어 지향 라이브러리를 채택하면 MPA와 SPA 간의 상호작용성 격차를 좁힐 수 있으며, 사용자 인터페이스를 손상하지 않고 MPA, 즉 하이퍼미디어 접근 방식을 더 많은 애플리케이션에 적용할 수 있다고 설명합니다.</li>\n  </ul>\n\n  <h3>6. htmx와 하이퍼미디어 우선 접근 방식</h3>\n  <ul>\n    <li>주로 또는 전체적으로 하이퍼미디어 중심이면서 사용자 상호작용을 충족하는 웹 애플리케이션을 만들 수 있으며, 이는 웹 애플리케이션을 단순화하고 일관성 있으며 이해하기 쉬운 소프트웨어를 만듭니다.</li>\n    <li>htmx는 이러한 하이퍼미디어 우선 접근 방식을 가능하게 하는 라이브러리 중 하나로 소개됩니다.</li>\n    <li>htmx로 구축된 웹 애플리케이션을 '하이퍼미디어 기반 애플리케이션(HDA)'으로 정의하며, 이는 하이퍼미디어 및 하이퍼미디어 교환을 서버와의 통신 기본 메커니즘으로 사용합니다.</li>\n    <li>htmx는 JavaScript를 통해 HTML을 보강하며, 웹의 하이퍼미디어 시스템을 확장하는 것이지 대체하는 것이 아니라고 설명합니다. htmx 버튼과 JavaScript 기반 버튼은 시스템 아키텍처가 다르다고 강조합니다.</li>\n  </ul>\n\n  <h3>7. 하이퍼미디어 아키텍처의 장점</h3>\n  <ul>\n    <li>대부분의 웹사이트는 정적인 성격이 강하며, 이러한 애플리케이션에 하이퍼미디어 방식을 채택하면 SPA의 클라이언트 측 복잡성을 줄이고 서버의 가치 창출에 집중할 수 있습니다.</li>\n    <li>htmx와 같은 라이브러리를 사용하면 바닐라 HTML의 사용성 문제를 해결하고 더 세분화된 하이퍼미디어 전송을 활용하여 사용자 경험의 가능성을 넓힐 수 있습니다.</li>\n  </ul>\n\n  <h3>8. 하이퍼미디어의 구성 요소</h3>\n  <ul>\n    <li>하이퍼미디어 서버는 HTTP 응답으로 HTML을 반환하는 모든 서버를 의미하며, 거의 모든 프로그래밍 언어로 구축 가능합니다.</li>\n    <li>하이퍼미디어 클라이언트는 하이퍼미디어를 해석하고 렌더링하는 소프트웨어로, 웹 브라우저가 대표적입니다.</li>\n    <li>Hyperview는 모바일 하이퍼미디어로, HXML과 해당 하이퍼미디어 클라이언트를 모두 제공합니다.</li>\n  </ul>\n\n  <h3>9. 스크립팅과 하이퍼미디어</h3>\n  <ul>\n    <li>스크립팅은 웹의 원래 RESTful 모델의 기본 측면이었으며, 하이퍼미디어 중심 애플리케이션에서도 허용되어야 합니다.</li>\n    <li>하지만 JavaScript는 하이퍼미디어 모델을 보강하기보다는 대체하는 데 자주 사용된다고 지적합니다.</li>\n  </ul>\n\n  <h3>10. 결론: 하이퍼미디어의 현대적 가치</h3>\n  <ul>\n    <li>\"순수한\" HTML의 링크와 양식을 구식 도구로 여기는 경향이 있지만, JavaScript 라이브러리들이 HTML의 한계를 해결하며 확장하고 있다고 말합니다.</li>\n    <li>하이퍼미디어 기반 애플리케이션 접근 방식이 모든 애플리케이션에 적합하지는 않지만, 많은 애플리케이션에 유연성과 단순성을 제공하며 큰 이점이 될 수 있습니다.</li>\n    <li>이 접근 방식과 그 장단점을 이해하는 것은 가치 있으며, 웹 개발은 기존 기술 위에 구축하고 발전시키는 것이 중요하다고 강조합니다.</li>\n    <li>새로운 기술에 대한 압박 속에서, 로이 필딩의 REST와 같이 간과된 훌륭한 아이디어를 재발견하고 활용할 때가 되었다고 주장합니다.</li>\n    <li>아마도 하이퍼미디어에 다시 한번 기회를 줄 때라고 제언하며 글을 맺습니다.</li>\n  </ul>\n</body>","createdAt":"2025-12-29T14:31:44.000+00:00","link":"https://blog.outsider.ne.kr/1780","language":"ko"}