{"content":"<body>\n<ul>\n<li>ViteConf 2024에서 Vite 창립자 Evan You는 Vite의 성과와 JavaScript 도구의 미래를 발표했습니다.</li>\n<li>Evan You는 JavaScript 생태계의 고성능 통합 툴체인 구축을 위해 VoidZero를 창업했습니다.</li>\n<li>Next.js Conf 2024에서는 Next.js의 발전 방향과 함께 Turbopack 속도 개선, 데이터 캐싱 및 렌더링 최적화, 에러 메시지 개선 등을 발표했습니다.</li>\n<li>Adobe에서 공유된 번들러의 과거, 현재, 미래 영상에서는 초기 시절부터 최신 웹 툴링까지의 발전 과정을 설명합니다.</li>\n<li>\"Web Crap Has Taken Control\" 글은 현대 웹 개발의 기술 스택 과잉이 성능 저하와 사용자 경험 악화를 초래한다고 비판합니다.</li>\n<li>JavaScript의 기본값 매개변수 활용법에 대한 글은 이전 형제 매개변수를 기본값으로 사용하는 방법을 소개합니다.</li>\n<li>\"Dev Encyclopedia\"는 기술 용어, 개념, 프로그래밍 언어 전문 용어에 대한 설명과 추가 자료 링크를 제공합니다.</li>\n<li>\"Web Browser Engineering\" 책은 수천 줄의 파이썬으로 완벽한 웹 브라우저를 구축하는 방법을 설명합니다.</li>\n<li>\"Escaping the Chrome Sandbox Through DevTools\"는 Chrome 브라우저의 취약점을 통해 샌드박스 탈출 방법을 자세히 설명합니다.</li>\n<li>\"Smarter than 'Ctrl+F': Linking Directly to Web Page Content\"는 Text fragments를 사용하여 웹 문서의 특정 텍스트 부분에 직접 연결하는 방법을 소개합니다.</li>\n<li>\"React Folder Structure in 5 Steps\"는 React 프로젝트 구조를 효율적으로 정리하고 구성하는 5단계 접근법을 제시합니다.</li>\n<li>Deno 2.0 업데이트를 통해 Node.js 및 npm 호환성이 충분히 지원되어 더 많은 사용자를 유치할 수 있게 되었습니다.</li>\n<li>\"Node vs Bun: no backend performance difference\" 글은 Node.js와 Bun의 백엔드 성능 벤치마크 테스트 결과를 공유합니다.</li>\n<li>\"Compile and Run C in JavaScript using Bun\"은 Bun이 C 코드를 JavaScript에서 직접 컴파일하고 실행하는 방법을 소개합니다.</li>\n<li>ESLint가 JSON 및 Markdown 파일에 대한 린팅 지원을 추가하여 프로젝트 내 문서 및 설정 파일의 일관성 관리도 가능해졌습니다.</li>\n<li>\"Understanding the Difference Between File and Blob Objects\"는 JavaScript Blob과 File 객체의 차이점과 사용 예제를 설명합니다.</li>\n<li>\"Migrating from Create React App to Vite\"는 CRA로 만들어진 ReCalendar를 Vite로 전환하는 과정에서 생긴 문제와 해결 방법을 공유하며 Vite 전환을 추천합니다.</li>\n<li>\"A Guide to animations that feels right\"는 인터랙션 디자인의 중요한 요소인 애니메이션에 대한 가이드를 제시합니다.</li>\n<li>\"Build frontend applications at scale\"는 대규모 Front-end 애플리케이션 구축에 관련된 아키텍처 및 설계 관점을 다루는 무료 동영상 강좌입니다.</li>\n<li>Zustand 5.0은 번들 사이즈가 절반 이하로 줄었고, deprecated 된 기능 및 오래된 것들이 제거되었습니다.</li>\n<li>Oxc 프로젝트에서 새로운 트랜스파일러인 Oxc Transformer Alpha를 공개했습니다.</li>\n<li>ARIA DevTools Chrome 확장 프로그램은 웹 사이트에서 누락되거나 잘못 사용된 ARIA 라벨 및 역할을 쉽게 발견하고 테스트할 수 있습니다.</li>\n<li>\"pkg-graph\"는 입력한 NPM 패키지의 의존성 패키지들을 시각화하여 표현해 줍니다.</li>\n</ul>\n</body>","createdAt":"2025-08-12T16:33:16.051Z","language":"ko"}