{"title":"[FE News] 2026-01","content":"<body>\n    <h1>GitHub 소식: 2026년 1월</h1>\n    <p><strong>Introducing RSC Explorer</strong></p>\n    <p>Dan Abramov가 React Server Components(RSC) 프로토콜을 시각화하는 도구인 RSC Explorer를 공개했습니다. 이 도구를 통해 브라우저에서 RSC 스트림을 단계별로 재생하고 분해하여 스트리밍, Client Reference, Server Actions, Router refresh 등 프레임워크 내부 동작 원리를 이해할 수 있습니다. RSC 디버깅 및 교육 자료로 활용하기 좋습니다.</p>\n    <p><strong>Web AI Summit 2025</strong></p>\n    <p>클라이언트 사이드 모델과 에이전트를 주제로 하는 행사입니다. 웹에서 AI가 서버 호출 중심에서 브라우저 실행 및 에이전트 상호작용으로 이동하는 흐름을 보여줍니다. 주요 세션으로는 Transformers.js, webMCP, Wasm/WebGPU/WebNN, 작은 AI 모델 활용, Chrome 내장 AI API 활용 사례 등이 있습니다.</p>\n    <p><strong>How to write a great agents.md: Lessons from over 2,500 repositories</strong></p>\n    <p>GitHub이 2,500개 이상의 저장소를 분석하여 효과적인 agents.md 작성 패턴을 정리했습니다. 핵심은 실행 가능한 명령어를 앞에 배치하고, 명확한 경계 표시, 스택 버전 명시 등입니다. 팀 단위 에이전트 운영 시 좋은 시작점이 될 수 있습니다.</p>\n    <p><strong>Stanford AI Club: Jeff Dean on Important AI Trends</strong></p>\n    <p>Jeff Dean이 연구 및 제품 관점에서 중요한 AI 트렌드를 정리했습니다. 프런트엔드 관점에서는 브라우저/클라이언트에서 AI 적용 방법과 제품 UX 변화 지점을 탐색하는 데 힌트를 얻을 수 있습니다.</p>\n    <p><strong>How AI will change software engineering – with Martin Fowler</strong></p>\n    <p>Martin Fowler와 함께 AI가 소프트웨어 엔지니어링을 어떻게 변화시킬지 논의합니다. 아키텍처, 팀 프로세스, 품질 관리, 교육/리뷰 방식 변화 등 다양한 영역에 대한 영향을 다룹니다.</p>\n    <p><strong>AI paradox: faster coding, slower shipping</strong></p>\n    <p>코딩 속도는 빨라지지만 출시 속도는 정체되는 역설을 다룹니다. “70%의 함정”, 컨텍스트 엔지니어링, 코드 검토 위기 등을 핵심 주제로 다룹니다.</p>\n    <p><strong>The Thinking Game | Full documentary | Tribeca Film Festival official selection</strong></p>\n    <p>DeepMind 설립과 여정을 담은 다큐멘터리로, 인공 일반 지능(AGI) 탐구를 다룹니다. AlphaFold 개발 과정을 포함합니다.</p>\n    <p><strong>Building with Cursor ft Designers from Cursor (Ryo Lu), Notion (Jin Park), and Ramp (Catherine Wang)</strong></p>\n    <p>Cursor를 워크플로에 적용하는 디자이너들의 사례를 공유합니다. 디자이너와 엔지니어 협업의 경계 변화를 다룹니다.</p>\n    <p><strong>Building the PERFECT Linux PC with Linus Torvalds</strong></p>\n    <p>Linus Torvalds가 Linux PC 빌드에 대해 이야기하며, 개발자 워크스테이션에 대한 하드웨어 선택 기준과 Linux 개발 환경 선호 지점을 다룹니다.</p>\n    <p><strong>우아콘 2025</strong></p>\n    <p>우아한테크 채널에서 공개된 우아콘 2025 전체 세션 영상입니다. 디자인 시스템, 성능 최적화, AI 네이티브 조직 등 다양한 주제를 포함합니다.</p>\n    <p><strong>Programming principles for self taught front-end developers</strong></p>\n    <p>공식 컴퓨터 과학 교육 없이 프런트엔드 개발을 시작한 개발자를 위한 실용적인 프로그래밍 원칙 가이드입니다. “세 번의 법칙”, YAGNI, DRY 등의 원칙을 통합하여 설명합니다.</p>\n    <p><strong>I’ve never felt this much behind as a programmer</strong></p>\n    <p>Andrej Karpathy가 AI 시대에 프로그래머로서 느끼는 뒤처짐과 직업의 재구성을 이야기합니다. 새로운 프로그래밍 가능한 추상화 레이어를 마스터해야 한다고 강조합니다.</p>\n    <p><strong>GitHub Copilot now supports Agent Skills</strong></p>\n    <p>GitHub Copilot이 Agent Skills를 지원하기 시작했습니다. Agent Skills는 Copilot에 특정 작업을 반복 가능한 방식으로 수행하도록 가르치는 메커니즘입니다.</p>\n    <p><strong>30 Years of Tags</strong></p>\n    <p>30년간의 웹 개발 여정을 회고하며, 웹 개발의 진화 과정을 시대별로 정리했습니다.</p>\n    <p><strong>Useful patterns for building HTML tools</strong></p>\n    <p>단일 HTML 파일로 구성된 도구 제작 경험을 바탕으로, HTML, JavaScript, CSS를 하나의 파일에 담아 배포, 공유, 실행을 단순화하는 패턴과 기법을 공유합니다.</p>\n    <p><strong>State of HTML 2025</strong></p>\n    <p>현대 웹 플랫폼의 HTML 기능과 트렌드를 조사하는 설문조사입니다. 개발자들의 기능 사용 경험과 감성을 분석하며, Lazy loading이 가장 높은 채택률을 기록했습니다.</p>\n    <h2>튜토리얼</h2>\n    <p><strong>Full Tutorial: Design to Code in 45 Min with Cursor’s Head of Design</strong></p>\n    <p>Cursor의 디자인 책임자가 디자이너가 실제 코드를 배포하는 방식을 45분간 실시간으로 보여주는 튜토리얼입니다.</p>\n    <p><strong>Prompting 101 | Code w/ Claude</strong></p>\n    <p>Anthropic의 “Code w/ Claude” 세션으로, 프롬프트 기본기를 개발자 실전 관점에서 정리합니다.</p>\n    <p><strong>AWS 직원이 알려주는 AWS 클라우드 아키텍처</strong></p>\n    <p>“AWS 인프라 구축 입문” 서적의 온라인 버전으로, AWS 아키텍처를 실습 중심으로 배울 수 있습니다.</p>\n    <p><strong>Vitest Browser Mode - The Future of Frontend Testing</strong></p>\n    <p>Vitest Browser Mode의 개념부터 설정, 실전 사용법까지 다루는 종합 가이드입니다. 실제 브라우저에서 컴포넌트 격리 테스트를 지원합니다.</p>\n    <p><strong>AI-Crash-Course</strong></p>\n    <p>“2주 안에 AI 연구 프런티어 따라잡기”를 목표로 하는 리소스 모음입니다. LLM, 에이전트, 프롬프트 엔지니어링 등 핵심 주제를 다룹니다.</p>\n    <h2>코드와 도구</h2>\n    <p><strong>Context Buddy - Prompt Structure Builder</strong></p>\n    <p>프롬프트를 구조화된 형태로 조립하는 빌더입니다. Task/Tone/Background/Rules/Examples/History/Request/Thinking/Output/Prefill 10단계 프레임을 제공합니다.</p>\n    <p><strong>module-replacements</strong></p>\n    <p>JS 모듈과 대체품들의 매니페스트를 제공하는 프로젝트입니다. 오래되거나 유지보수가 중단된 패키지를 현대적인 대안으로 교체하는 데 도움을 줍니다.</p>\n    <p><strong>Nook</strong></p>\n    <p>macOS용 “sidebar-first” 미니멀 브라우저입니다. 수직 탭 중심 UI와 성능, 메모리 효율을 강조합니다.</p>\n    <p><strong>fate</strong></p>\n    <p>React와 tRPC를 위한 현대적 데이터 클라이언트입니다. view composition, normalized caching, data masking, Async React 기능을 tRPC의 타입 안전성과 결합합니다.</p>\n    <p><strong>React Zero UI</strong></p>\n    <p>재렌더링 없이 반응형 UI 상태를 관리하는 React 라이브러리입니다. 빌드 타임에 UI 상태를 미리 렌더링하고, data- 속성을 변경해 업데이트하는 방식으로 동작합니다.</p>\n    <p><strong>onyx</strong></p>\n    <p>셀프호스팅이 가능한 AI Chat 플랫폼입니다. 다양한 LLM 연결, RAG, Agents, Web Search 등 엔터프라이즈 기준 기능에 초점을 맞춥니다.</p>\n    <p><strong>eslint-plugin-react-you-might-not-need-an-effect</strong></p>\n    <p>useEffect의 불필요한 사용을 찾는 ESLint 플러그인입니다.</p>\n    <h2>🧑🏻‍💻 from NAVER Front-end</h2>\n    <p><strong>디자인시스템이 AI를 만났을 때: FE 개발 패러다임의 변화</strong></p>\n    <p>네이버파이낸셜 디자인시스템과 AI를 활용한 마크업 자동화 작업 경험을 공유합니다. Figma 디자인을 AI가 컴포넌트 기반 마크업으로 생성하도록 하는 실험을 다룹니다.</p>\n</body>","createdAt":"2026-01-07T01:18:57.000+00:00","link":"https://fenews.substack.com/p/fe-news-2026-01","language":"ko"}